export default [
  {
    "ID": "1",
    "PARENT_ID": "0",
    "CODE": "110000",
    "NAME": "北京市"
  },
  {
    "ID": "10",
    "PARENT_ID": "2",
    "CODE": "110111",
    "NAME": "房山区"
  },
  {
    "ID": "100",
    "PARENT_ID": "89",
    "CODE": "130427",
    "NAME": "磁县"
  },
  {
    "ID": "1000",
    "PARENT_ID": "999",
    "CODE": "321301",
    "NAME": "市辖区"
  },
  {
    "ID": "1001",
    "PARENT_ID": "999",
    "CODE": "321302",
    "NAME": "宿城区"
  },
  {
    "ID": "1002",
    "PARENT_ID": "999",
    "CODE": "321311",
    "NAME": "宿豫区"
  },
  {
    "ID": "1003",
    "PARENT_ID": "999",
    "CODE": "321322",
    "NAME": "沭阳县"
  },
  {
    "ID": "1004",
    "PARENT_ID": "999",
    "CODE": "321323",
    "NAME": "泗阳县"
  },
  {
    "ID": "1005",
    "PARENT_ID": "999",
    "CODE": "321324",
    "NAME": "泗洪县"
  },
  {
    "ID": "1006",
    "PARENT_ID": "0",
    "CODE": "330000",
    "NAME": "浙江省"
  },
  {
    "ID": "1007",
    "PARENT_ID": "1006",
    "CODE": "330100",
    "NAME": "杭州市"
  },
  {
    "ID": "1008",
    "PARENT_ID": "1007",
    "CODE": "330101",
    "NAME": "市辖区"
  },
  {
    "ID": "1009",
    "PARENT_ID": "1007",
    "CODE": "330102",
    "NAME": "上城区"
  },
  {
    "ID": "101",
    "PARENT_ID": "89",
    "CODE": "130428",
    "NAME": "肥乡县"
  },
  {
    "ID": "1010",
    "PARENT_ID": "1007",
    "CODE": "330103",
    "NAME": "下城区"
  },
  {
    "ID": "1011",
    "PARENT_ID": "1007",
    "CODE": "330104",
    "NAME": "江干区"
  },
  {
    "ID": "1012",
    "PARENT_ID": "1007",
    "CODE": "330105",
    "NAME": "拱墅区"
  },
  {
    "ID": "1013",
    "PARENT_ID": "1007",
    "CODE": "330106",
    "NAME": "西湖区"
  },
  {
    "ID": "1014",
    "PARENT_ID": "1007",
    "CODE": "330108",
    "NAME": "滨江区"
  },
  {
    "ID": "1015",
    "PARENT_ID": "1007",
    "CODE": "330109",
    "NAME": "萧山区"
  },
  {
    "ID": "1016",
    "PARENT_ID": "1007",
    "CODE": "330110",
    "NAME": "余杭区"
  },
  {
    "ID": "1017",
    "PARENT_ID": "1007",
    "CODE": "330122",
    "NAME": "桐庐县"
  },
  {
    "ID": "1018",
    "PARENT_ID": "1007",
    "CODE": "330127",
    "NAME": "淳安县"
  },
  {
    "ID": "1019",
    "PARENT_ID": "1007",
    "CODE": "330182",
    "NAME": "建德市"
  },
  {
    "ID": "102",
    "PARENT_ID": "89",
    "CODE": "130429",
    "NAME": "永年县"
  },
  {
    "ID": "1020",
    "PARENT_ID": "1007",
    "CODE": "330183",
    "NAME": "富阳市"
  },
  {
    "ID": "1021",
    "PARENT_ID": "1007",
    "CODE": "330185",
    "NAME": "临安市"
  },
  {
    "ID": "1022",
    "PARENT_ID": "1006",
    "CODE": "330200",
    "NAME": "宁波市"
  },
  {
    "ID": "1023",
    "PARENT_ID": "1022",
    "CODE": "330201",
    "NAME": "市辖区"
  },
  {
    "ID": "1024",
    "PARENT_ID": "1022",
    "CODE": "330203",
    "NAME": "海曙区"
  },
  {
    "ID": "1025",
    "PARENT_ID": "1022",
    "CODE": "330204",
    "NAME": "江东区"
  },
  {
    "ID": "1026",
    "PARENT_ID": "1022",
    "CODE": "330205",
    "NAME": "江北区"
  },
  {
    "ID": "1027",
    "PARENT_ID": "1022",
    "CODE": "330206",
    "NAME": "北仑区"
  },
  {
    "ID": "1028",
    "PARENT_ID": "1022",
    "CODE": "330211",
    "NAME": "镇海区"
  },
  {
    "ID": "1029",
    "PARENT_ID": "1022",
    "CODE": "330212",
    "NAME": "鄞州区"
  },
  {
    "ID": "103",
    "PARENT_ID": "89",
    "CODE": "130430",
    "NAME": "邱县"
  },
  {
    "ID": "1030",
    "PARENT_ID": "1022",
    "CODE": "330225",
    "NAME": "象山县"
  },
  {
    "ID": "1031",
    "PARENT_ID": "1022",
    "CODE": "330226",
    "NAME": "宁海县"
  },
  {
    "ID": "1032",
    "PARENT_ID": "1022",
    "CODE": "330281",
    "NAME": "余姚市"
  },
  {
    "ID": "1033",
    "PARENT_ID": "1022",
    "CODE": "330282",
    "NAME": "慈溪市"
  },
  {
    "ID": "1034",
    "PARENT_ID": "1022",
    "CODE": "330283",
    "NAME": "奉化市"
  },
  {
    "ID": "1035",
    "PARENT_ID": "1006",
    "CODE": "330300",
    "NAME": "温州市"
  },
  {
    "ID": "1036",
    "PARENT_ID": "1035",
    "CODE": "330301",
    "NAME": "市辖区"
  },
  {
    "ID": "1037",
    "PARENT_ID": "1035",
    "CODE": "330302",
    "NAME": "鹿城区"
  },
  {
    "ID": "1038",
    "PARENT_ID": "1035",
    "CODE": "330303",
    "NAME": "龙湾区"
  },
  {
    "ID": "1039",
    "PARENT_ID": "1035",
    "CODE": "330304",
    "NAME": "瓯海区"
  },
  {
    "ID": "104",
    "PARENT_ID": "89",
    "CODE": "130431",
    "NAME": "鸡泽县"
  },
  {
    "ID": "1040",
    "PARENT_ID": "1035",
    "CODE": "330322",
    "NAME": "洞头县"
  },
  {
    "ID": "1041",
    "PARENT_ID": "1035",
    "CODE": "330324",
    "NAME": "永嘉县"
  },
  {
    "ID": "1042",
    "PARENT_ID": "1035",
    "CODE": "330326",
    "NAME": "平阳县"
  },
  {
    "ID": "1043",
    "PARENT_ID": "1035",
    "CODE": "330327",
    "NAME": "苍南县"
  },
  {
    "ID": "1044",
    "PARENT_ID": "1035",
    "CODE": "330328",
    "NAME": "文成县"
  },
  {
    "ID": "1045",
    "PARENT_ID": "1035",
    "CODE": "330329",
    "NAME": "泰顺县"
  },
  {
    "ID": "1046",
    "PARENT_ID": "1035",
    "CODE": "330381",
    "NAME": "瑞安市"
  },
  {
    "ID": "1047",
    "PARENT_ID": "1035",
    "CODE": "330382",
    "NAME": "乐清市"
  },
  {
    "ID": "1048",
    "PARENT_ID": "1006",
    "CODE": "330400",
    "NAME": "嘉兴市"
  },
  {
    "ID": "1049",
    "PARENT_ID": "1048",
    "CODE": "330401",
    "NAME": "市辖区"
  },
  {
    "ID": "105",
    "PARENT_ID": "89",
    "CODE": "130432",
    "NAME": "广平县"
  },
  {
    "ID": "1050",
    "PARENT_ID": "1048",
    "CODE": "330402",
    "NAME": "南湖区"
  },
  {
    "ID": "1051",
    "PARENT_ID": "1048",
    "CODE": "330411",
    "NAME": "秀洲区"
  },
  {
    "ID": "1052",
    "PARENT_ID": "1048",
    "CODE": "330421",
    "NAME": "嘉善县"
  },
  {
    "ID": "1053",
    "PARENT_ID": "1048",
    "CODE": "330424",
    "NAME": "海盐县"
  },
  {
    "ID": "1054",
    "PARENT_ID": "1048",
    "CODE": "330481",
    "NAME": "海宁市"
  },
  {
    "ID": "1055",
    "PARENT_ID": "1048",
    "CODE": "330482",
    "NAME": "平湖市"
  },
  {
    "ID": "1056",
    "PARENT_ID": "1048",
    "CODE": "330483",
    "NAME": "桐乡市"
  },
  {
    "ID": "1057",
    "PARENT_ID": "1006",
    "CODE": "330500",
    "NAME": "湖州市"
  },
  {
    "ID": "1058",
    "PARENT_ID": "1057",
    "CODE": "330501",
    "NAME": "市辖区"
  },
  {
    "ID": "1059",
    "PARENT_ID": "1057",
    "CODE": "330502",
    "NAME": "吴兴区"
  },
  {
    "ID": "106",
    "PARENT_ID": "89",
    "CODE": "130433",
    "NAME": "馆陶县"
  },
  {
    "ID": "1060",
    "PARENT_ID": "1057",
    "CODE": "330503",
    "NAME": "南浔区"
  },
  {
    "ID": "1061",
    "PARENT_ID": "1057",
    "CODE": "330521",
    "NAME": "德清县"
  },
  {
    "ID": "1062",
    "PARENT_ID": "1057",
    "CODE": "330522",
    "NAME": "长兴县"
  },
  {
    "ID": "1063",
    "PARENT_ID": "1057",
    "CODE": "330523",
    "NAME": "安吉县"
  },
  {
    "ID": "1064",
    "PARENT_ID": "1006",
    "CODE": "330600",
    "NAME": "绍兴市"
  },
  {
    "ID": "1065",
    "PARENT_ID": "1064",
    "CODE": "330601",
    "NAME": "市辖区"
  },
  {
    "ID": "1066",
    "PARENT_ID": "1064",
    "CODE": "330602",
    "NAME": "越城区"
  },
  {
    "ID": "1067",
    "PARENT_ID": "1064",
    "CODE": "330603",
    "NAME": "柯桥区"
  },
  {
    "ID": "1068",
    "PARENT_ID": "1064",
    "CODE": "330604",
    "NAME": "上虞区"
  },
  {
    "ID": "1069",
    "PARENT_ID": "1064",
    "CODE": "330624",
    "NAME": "新昌县"
  },
  {
    "ID": "107",
    "PARENT_ID": "89",
    "CODE": "130434",
    "NAME": "魏县"
  },
  {
    "ID": "1070",
    "PARENT_ID": "1064",
    "CODE": "330681",
    "NAME": "诸暨市"
  },
  {
    "ID": "1071",
    "PARENT_ID": "1064",
    "CODE": "330683",
    "NAME": "嵊州市"
  },
  {
    "ID": "1072",
    "PARENT_ID": "1006",
    "CODE": "330700",
    "NAME": "金华市"
  },
  {
    "ID": "1073",
    "PARENT_ID": "1072",
    "CODE": "330701",
    "NAME": "市辖区"
  },
  {
    "ID": "1074",
    "PARENT_ID": "1072",
    "CODE": "330702",
    "NAME": "婺城区"
  },
  {
    "ID": "1075",
    "PARENT_ID": "1072",
    "CODE": "330703",
    "NAME": "金东区"
  },
  {
    "ID": "1076",
    "PARENT_ID": "1072",
    "CODE": "330723",
    "NAME": "武义县"
  },
  {
    "ID": "1077",
    "PARENT_ID": "1072",
    "CODE": "330726",
    "NAME": "浦江县"
  },
  {
    "ID": "1078",
    "PARENT_ID": "1072",
    "CODE": "330727",
    "NAME": "磐安县"
  },
  {
    "ID": "1079",
    "PARENT_ID": "1072",
    "CODE": "330781",
    "NAME": "兰溪市"
  },
  {
    "ID": "108",
    "PARENT_ID": "89",
    "CODE": "130435",
    "NAME": "曲周县"
  },
  {
    "ID": "1080",
    "PARENT_ID": "1072",
    "CODE": "330782",
    "NAME": "义乌市"
  },
  {
    "ID": "1081",
    "PARENT_ID": "1072",
    "CODE": "330783",
    "NAME": "东阳市"
  },
  {
    "ID": "1082",
    "PARENT_ID": "1072",
    "CODE": "330784",
    "NAME": "永康市"
  },
  {
    "ID": "1083",
    "PARENT_ID": "1006",
    "CODE": "330800",
    "NAME": "衢州市"
  },
  {
    "ID": "1084",
    "PARENT_ID": "1083",
    "CODE": "330801",
    "NAME": "市辖区"
  },
  {
    "ID": "1085",
    "PARENT_ID": "1083",
    "CODE": "330802",
    "NAME": "柯城区"
  },
  {
    "ID": "1086",
    "PARENT_ID": "1083",
    "CODE": "330803",
    "NAME": "衢江区"
  },
  {
    "ID": "1087",
    "PARENT_ID": "1083",
    "CODE": "330822",
    "NAME": "常山县"
  },
  {
    "ID": "1088",
    "PARENT_ID": "1083",
    "CODE": "330824",
    "NAME": "开化县"
  },
  {
    "ID": "1089",
    "PARENT_ID": "1083",
    "CODE": "330825",
    "NAME": "龙游县"
  },
  {
    "ID": "109",
    "PARENT_ID": "89",
    "CODE": "130481",
    "NAME": "武安市"
  },
  {
    "ID": "1090",
    "PARENT_ID": "1083",
    "CODE": "330881",
    "NAME": "江山市"
  },
  {
    "ID": "1091",
    "PARENT_ID": "1006",
    "CODE": "330900",
    "NAME": "舟山市"
  },
  {
    "ID": "1092",
    "PARENT_ID": "1091",
    "CODE": "330901",
    "NAME": "市辖区"
  },
  {
    "ID": "1093",
    "PARENT_ID": "1091",
    "CODE": "330902",
    "NAME": "定海区"
  },
  {
    "ID": "1094",
    "PARENT_ID": "1091",
    "CODE": "330903",
    "NAME": "普陀区"
  },
  {
    "ID": "1095",
    "PARENT_ID": "1091",
    "CODE": "330921",
    "NAME": "岱山县"
  },
  {
    "ID": "1096",
    "PARENT_ID": "1091",
    "CODE": "330922",
    "NAME": "嵊泗县"
  },
  {
    "ID": "1097",
    "PARENT_ID": "1006",
    "CODE": "331000",
    "NAME": "台州市"
  },
  {
    "ID": "1098",
    "PARENT_ID": "1097",
    "CODE": "331001",
    "NAME": "市辖区"
  },
  {
    "ID": "1099",
    "PARENT_ID": "1097",
    "CODE": "331002",
    "NAME": "椒江区"
  },
  {
    "ID": "11",
    "PARENT_ID": "2",
    "CODE": "110112",
    "NAME": "通州区"
  },
  {
    "ID": "110",
    "PARENT_ID": "39",
    "CODE": "130500",
    "NAME": "邢台市"
  },
  {
    "ID": "1100",
    "PARENT_ID": "1097",
    "CODE": "331003",
    "NAME": "黄岩区"
  },
  {
    "ID": "1101",
    "PARENT_ID": "1097",
    "CODE": "331004",
    "NAME": "路桥区"
  },
  {
    "ID": "1102",
    "PARENT_ID": "1097",
    "CODE": "331021",
    "NAME": "玉环县"
  },
  {
    "ID": "1103",
    "PARENT_ID": "1097",
    "CODE": "331022",
    "NAME": "三门县"
  },
  {
    "ID": "1104",
    "PARENT_ID": "1097",
    "CODE": "331023",
    "NAME": "天台县"
  },
  {
    "ID": "1105",
    "PARENT_ID": "1097",
    "CODE": "331024",
    "NAME": "仙居县"
  },
  {
    "ID": "1106",
    "PARENT_ID": "1097",
    "CODE": "331081",
    "NAME": "温岭市"
  },
  {
    "ID": "1107",
    "PARENT_ID": "1097",
    "CODE": "331082",
    "NAME": "临海市"
  },
  {
    "ID": "1108",
    "PARENT_ID": "1006",
    "CODE": "331100",
    "NAME": "丽水市"
  },
  {
    "ID": "1109",
    "PARENT_ID": "1108",
    "CODE": "331101",
    "NAME": "市辖区"
  },
  {
    "ID": "111",
    "PARENT_ID": "110",
    "CODE": "130501",
    "NAME": "市辖区"
  },
  {
    "ID": "1110",
    "PARENT_ID": "1108",
    "CODE": "331102",
    "NAME": "莲都区"
  },
  {
    "ID": "1111",
    "PARENT_ID": "1108",
    "CODE": "331121",
    "NAME": "青田县"
  },
  {
    "ID": "1112",
    "PARENT_ID": "1108",
    "CODE": "331122",
    "NAME": "缙云县"
  },
  {
    "ID": "1113",
    "PARENT_ID": "1108",
    "CODE": "331123",
    "NAME": "遂昌县"
  },
  {
    "ID": "1114",
    "PARENT_ID": "1108",
    "CODE": "331124",
    "NAME": "松阳县"
  },
  {
    "ID": "1115",
    "PARENT_ID": "1108",
    "CODE": "331125",
    "NAME": "云和县"
  },
  {
    "ID": "1116",
    "PARENT_ID": "1108",
    "CODE": "331126",
    "NAME": "庆元县"
  },
  {
    "ID": "1117",
    "PARENT_ID": "1108",
    "CODE": "331127",
    "NAME": "景宁畲族自治县"
  },
  {
    "ID": "1118",
    "PARENT_ID": "1108",
    "CODE": "331181",
    "NAME": "龙泉市"
  },
  {
    "ID": "1119",
    "PARENT_ID": "0",
    "CODE": "340000",
    "NAME": "安徽省"
  },
  {
    "ID": "112",
    "PARENT_ID": "110",
    "CODE": "130502",
    "NAME": "桥东区"
  },
  {
    "ID": "1120",
    "PARENT_ID": "1119",
    "CODE": "340100",
    "NAME": "合肥市"
  },
  {
    "ID": "1121",
    "PARENT_ID": "1120",
    "CODE": "340101",
    "NAME": "市辖区"
  },
  {
    "ID": "1122",
    "PARENT_ID": "1120",
    "CODE": "340102",
    "NAME": "瑶海区"
  },
  {
    "ID": "1123",
    "PARENT_ID": "1120",
    "CODE": "340103",
    "NAME": "庐阳区"
  },
  {
    "ID": "1124",
    "PARENT_ID": "1120",
    "CODE": "340104",
    "NAME": "蜀山区"
  },
  {
    "ID": "1125",
    "PARENT_ID": "1120",
    "CODE": "340111",
    "NAME": "包河区"
  },
  {
    "ID": "1126",
    "PARENT_ID": "1120",
    "CODE": "340121",
    "NAME": "长丰县"
  },
  {
    "ID": "1127",
    "PARENT_ID": "1120",
    "CODE": "340122",
    "NAME": "肥东县"
  },
  {
    "ID": "1128",
    "PARENT_ID": "1120",
    "CODE": "340123",
    "NAME": "肥西县"
  },
  {
    "ID": "1129",
    "PARENT_ID": "1120",
    "CODE": "340124",
    "NAME": "庐江县"
  },
  {
    "ID": "113",
    "PARENT_ID": "110",
    "CODE": "130503",
    "NAME": "桥西区"
  },
  {
    "ID": "1130",
    "PARENT_ID": "1120",
    "CODE": "340181",
    "NAME": "巢湖市"
  },
  {
    "ID": "1131",
    "PARENT_ID": "1119",
    "CODE": "340200",
    "NAME": "芜湖市"
  },
  {
    "ID": "1132",
    "PARENT_ID": "1131",
    "CODE": "340201",
    "NAME": "市辖区"
  },
  {
    "ID": "1133",
    "PARENT_ID": "1131",
    "CODE": "340202",
    "NAME": "镜湖区"
  },
  {
    "ID": "1134",
    "PARENT_ID": "1131",
    "CODE": "340203",
    "NAME": "弋江区"
  },
  {
    "ID": "1135",
    "PARENT_ID": "1131",
    "CODE": "340207",
    "NAME": "鸠江区"
  },
  {
    "ID": "1136",
    "PARENT_ID": "1131",
    "CODE": "340208",
    "NAME": "三山区"
  },
  {
    "ID": "1137",
    "PARENT_ID": "1131",
    "CODE": "340221",
    "NAME": "芜湖县"
  },
  {
    "ID": "1138",
    "PARENT_ID": "1131",
    "CODE": "340222",
    "NAME": "繁昌县"
  },
  {
    "ID": "1139",
    "PARENT_ID": "1131",
    "CODE": "340223",
    "NAME": "南陵县"
  },
  {
    "ID": "114",
    "PARENT_ID": "110",
    "CODE": "130521",
    "NAME": "邢台县"
  },
  {
    "ID": "1140",
    "PARENT_ID": "1131",
    "CODE": "340225",
    "NAME": "无为县"
  },
  {
    "ID": "1141",
    "PARENT_ID": "1119",
    "CODE": "340300",
    "NAME": "蚌埠市"
  },
  {
    "ID": "1142",
    "PARENT_ID": "1141",
    "CODE": "340301",
    "NAME": "市辖区"
  },
  {
    "ID": "1143",
    "PARENT_ID": "1141",
    "CODE": "340302",
    "NAME": "龙子湖区"
  },
  {
    "ID": "1144",
    "PARENT_ID": "1141",
    "CODE": "340303",
    "NAME": "蚌山区"
  },
  {
    "ID": "1145",
    "PARENT_ID": "1141",
    "CODE": "340304",
    "NAME": "禹会区"
  },
  {
    "ID": "1146",
    "PARENT_ID": "1141",
    "CODE": "340311",
    "NAME": "淮上区"
  },
  {
    "ID": "1147",
    "PARENT_ID": "1141",
    "CODE": "340321",
    "NAME": "怀远县"
  },
  {
    "ID": "1148",
    "PARENT_ID": "1141",
    "CODE": "340322",
    "NAME": "五河县"
  },
  {
    "ID": "1149",
    "PARENT_ID": "1141",
    "CODE": "340323",
    "NAME": "固镇县"
  },
  {
    "ID": "115",
    "PARENT_ID": "110",
    "CODE": "130522",
    "NAME": "临城县"
  },
  {
    "ID": "1150",
    "PARENT_ID": "1119",
    "CODE": "340400",
    "NAME": "淮南市"
  },
  {
    "ID": "1151",
    "PARENT_ID": "1150",
    "CODE": "340401",
    "NAME": "市辖区"
  },
  {
    "ID": "1152",
    "PARENT_ID": "1150",
    "CODE": "340402",
    "NAME": "大通区"
  },
  {
    "ID": "1153",
    "PARENT_ID": "1150",
    "CODE": "340403",
    "NAME": "田家庵区"
  },
  {
    "ID": "1154",
    "PARENT_ID": "1150",
    "CODE": "340404",
    "NAME": "谢家集区"
  },
  {
    "ID": "1155",
    "PARENT_ID": "1150",
    "CODE": "340405",
    "NAME": "八公山区"
  },
  {
    "ID": "1156",
    "PARENT_ID": "1150",
    "CODE": "340406",
    "NAME": "潘集区"
  },
  {
    "ID": "1157",
    "PARENT_ID": "1150",
    "CODE": "340421",
    "NAME": "凤台县"
  },
  {
    "ID": "1158",
    "PARENT_ID": "1119",
    "CODE": "340500",
    "NAME": "马鞍山市"
  },
  {
    "ID": "1159",
    "PARENT_ID": "1158",
    "CODE": "340501",
    "NAME": "市辖区"
  },
  {
    "ID": "116",
    "PARENT_ID": "110",
    "CODE": "130523",
    "NAME": "内丘县"
  },
  {
    "ID": "1160",
    "PARENT_ID": "1158",
    "CODE": "340503",
    "NAME": "花山区"
  },
  {
    "ID": "1161",
    "PARENT_ID": "1158",
    "CODE": "340504",
    "NAME": "雨山区"
  },
  {
    "ID": "1162",
    "PARENT_ID": "1158",
    "CODE": "340506",
    "NAME": "博望区"
  },
  {
    "ID": "1163",
    "PARENT_ID": "1158",
    "CODE": "340521",
    "NAME": "当涂县"
  },
  {
    "ID": "1164",
    "PARENT_ID": "1158",
    "CODE": "340522",
    "NAME": "含山县"
  },
  {
    "ID": "1165",
    "PARENT_ID": "1158",
    "CODE": "340523",
    "NAME": "和县"
  },
  {
    "ID": "1166",
    "PARENT_ID": "1119",
    "CODE": "340600",
    "NAME": "淮北市"
  },
  {
    "ID": "1167",
    "PARENT_ID": "1166",
    "CODE": "340601",
    "NAME": "市辖区"
  },
  {
    "ID": "1168",
    "PARENT_ID": "1166",
    "CODE": "340602",
    "NAME": "杜集区"
  },
  {
    "ID": "1169",
    "PARENT_ID": "1166",
    "CODE": "340603",
    "NAME": "相山区"
  },
  {
    "ID": "117",
    "PARENT_ID": "110",
    "CODE": "130524",
    "NAME": "柏乡县"
  },
  {
    "ID": "1170",
    "PARENT_ID": "1166",
    "CODE": "340604",
    "NAME": "烈山区"
  },
  {
    "ID": "1171",
    "PARENT_ID": "1166",
    "CODE": "340621",
    "NAME": "濉溪县"
  },
  {
    "ID": "1172",
    "PARENT_ID": "1119",
    "CODE": "340700",
    "NAME": "铜陵市"
  },
  {
    "ID": "1173",
    "PARENT_ID": "1172",
    "CODE": "340701",
    "NAME": "市辖区"
  },
  {
    "ID": "1174",
    "PARENT_ID": "1172",
    "CODE": "340702",
    "NAME": "铜官山区"
  },
  {
    "ID": "1175",
    "PARENT_ID": "1172",
    "CODE": "340703",
    "NAME": "狮子山区"
  },
  {
    "ID": "1176",
    "PARENT_ID": "1172",
    "CODE": "340711",
    "NAME": "郊区"
  },
  {
    "ID": "1177",
    "PARENT_ID": "1172",
    "CODE": "340721",
    "NAME": "铜陵县"
  },
  {
    "ID": "1178",
    "PARENT_ID": "1119",
    "CODE": "340800",
    "NAME": "安庆市"
  },
  {
    "ID": "1179",
    "PARENT_ID": "1178",
    "CODE": "340801",
    "NAME": "市辖区"
  },
  {
    "ID": "118",
    "PARENT_ID": "110",
    "CODE": "130525",
    "NAME": "隆尧县"
  },
  {
    "ID": "1180",
    "PARENT_ID": "1178",
    "CODE": "340802",
    "NAME": "迎江区"
  },
  {
    "ID": "1181",
    "PARENT_ID": "1178",
    "CODE": "340803",
    "NAME": "大观区"
  },
  {
    "ID": "1182",
    "PARENT_ID": "1178",
    "CODE": "340811",
    "NAME": "宜秀区"
  },
  {
    "ID": "1183",
    "PARENT_ID": "1178",
    "CODE": "340822",
    "NAME": "怀宁县"
  },
  {
    "ID": "1184",
    "PARENT_ID": "1178",
    "CODE": "340823",
    "NAME": "枞阳县"
  },
  {
    "ID": "1185",
    "PARENT_ID": "1178",
    "CODE": "340824",
    "NAME": "潜山县"
  },
  {
    "ID": "1186",
    "PARENT_ID": "1178",
    "CODE": "340825",
    "NAME": "太湖县"
  },
  {
    "ID": "1187",
    "PARENT_ID": "1178",
    "CODE": "340826",
    "NAME": "宿松县"
  },
  {
    "ID": "1188",
    "PARENT_ID": "1178",
    "CODE": "340827",
    "NAME": "望江县"
  },
  {
    "ID": "1189",
    "PARENT_ID": "1178",
    "CODE": "340828",
    "NAME": "岳西县"
  },
  {
    "ID": "119",
    "PARENT_ID": "110",
    "CODE": "130526",
    "NAME": "任县"
  },
  {
    "ID": "1190",
    "PARENT_ID": "1178",
    "CODE": "340881",
    "NAME": "桐城市"
  },
  {
    "ID": "1191",
    "PARENT_ID": "1119",
    "CODE": "341000",
    "NAME": "黄山市"
  },
  {
    "ID": "1192",
    "PARENT_ID": "1191",
    "CODE": "341001",
    "NAME": "市辖区"
  },
  {
    "ID": "1193",
    "PARENT_ID": "1191",
    "CODE": "341002",
    "NAME": "屯溪区"
  },
  {
    "ID": "1194",
    "PARENT_ID": "1191",
    "CODE": "341003",
    "NAME": "黄山区"
  },
  {
    "ID": "1195",
    "PARENT_ID": "1191",
    "CODE": "341004",
    "NAME": "徽州区"
  },
  {
    "ID": "1196",
    "PARENT_ID": "1191",
    "CODE": "341021",
    "NAME": "歙县"
  },
  {
    "ID": "1197",
    "PARENT_ID": "1191",
    "CODE": "341022",
    "NAME": "休宁县"
  },
  {
    "ID": "1198",
    "PARENT_ID": "1191",
    "CODE": "341023",
    "NAME": "黟县"
  },
  {
    "ID": "1199",
    "PARENT_ID": "1191",
    "CODE": "341024",
    "NAME": "祁门县"
  },
  {
    "ID": "12",
    "PARENT_ID": "2",
    "CODE": "110113",
    "NAME": "顺义区"
  },
  {
    "ID": "120",
    "PARENT_ID": "110",
    "CODE": "130527",
    "NAME": "南和县"
  },
  {
    "ID": "1200",
    "PARENT_ID": "1119",
    "CODE": "341100",
    "NAME": "滁州市"
  },
  {
    "ID": "1201",
    "PARENT_ID": "1200",
    "CODE": "341101",
    "NAME": "市辖区"
  },
  {
    "ID": "1202",
    "PARENT_ID": "1200",
    "CODE": "341102",
    "NAME": "琅琊区"
  },
  {
    "ID": "1203",
    "PARENT_ID": "1200",
    "CODE": "341103",
    "NAME": "南谯区"
  },
  {
    "ID": "1204",
    "PARENT_ID": "1200",
    "CODE": "341122",
    "NAME": "来安县"
  },
  {
    "ID": "1205",
    "PARENT_ID": "1200",
    "CODE": "341124",
    "NAME": "全椒县"
  },
  {
    "ID": "1206",
    "PARENT_ID": "1200",
    "CODE": "341125",
    "NAME": "定远县"
  },
  {
    "ID": "1207",
    "PARENT_ID": "1200",
    "CODE": "341126",
    "NAME": "凤阳县"
  },
  {
    "ID": "1208",
    "PARENT_ID": "1200",
    "CODE": "341181",
    "NAME": "天长市"
  },
  {
    "ID": "1209",
    "PARENT_ID": "1200",
    "CODE": "341182",
    "NAME": "明光市"
  },
  {
    "ID": "121",
    "PARENT_ID": "110",
    "CODE": "130528",
    "NAME": "宁晋县"
  },
  {
    "ID": "1210",
    "PARENT_ID": "1119",
    "CODE": "341200",
    "NAME": "阜阳市"
  },
  {
    "ID": "1211",
    "PARENT_ID": "1210",
    "CODE": "341201",
    "NAME": "市辖区"
  },
  {
    "ID": "1212",
    "PARENT_ID": "1210",
    "CODE": "341202",
    "NAME": "颍州区"
  },
  {
    "ID": "1213",
    "PARENT_ID": "1210",
    "CODE": "341203",
    "NAME": "颍东区"
  },
  {
    "ID": "1214",
    "PARENT_ID": "1210",
    "CODE": "341204",
    "NAME": "颍泉区"
  },
  {
    "ID": "1215",
    "PARENT_ID": "1210",
    "CODE": "341221",
    "NAME": "临泉县"
  },
  {
    "ID": "1216",
    "PARENT_ID": "1210",
    "CODE": "341222",
    "NAME": "太和县"
  },
  {
    "ID": "1217",
    "PARENT_ID": "1210",
    "CODE": "341225",
    "NAME": "阜南县"
  },
  {
    "ID": "1218",
    "PARENT_ID": "1210",
    "CODE": "341226",
    "NAME": "颍上县"
  },
  {
    "ID": "1219",
    "PARENT_ID": "1210",
    "CODE": "341282",
    "NAME": "界首市"
  },
  {
    "ID": "122",
    "PARENT_ID": "110",
    "CODE": "130529",
    "NAME": "巨鹿县"
  },
  {
    "ID": "1220",
    "PARENT_ID": "1119",
    "CODE": "341300",
    "NAME": "宿州市"
  },
  {
    "ID": "1221",
    "PARENT_ID": "1220",
    "CODE": "341301",
    "NAME": "市辖区"
  },
  {
    "ID": "1222",
    "PARENT_ID": "1220",
    "CODE": "341302",
    "NAME": "埇桥区"
  },
  {
    "ID": "1223",
    "PARENT_ID": "1220",
    "CODE": "341321",
    "NAME": "砀山县"
  },
  {
    "ID": "1224",
    "PARENT_ID": "1220",
    "CODE": "341322",
    "NAME": "萧县"
  },
  {
    "ID": "1225",
    "PARENT_ID": "1220",
    "CODE": "341323",
    "NAME": "灵璧县"
  },
  {
    "ID": "1226",
    "PARENT_ID": "1220",
    "CODE": "341324",
    "NAME": "泗县"
  },
  {
    "ID": "1227",
    "PARENT_ID": "1119",
    "CODE": "341500",
    "NAME": "六安市"
  },
  {
    "ID": "1228",
    "PARENT_ID": "1227",
    "CODE": "341501",
    "NAME": "市辖区"
  },
  {
    "ID": "1229",
    "PARENT_ID": "1227",
    "CODE": "341502",
    "NAME": "金安区"
  },
  {
    "ID": "123",
    "PARENT_ID": "110",
    "CODE": "130530",
    "NAME": "新河县"
  },
  {
    "ID": "1230",
    "PARENT_ID": "1227",
    "CODE": "341503",
    "NAME": "裕安区"
  },
  {
    "ID": "1231",
    "PARENT_ID": "1227",
    "CODE": "341521",
    "NAME": "寿县"
  },
  {
    "ID": "1232",
    "PARENT_ID": "1227",
    "CODE": "341522",
    "NAME": "霍邱县"
  },
  {
    "ID": "1233",
    "PARENT_ID": "1227",
    "CODE": "341523",
    "NAME": "舒城县"
  },
  {
    "ID": "1234",
    "PARENT_ID": "1227",
    "CODE": "341524",
    "NAME": "金寨县"
  },
  {
    "ID": "1235",
    "PARENT_ID": "1227",
    "CODE": "341525",
    "NAME": "霍山县"
  },
  {
    "ID": "1236",
    "PARENT_ID": "1119",
    "CODE": "341600",
    "NAME": "亳州市"
  },
  {
    "ID": "1237",
    "PARENT_ID": "1236",
    "CODE": "341601",
    "NAME": "市辖区"
  },
  {
    "ID": "1238",
    "PARENT_ID": "1236",
    "CODE": "341602",
    "NAME": "谯城区"
  },
  {
    "ID": "1239",
    "PARENT_ID": "1236",
    "CODE": "341621",
    "NAME": "涡阳县"
  },
  {
    "ID": "124",
    "PARENT_ID": "110",
    "CODE": "130531",
    "NAME": "广宗县"
  },
  {
    "ID": "1240",
    "PARENT_ID": "1236",
    "CODE": "341622",
    "NAME": "蒙城县"
  },
  {
    "ID": "1241",
    "PARENT_ID": "1236",
    "CODE": "341623",
    "NAME": "利辛县"
  },
  {
    "ID": "1242",
    "PARENT_ID": "1119",
    "CODE": "341700",
    "NAME": "池州市"
  },
  {
    "ID": "1243",
    "PARENT_ID": "1242",
    "CODE": "341701",
    "NAME": "市辖区"
  },
  {
    "ID": "1244",
    "PARENT_ID": "1242",
    "CODE": "341702",
    "NAME": "贵池区"
  },
  {
    "ID": "1245",
    "PARENT_ID": "1242",
    "CODE": "341721",
    "NAME": "东至县"
  },
  {
    "ID": "1246",
    "PARENT_ID": "1242",
    "CODE": "341722",
    "NAME": "石台县"
  },
  {
    "ID": "1247",
    "PARENT_ID": "1242",
    "CODE": "341723",
    "NAME": "青阳县"
  },
  {
    "ID": "1248",
    "PARENT_ID": "1119",
    "CODE": "341800",
    "NAME": "宣城市"
  },
  {
    "ID": "1249",
    "PARENT_ID": "1248",
    "CODE": "341801",
    "NAME": "市辖区"
  },
  {
    "ID": "125",
    "PARENT_ID": "110",
    "CODE": "130532",
    "NAME": "平乡县"
  },
  {
    "ID": "1250",
    "PARENT_ID": "1248",
    "CODE": "341802",
    "NAME": "宣州区"
  },
  {
    "ID": "1251",
    "PARENT_ID": "1248",
    "CODE": "341821",
    "NAME": "郎溪县"
  },
  {
    "ID": "1252",
    "PARENT_ID": "1248",
    "CODE": "341822",
    "NAME": "广德县"
  },
  {
    "ID": "1253",
    "PARENT_ID": "1248",
    "CODE": "341823",
    "NAME": "泾县"
  },
  {
    "ID": "1254",
    "PARENT_ID": "1248",
    "CODE": "341824",
    "NAME": "绩溪县"
  },
  {
    "ID": "1255",
    "PARENT_ID": "1248",
    "CODE": "341825",
    "NAME": "旌德县"
  },
  {
    "ID": "1256",
    "PARENT_ID": "1248",
    "CODE": "341881",
    "NAME": "宁国市"
  },
  {
    "ID": "1257",
    "PARENT_ID": "0",
    "CODE": "350000",
    "NAME": "福建省"
  },
  {
    "ID": "1258",
    "PARENT_ID": "1257",
    "CODE": "350100",
    "NAME": "福州市"
  },
  {
    "ID": "1259",
    "PARENT_ID": "1258",
    "CODE": "350101",
    "NAME": "市辖区"
  },
  {
    "ID": "126",
    "PARENT_ID": "110",
    "CODE": "130533",
    "NAME": "威县"
  },
  {
    "ID": "1260",
    "PARENT_ID": "1258",
    "CODE": "350102",
    "NAME": "鼓楼区"
  },
  {
    "ID": "1261",
    "PARENT_ID": "1258",
    "CODE": "350103",
    "NAME": "台江区"
  },
  {
    "ID": "1262",
    "PARENT_ID": "1258",
    "CODE": "350104",
    "NAME": "仓山区"
  },
  {
    "ID": "1263",
    "PARENT_ID": "1258",
    "CODE": "350105",
    "NAME": "马尾区"
  },
  {
    "ID": "1264",
    "PARENT_ID": "1258",
    "CODE": "350111",
    "NAME": "晋安区"
  },
  {
    "ID": "1265",
    "PARENT_ID": "1258",
    "CODE": "350121",
    "NAME": "闽侯县"
  },
  {
    "ID": "1266",
    "PARENT_ID": "1258",
    "CODE": "350122",
    "NAME": "连江县"
  },
  {
    "ID": "1267",
    "PARENT_ID": "1258",
    "CODE": "350123",
    "NAME": "罗源县"
  },
  {
    "ID": "1268",
    "PARENT_ID": "1258",
    "CODE": "350124",
    "NAME": "闽清县"
  },
  {
    "ID": "1269",
    "PARENT_ID": "1258",
    "CODE": "350125",
    "NAME": "永泰县"
  },
  {
    "ID": "127",
    "PARENT_ID": "110",
    "CODE": "130534",
    "NAME": "清河县"
  },
  {
    "ID": "1270",
    "PARENT_ID": "1258",
    "CODE": "350128",
    "NAME": "平潭县"
  },
  {
    "ID": "1271",
    "PARENT_ID": "1258",
    "CODE": "350181",
    "NAME": "福清市"
  },
  {
    "ID": "1272",
    "PARENT_ID": "1258",
    "CODE": "350182",
    "NAME": "长乐市"
  },
  {
    "ID": "1273",
    "PARENT_ID": "1257",
    "CODE": "350200",
    "NAME": "厦门市"
  },
  {
    "ID": "1274",
    "PARENT_ID": "1273",
    "CODE": "350201",
    "NAME": "市辖区"
  },
  {
    "ID": "1275",
    "PARENT_ID": "1273",
    "CODE": "350203",
    "NAME": "思明区"
  },
  {
    "ID": "1276",
    "PARENT_ID": "1273",
    "CODE": "350205",
    "NAME": "海沧区"
  },
  {
    "ID": "1277",
    "PARENT_ID": "1273",
    "CODE": "350206",
    "NAME": "湖里区"
  },
  {
    "ID": "1278",
    "PARENT_ID": "1273",
    "CODE": "350211",
    "NAME": "集美区"
  },
  {
    "ID": "1279",
    "PARENT_ID": "1273",
    "CODE": "350212",
    "NAME": "同安区"
  },
  {
    "ID": "128",
    "PARENT_ID": "110",
    "CODE": "130535",
    "NAME": "临西县"
  },
  {
    "ID": "1280",
    "PARENT_ID": "1273",
    "CODE": "350213",
    "NAME": "翔安区"
  },
  {
    "ID": "1281",
    "PARENT_ID": "1257",
    "CODE": "350300",
    "NAME": "莆田市"
  },
  {
    "ID": "1282",
    "PARENT_ID": "1281",
    "CODE": "350301",
    "NAME": "市辖区"
  },
  {
    "ID": "1283",
    "PARENT_ID": "1281",
    "CODE": "350302",
    "NAME": "城厢区"
  },
  {
    "ID": "1284",
    "PARENT_ID": "1281",
    "CODE": "350303",
    "NAME": "涵江区"
  },
  {
    "ID": "1285",
    "PARENT_ID": "1281",
    "CODE": "350304",
    "NAME": "荔城区"
  },
  {
    "ID": "1286",
    "PARENT_ID": "1281",
    "CODE": "350305",
    "NAME": "秀屿区"
  },
  {
    "ID": "1287",
    "PARENT_ID": "1281",
    "CODE": "350322",
    "NAME": "仙游县"
  },
  {
    "ID": "1288",
    "PARENT_ID": "1257",
    "CODE": "350400",
    "NAME": "三明市"
  },
  {
    "ID": "1289",
    "PARENT_ID": "1288",
    "CODE": "350401",
    "NAME": "市辖区"
  },
  {
    "ID": "129",
    "PARENT_ID": "110",
    "CODE": "130581",
    "NAME": "南宫市"
  },
  {
    "ID": "1290",
    "PARENT_ID": "1288",
    "CODE": "350402",
    "NAME": "梅列区"
  },
  {
    "ID": "1291",
    "PARENT_ID": "1288",
    "CODE": "350403",
    "NAME": "三元区"
  },
  {
    "ID": "1292",
    "PARENT_ID": "1288",
    "CODE": "350421",
    "NAME": "明溪县"
  },
  {
    "ID": "1293",
    "PARENT_ID": "1288",
    "CODE": "350423",
    "NAME": "清流县"
  },
  {
    "ID": "1294",
    "PARENT_ID": "1288",
    "CODE": "350424",
    "NAME": "宁化县"
  },
  {
    "ID": "1295",
    "PARENT_ID": "1288",
    "CODE": "350425",
    "NAME": "大田县"
  },
  {
    "ID": "1296",
    "PARENT_ID": "1288",
    "CODE": "350426",
    "NAME": "尤溪县"
  },
  {
    "ID": "1297",
    "PARENT_ID": "1288",
    "CODE": "350427",
    "NAME": "沙县"
  },
  {
    "ID": "1298",
    "PARENT_ID": "1288",
    "CODE": "350428",
    "NAME": "将乐县"
  },
  {
    "ID": "1299",
    "PARENT_ID": "1288",
    "CODE": "350429",
    "NAME": "泰宁县"
  },
  {
    "ID": "13",
    "PARENT_ID": "2",
    "CODE": "110114",
    "NAME": "昌平区"
  },
  {
    "ID": "130",
    "PARENT_ID": "110",
    "CODE": "130582",
    "NAME": "沙河市"
  },
  {
    "ID": "1300",
    "PARENT_ID": "1288",
    "CODE": "350430",
    "NAME": "建宁县"
  },
  {
    "ID": "1301",
    "PARENT_ID": "1288",
    "CODE": "350481",
    "NAME": "永安市"
  },
  {
    "ID": "1302",
    "PARENT_ID": "1257",
    "CODE": "350500",
    "NAME": "泉州市"
  },
  {
    "ID": "1303",
    "PARENT_ID": "1302",
    "CODE": "350501",
    "NAME": "市辖区"
  },
  {
    "ID": "1304",
    "PARENT_ID": "1302",
    "CODE": "350502",
    "NAME": "鲤城区"
  },
  {
    "ID": "1305",
    "PARENT_ID": "1302",
    "CODE": "350503",
    "NAME": "丰泽区"
  },
  {
    "ID": "1306",
    "PARENT_ID": "1302",
    "CODE": "350504",
    "NAME": "洛江区"
  },
  {
    "ID": "1307",
    "PARENT_ID": "1302",
    "CODE": "350505",
    "NAME": "泉港区"
  },
  {
    "ID": "1308",
    "PARENT_ID": "1302",
    "CODE": "350521",
    "NAME": "惠安县"
  },
  {
    "ID": "1309",
    "PARENT_ID": "1302",
    "CODE": "350524",
    "NAME": "安溪县"
  },
  {
    "ID": "131",
    "PARENT_ID": "39",
    "CODE": "130600",
    "NAME": "保定市"
  },
  {
    "ID": "1310",
    "PARENT_ID": "1302",
    "CODE": "350525",
    "NAME": "永春县"
  },
  {
    "ID": "1311",
    "PARENT_ID": "1302",
    "CODE": "350526",
    "NAME": "德化县"
  },
  {
    "ID": "1312",
    "PARENT_ID": "1302",
    "CODE": "350527",
    "NAME": "金门县"
  },
  {
    "ID": "1313",
    "PARENT_ID": "1302",
    "CODE": "350581",
    "NAME": "石狮市"
  },
  {
    "ID": "1314",
    "PARENT_ID": "1302",
    "CODE": "350582",
    "NAME": "晋江市"
  },
  {
    "ID": "1315",
    "PARENT_ID": "1302",
    "CODE": "350583",
    "NAME": "南安市"
  },
  {
    "ID": "1316",
    "PARENT_ID": "1257",
    "CODE": "350600",
    "NAME": "漳州市"
  },
  {
    "ID": "1317",
    "PARENT_ID": "1316",
    "CODE": "350601",
    "NAME": "市辖区"
  },
  {
    "ID": "1318",
    "PARENT_ID": "1316",
    "CODE": "350602",
    "NAME": "芗城区"
  },
  {
    "ID": "1319",
    "PARENT_ID": "1316",
    "CODE": "350603",
    "NAME": "龙文区"
  },
  {
    "ID": "132",
    "PARENT_ID": "131",
    "CODE": "130601",
    "NAME": "市辖区"
  },
  {
    "ID": "1320",
    "PARENT_ID": "1316",
    "CODE": "350622",
    "NAME": "云霄县"
  },
  {
    "ID": "1321",
    "PARENT_ID": "1316",
    "CODE": "350623",
    "NAME": "漳浦县"
  },
  {
    "ID": "1322",
    "PARENT_ID": "1316",
    "CODE": "350624",
    "NAME": "诏安县"
  },
  {
    "ID": "1323",
    "PARENT_ID": "1316",
    "CODE": "350625",
    "NAME": "长泰县"
  },
  {
    "ID": "1324",
    "PARENT_ID": "1316",
    "CODE": "350626",
    "NAME": "东山县"
  },
  {
    "ID": "1325",
    "PARENT_ID": "1316",
    "CODE": "350627",
    "NAME": "南靖县"
  },
  {
    "ID": "1326",
    "PARENT_ID": "1316",
    "CODE": "350628",
    "NAME": "平和县"
  },
  {
    "ID": "1327",
    "PARENT_ID": "1316",
    "CODE": "350629",
    "NAME": "华安县"
  },
  {
    "ID": "1328",
    "PARENT_ID": "1316",
    "CODE": "350681",
    "NAME": "龙海市"
  },
  {
    "ID": "1329",
    "PARENT_ID": "1257",
    "CODE": "350700",
    "NAME": "南平市"
  },
  {
    "ID": "133",
    "PARENT_ID": "131",
    "CODE": "130602",
    "NAME": "新市区"
  },
  {
    "ID": "1330",
    "PARENT_ID": "1329",
    "CODE": "350701",
    "NAME": "市辖区"
  },
  {
    "ID": "1331",
    "PARENT_ID": "1329",
    "CODE": "350702",
    "NAME": "延平区"
  },
  {
    "ID": "1332",
    "PARENT_ID": "1329",
    "CODE": "350721",
    "NAME": "顺昌县"
  },
  {
    "ID": "1333",
    "PARENT_ID": "1329",
    "CODE": "350722",
    "NAME": "浦城县"
  },
  {
    "ID": "1334",
    "PARENT_ID": "1329",
    "CODE": "350723",
    "NAME": "光泽县"
  },
  {
    "ID": "1335",
    "PARENT_ID": "1329",
    "CODE": "350724",
    "NAME": "松溪县"
  },
  {
    "ID": "1336",
    "PARENT_ID": "1329",
    "CODE": "350725",
    "NAME": "政和县"
  },
  {
    "ID": "1337",
    "PARENT_ID": "1329",
    "CODE": "350781",
    "NAME": "邵武市"
  },
  {
    "ID": "1338",
    "PARENT_ID": "1329",
    "CODE": "350782",
    "NAME": "武夷山市"
  },
  {
    "ID": "1339",
    "PARENT_ID": "1329",
    "CODE": "350783",
    "NAME": "建瓯市"
  },
  {
    "ID": "134",
    "PARENT_ID": "131",
    "CODE": "130603",
    "NAME": "北市区"
  },
  {
    "ID": "1340",
    "PARENT_ID": "1329",
    "CODE": "350784",
    "NAME": "建阳市"
  },
  {
    "ID": "1341",
    "PARENT_ID": "1257",
    "CODE": "350800",
    "NAME": "龙岩市"
  },
  {
    "ID": "1342",
    "PARENT_ID": "1341",
    "CODE": "350801",
    "NAME": "市辖区"
  },
  {
    "ID": "1343",
    "PARENT_ID": "1341",
    "CODE": "350802",
    "NAME": "新罗区"
  },
  {
    "ID": "1344",
    "PARENT_ID": "1341",
    "CODE": "350821",
    "NAME": "长汀县"
  },
  {
    "ID": "1345",
    "PARENT_ID": "1341",
    "CODE": "350822",
    "NAME": "永定县"
  },
  {
    "ID": "1346",
    "PARENT_ID": "1341",
    "CODE": "350823",
    "NAME": "上杭县"
  },
  {
    "ID": "1347",
    "PARENT_ID": "1341",
    "CODE": "350824",
    "NAME": "武平县"
  },
  {
    "ID": "1348",
    "PARENT_ID": "1341",
    "CODE": "350825",
    "NAME": "连城县"
  },
  {
    "ID": "1349",
    "PARENT_ID": "1341",
    "CODE": "350881",
    "NAME": "漳平市"
  },
  {
    "ID": "135",
    "PARENT_ID": "131",
    "CODE": "130604",
    "NAME": "南市区"
  },
  {
    "ID": "1350",
    "PARENT_ID": "1257",
    "CODE": "350900",
    "NAME": "宁德市"
  },
  {
    "ID": "1351",
    "PARENT_ID": "1350",
    "CODE": "350901",
    "NAME": "市辖区"
  },
  {
    "ID": "1352",
    "PARENT_ID": "1350",
    "CODE": "350902",
    "NAME": "蕉城区"
  },
  {
    "ID": "1353",
    "PARENT_ID": "1350",
    "CODE": "350921",
    "NAME": "霞浦县"
  },
  {
    "ID": "1354",
    "PARENT_ID": "1350",
    "CODE": "350922",
    "NAME": "古田县"
  },
  {
    "ID": "1355",
    "PARENT_ID": "1350",
    "CODE": "350923",
    "NAME": "屏南县"
  },
  {
    "ID": "1356",
    "PARENT_ID": "1350",
    "CODE": "350924",
    "NAME": "寿宁县"
  },
  {
    "ID": "1357",
    "PARENT_ID": "1350",
    "CODE": "350925",
    "NAME": "周宁县"
  },
  {
    "ID": "1358",
    "PARENT_ID": "1350",
    "CODE": "350926",
    "NAME": "柘荣县"
  },
  {
    "ID": "1359",
    "PARENT_ID": "1350",
    "CODE": "350981",
    "NAME": "福安市"
  },
  {
    "ID": "136",
    "PARENT_ID": "131",
    "CODE": "130621",
    "NAME": "满城县"
  },
  {
    "ID": "1360",
    "PARENT_ID": "1350",
    "CODE": "350982",
    "NAME": "福鼎市"
  },
  {
    "ID": "1361",
    "PARENT_ID": "0",
    "CODE": "360000",
    "NAME": "江西省"
  },
  {
    "ID": "1362",
    "PARENT_ID": "1361",
    "CODE": "360100",
    "NAME": "南昌市"
  },
  {
    "ID": "1363",
    "PARENT_ID": "1362",
    "CODE": "360101",
    "NAME": "市辖区"
  },
  {
    "ID": "1364",
    "PARENT_ID": "1362",
    "CODE": "360102",
    "NAME": "东湖区"
  },
  {
    "ID": "1365",
    "PARENT_ID": "1362",
    "CODE": "360103",
    "NAME": "西湖区"
  },
  {
    "ID": "1366",
    "PARENT_ID": "1362",
    "CODE": "360104",
    "NAME": "青云谱区"
  },
  {
    "ID": "1367",
    "PARENT_ID": "1362",
    "CODE": "360105",
    "NAME": "湾里区"
  },
  {
    "ID": "1368",
    "PARENT_ID": "1362",
    "CODE": "360111",
    "NAME": "青山湖区"
  },
  {
    "ID": "1369",
    "PARENT_ID": "1362",
    "CODE": "360121",
    "NAME": "南昌县"
  },
  {
    "ID": "137",
    "PARENT_ID": "131",
    "CODE": "130622",
    "NAME": "清苑县"
  },
  {
    "ID": "1370",
    "PARENT_ID": "1362",
    "CODE": "360122",
    "NAME": "新建县"
  },
  {
    "ID": "1371",
    "PARENT_ID": "1362",
    "CODE": "360123",
    "NAME": "安义县"
  },
  {
    "ID": "1372",
    "PARENT_ID": "1362",
    "CODE": "360124",
    "NAME": "进贤县"
  },
  {
    "ID": "1373",
    "PARENT_ID": "1361",
    "CODE": "360200",
    "NAME": "景德镇市"
  },
  {
    "ID": "1374",
    "PARENT_ID": "1373",
    "CODE": "360201",
    "NAME": "市辖区"
  },
  {
    "ID": "1375",
    "PARENT_ID": "1373",
    "CODE": "360202",
    "NAME": "昌江区"
  },
  {
    "ID": "1376",
    "PARENT_ID": "1373",
    "CODE": "360203",
    "NAME": "珠山区"
  },
  {
    "ID": "1377",
    "PARENT_ID": "1373",
    "CODE": "360222",
    "NAME": "浮梁县"
  },
  {
    "ID": "1378",
    "PARENT_ID": "1373",
    "CODE": "360281",
    "NAME": "乐平市"
  },
  {
    "ID": "1379",
    "PARENT_ID": "1361",
    "CODE": "360300",
    "NAME": "萍乡市"
  },
  {
    "ID": "138",
    "PARENT_ID": "131",
    "CODE": "130623",
    "NAME": "涞水县"
  },
  {
    "ID": "1380",
    "PARENT_ID": "1379",
    "CODE": "360301",
    "NAME": "市辖区"
  },
  {
    "ID": "1381",
    "PARENT_ID": "1379",
    "CODE": "360302",
    "NAME": "安源区"
  },
  {
    "ID": "1382",
    "PARENT_ID": "1379",
    "CODE": "360313",
    "NAME": "湘东区"
  },
  {
    "ID": "1383",
    "PARENT_ID": "1379",
    "CODE": "360321",
    "NAME": "莲花县"
  },
  {
    "ID": "1384",
    "PARENT_ID": "1379",
    "CODE": "360322",
    "NAME": "上栗县"
  },
  {
    "ID": "1385",
    "PARENT_ID": "1379",
    "CODE": "360323",
    "NAME": "芦溪县"
  },
  {
    "ID": "1386",
    "PARENT_ID": "1361",
    "CODE": "360400",
    "NAME": "九江市"
  },
  {
    "ID": "1387",
    "PARENT_ID": "1386",
    "CODE": "360401",
    "NAME": "市辖区"
  },
  {
    "ID": "1388",
    "PARENT_ID": "1386",
    "CODE": "360402",
    "NAME": "庐山区"
  },
  {
    "ID": "1389",
    "PARENT_ID": "1386",
    "CODE": "360403",
    "NAME": "浔阳区"
  },
  {
    "ID": "139",
    "PARENT_ID": "131",
    "CODE": "130624",
    "NAME": "阜平县"
  },
  {
    "ID": "1390",
    "PARENT_ID": "1386",
    "CODE": "360421",
    "NAME": "九江县"
  },
  {
    "ID": "1391",
    "PARENT_ID": "1386",
    "CODE": "360423",
    "NAME": "武宁县"
  },
  {
    "ID": "1392",
    "PARENT_ID": "1386",
    "CODE": "360424",
    "NAME": "修水县"
  },
  {
    "ID": "1393",
    "PARENT_ID": "1386",
    "CODE": "360425",
    "NAME": "永修县"
  },
  {
    "ID": "1394",
    "PARENT_ID": "1386",
    "CODE": "360426",
    "NAME": "德安县"
  },
  {
    "ID": "1395",
    "PARENT_ID": "1386",
    "CODE": "360427",
    "NAME": "星子县"
  },
  {
    "ID": "1396",
    "PARENT_ID": "1386",
    "CODE": "360428",
    "NAME": "都昌县"
  },
  {
    "ID": "1397",
    "PARENT_ID": "1386",
    "CODE": "360429",
    "NAME": "湖口县"
  },
  {
    "ID": "1398",
    "PARENT_ID": "1386",
    "CODE": "360430",
    "NAME": "彭泽县"
  },
  {
    "ID": "1399",
    "PARENT_ID": "1386",
    "CODE": "360481",
    "NAME": "瑞昌市"
  },
  {
    "ID": "14",
    "PARENT_ID": "2",
    "CODE": "110115",
    "NAME": "大兴区"
  },
  {
    "ID": "140",
    "PARENT_ID": "131",
    "CODE": "130625",
    "NAME": "徐水县"
  },
  {
    "ID": "1400",
    "PARENT_ID": "1386",
    "CODE": "360482",
    "NAME": "共青城市"
  },
  {
    "ID": "1401",
    "PARENT_ID": "1361",
    "CODE": "360500",
    "NAME": "新余市"
  },
  {
    "ID": "1402",
    "PARENT_ID": "1401",
    "CODE": "360501",
    "NAME": "市辖区"
  },
  {
    "ID": "1403",
    "PARENT_ID": "1401",
    "CODE": "360502",
    "NAME": "渝水区"
  },
  {
    "ID": "1404",
    "PARENT_ID": "1401",
    "CODE": "360521",
    "NAME": "分宜县"
  },
  {
    "ID": "1405",
    "PARENT_ID": "1361",
    "CODE": "360600",
    "NAME": "鹰潭市"
  },
  {
    "ID": "1406",
    "PARENT_ID": "1405",
    "CODE": "360601",
    "NAME": "市辖区"
  },
  {
    "ID": "1407",
    "PARENT_ID": "1405",
    "CODE": "360602",
    "NAME": "月湖区"
  },
  {
    "ID": "1408",
    "PARENT_ID": "1405",
    "CODE": "360622",
    "NAME": "余江县"
  },
  {
    "ID": "1409",
    "PARENT_ID": "1405",
    "CODE": "360681",
    "NAME": "贵溪市"
  },
  {
    "ID": "141",
    "PARENT_ID": "131",
    "CODE": "130626",
    "NAME": "定兴县"
  },
  {
    "ID": "1410",
    "PARENT_ID": "1361",
    "CODE": "360700",
    "NAME": "赣州市"
  },
  {
    "ID": "1411",
    "PARENT_ID": "1410",
    "CODE": "360701",
    "NAME": "市辖区"
  },
  {
    "ID": "1412",
    "PARENT_ID": "1410",
    "CODE": "360702",
    "NAME": "章贡区"
  },
  {
    "ID": "1413",
    "PARENT_ID": "1410",
    "CODE": "360703",
    "NAME": "南康区"
  },
  {
    "ID": "1414",
    "PARENT_ID": "1410",
    "CODE": "360721",
    "NAME": "赣县"
  },
  {
    "ID": "1415",
    "PARENT_ID": "1410",
    "CODE": "360722",
    "NAME": "信丰县"
  },
  {
    "ID": "1416",
    "PARENT_ID": "1410",
    "CODE": "360723",
    "NAME": "大余县"
  },
  {
    "ID": "1417",
    "PARENT_ID": "1410",
    "CODE": "360724",
    "NAME": "上犹县"
  },
  {
    "ID": "1418",
    "PARENT_ID": "1410",
    "CODE": "360725",
    "NAME": "崇义县"
  },
  {
    "ID": "1419",
    "PARENT_ID": "1410",
    "CODE": "360726",
    "NAME": "安远县"
  },
  {
    "ID": "142",
    "PARENT_ID": "131",
    "CODE": "130627",
    "NAME": "唐县"
  },
  {
    "ID": "1420",
    "PARENT_ID": "1410",
    "CODE": "360727",
    "NAME": "龙南县"
  },
  {
    "ID": "1421",
    "PARENT_ID": "1410",
    "CODE": "360728",
    "NAME": "定南县"
  },
  {
    "ID": "1422",
    "PARENT_ID": "1410",
    "CODE": "360729",
    "NAME": "全南县"
  },
  {
    "ID": "1423",
    "PARENT_ID": "1410",
    "CODE": "360730",
    "NAME": "宁都县"
  },
  {
    "ID": "1424",
    "PARENT_ID": "1410",
    "CODE": "360731",
    "NAME": "于都县"
  },
  {
    "ID": "1425",
    "PARENT_ID": "1410",
    "CODE": "360732",
    "NAME": "兴国县"
  },
  {
    "ID": "1426",
    "PARENT_ID": "1410",
    "CODE": "360733",
    "NAME": "会昌县"
  },
  {
    "ID": "1427",
    "PARENT_ID": "1410",
    "CODE": "360734",
    "NAME": "寻乌县"
  },
  {
    "ID": "1428",
    "PARENT_ID": "1410",
    "CODE": "360735",
    "NAME": "石城县"
  },
  {
    "ID": "1429",
    "PARENT_ID": "1410",
    "CODE": "360781",
    "NAME": "瑞金市"
  },
  {
    "ID": "143",
    "PARENT_ID": "131",
    "CODE": "130628",
    "NAME": "高阳县"
  },
  {
    "ID": "1430",
    "PARENT_ID": "1361",
    "CODE": "360800",
    "NAME": "吉安市"
  },
  {
    "ID": "1431",
    "PARENT_ID": "1430",
    "CODE": "360801",
    "NAME": "市辖区"
  },
  {
    "ID": "1432",
    "PARENT_ID": "1430",
    "CODE": "360802",
    "NAME": "吉州区"
  },
  {
    "ID": "1433",
    "PARENT_ID": "1430",
    "CODE": "360803",
    "NAME": "青原区"
  },
  {
    "ID": "1434",
    "PARENT_ID": "1430",
    "CODE": "360821",
    "NAME": "吉安县"
  },
  {
    "ID": "1435",
    "PARENT_ID": "1430",
    "CODE": "360822",
    "NAME": "吉水县"
  },
  {
    "ID": "1436",
    "PARENT_ID": "1430",
    "CODE": "360823",
    "NAME": "峡江县"
  },
  {
    "ID": "1437",
    "PARENT_ID": "1430",
    "CODE": "360824",
    "NAME": "新干县"
  },
  {
    "ID": "1438",
    "PARENT_ID": "1430",
    "CODE": "360825",
    "NAME": "永丰县"
  },
  {
    "ID": "1439",
    "PARENT_ID": "1430",
    "CODE": "360826",
    "NAME": "泰和县"
  },
  {
    "ID": "144",
    "PARENT_ID": "131",
    "CODE": "130629",
    "NAME": "容城县"
  },
  {
    "ID": "1440",
    "PARENT_ID": "1430",
    "CODE": "360827",
    "NAME": "遂川县"
  },
  {
    "ID": "1441",
    "PARENT_ID": "1430",
    "CODE": "360828",
    "NAME": "万安县"
  },
  {
    "ID": "1442",
    "PARENT_ID": "1430",
    "CODE": "360829",
    "NAME": "安福县"
  },
  {
    "ID": "1443",
    "PARENT_ID": "1430",
    "CODE": "360830",
    "NAME": "永新县"
  },
  {
    "ID": "1444",
    "PARENT_ID": "1430",
    "CODE": "360881",
    "NAME": "井冈山市"
  },
  {
    "ID": "1445",
    "PARENT_ID": "1361",
    "CODE": "360900",
    "NAME": "宜春市"
  },
  {
    "ID": "1446",
    "PARENT_ID": "1445",
    "CODE": "360901",
    "NAME": "市辖区"
  },
  {
    "ID": "1447",
    "PARENT_ID": "1445",
    "CODE": "360902",
    "NAME": "袁州区"
  },
  {
    "ID": "1448",
    "PARENT_ID": "1445",
    "CODE": "360921",
    "NAME": "奉新县"
  },
  {
    "ID": "1449",
    "PARENT_ID": "1445",
    "CODE": "360922",
    "NAME": "万载县"
  },
  {
    "ID": "145",
    "PARENT_ID": "131",
    "CODE": "130630",
    "NAME": "涞源县"
  },
  {
    "ID": "1450",
    "PARENT_ID": "1445",
    "CODE": "360923",
    "NAME": "上高县"
  },
  {
    "ID": "1451",
    "PARENT_ID": "1445",
    "CODE": "360924",
    "NAME": "宜丰县"
  },
  {
    "ID": "1452",
    "PARENT_ID": "1445",
    "CODE": "360925",
    "NAME": "靖安县"
  },
  {
    "ID": "1453",
    "PARENT_ID": "1445",
    "CODE": "360926",
    "NAME": "铜鼓县"
  },
  {
    "ID": "1454",
    "PARENT_ID": "1445",
    "CODE": "360981",
    "NAME": "丰城市"
  },
  {
    "ID": "1455",
    "PARENT_ID": "1445",
    "CODE": "360982",
    "NAME": "樟树市"
  },
  {
    "ID": "1456",
    "PARENT_ID": "1445",
    "CODE": "360983",
    "NAME": "高安市"
  },
  {
    "ID": "1457",
    "PARENT_ID": "1361",
    "CODE": "361000",
    "NAME": "抚州市"
  },
  {
    "ID": "1458",
    "PARENT_ID": "1457",
    "CODE": "361001",
    "NAME": "市辖区"
  },
  {
    "ID": "1459",
    "PARENT_ID": "1457",
    "CODE": "361002",
    "NAME": "临川区"
  },
  {
    "ID": "146",
    "PARENT_ID": "131",
    "CODE": "130631",
    "NAME": "望都县"
  },
  {
    "ID": "1460",
    "PARENT_ID": "1457",
    "CODE": "361021",
    "NAME": "南城县"
  },
  {
    "ID": "1461",
    "PARENT_ID": "1457",
    "CODE": "361022",
    "NAME": "黎川县"
  },
  {
    "ID": "1462",
    "PARENT_ID": "1457",
    "CODE": "361023",
    "NAME": "南丰县"
  },
  {
    "ID": "1463",
    "PARENT_ID": "1457",
    "CODE": "361024",
    "NAME": "崇仁县"
  },
  {
    "ID": "1464",
    "PARENT_ID": "1457",
    "CODE": "361025",
    "NAME": "乐安县"
  },
  {
    "ID": "1465",
    "PARENT_ID": "1457",
    "CODE": "361026",
    "NAME": "宜黄县"
  },
  {
    "ID": "1466",
    "PARENT_ID": "1457",
    "CODE": "361027",
    "NAME": "金溪县"
  },
  {
    "ID": "1467",
    "PARENT_ID": "1457",
    "CODE": "361028",
    "NAME": "资溪县"
  },
  {
    "ID": "1468",
    "PARENT_ID": "1457",
    "CODE": "361029",
    "NAME": "东乡县"
  },
  {
    "ID": "1469",
    "PARENT_ID": "1457",
    "CODE": "361030",
    "NAME": "广昌县"
  },
  {
    "ID": "147",
    "PARENT_ID": "131",
    "CODE": "130632",
    "NAME": "安新县"
  },
  {
    "ID": "1470",
    "PARENT_ID": "1361",
    "CODE": "361100",
    "NAME": "上饶市"
  },
  {
    "ID": "1471",
    "PARENT_ID": "1470",
    "CODE": "361101",
    "NAME": "市辖区"
  },
  {
    "ID": "1472",
    "PARENT_ID": "1470",
    "CODE": "361102",
    "NAME": "信州区"
  },
  {
    "ID": "1473",
    "PARENT_ID": "1470",
    "CODE": "361121",
    "NAME": "上饶县"
  },
  {
    "ID": "1474",
    "PARENT_ID": "1470",
    "CODE": "361122",
    "NAME": "广丰县"
  },
  {
    "ID": "1475",
    "PARENT_ID": "1470",
    "CODE": "361123",
    "NAME": "玉山县"
  },
  {
    "ID": "1476",
    "PARENT_ID": "1470",
    "CODE": "361124",
    "NAME": "铅山县"
  },
  {
    "ID": "1477",
    "PARENT_ID": "1470",
    "CODE": "361125",
    "NAME": "横峰县"
  },
  {
    "ID": "1478",
    "PARENT_ID": "1470",
    "CODE": "361126",
    "NAME": "弋阳县"
  },
  {
    "ID": "1479",
    "PARENT_ID": "1470",
    "CODE": "361127",
    "NAME": "余干县"
  },
  {
    "ID": "148",
    "PARENT_ID": "131",
    "CODE": "130633",
    "NAME": "易县"
  },
  {
    "ID": "1480",
    "PARENT_ID": "1470",
    "CODE": "361128",
    "NAME": "鄱阳县"
  },
  {
    "ID": "1481",
    "PARENT_ID": "1470",
    "CODE": "361129",
    "NAME": "万年县"
  },
  {
    "ID": "1482",
    "PARENT_ID": "1470",
    "CODE": "361130",
    "NAME": "婺源县"
  },
  {
    "ID": "1483",
    "PARENT_ID": "1470",
    "CODE": "361181",
    "NAME": "德兴市"
  },
  {
    "ID": "1484",
    "PARENT_ID": "0",
    "CODE": "370000",
    "NAME": "山东省"
  },
  {
    "ID": "1485",
    "PARENT_ID": "1484",
    "CODE": "370100",
    "NAME": "济南市"
  },
  {
    "ID": "1486",
    "PARENT_ID": "1485",
    "CODE": "370101",
    "NAME": "市辖区"
  },
  {
    "ID": "1487",
    "PARENT_ID": "1485",
    "CODE": "370102",
    "NAME": "历下区"
  },
  {
    "ID": "1488",
    "PARENT_ID": "1485",
    "CODE": "370103",
    "NAME": "市中区"
  },
  {
    "ID": "1489",
    "PARENT_ID": "1485",
    "CODE": "370104",
    "NAME": "槐荫区"
  },
  {
    "ID": "149",
    "PARENT_ID": "131",
    "CODE": "130634",
    "NAME": "曲阳县"
  },
  {
    "ID": "1490",
    "PARENT_ID": "1485",
    "CODE": "370105",
    "NAME": "天桥区"
  },
  {
    "ID": "1491",
    "PARENT_ID": "1485",
    "CODE": "370112",
    "NAME": "历城区"
  },
  {
    "ID": "1492",
    "PARENT_ID": "1485",
    "CODE": "370113",
    "NAME": "长清区"
  },
  {
    "ID": "1493",
    "PARENT_ID": "1485",
    "CODE": "370124",
    "NAME": "平阴县"
  },
  {
    "ID": "1494",
    "PARENT_ID": "1485",
    "CODE": "370125",
    "NAME": "济阳县"
  },
  {
    "ID": "1495",
    "PARENT_ID": "1485",
    "CODE": "370126",
    "NAME": "商河县"
  },
  {
    "ID": "1496",
    "PARENT_ID": "1485",
    "CODE": "370181",
    "NAME": "章丘市"
  },
  {
    "ID": "1497",
    "PARENT_ID": "1484",
    "CODE": "370200",
    "NAME": "青岛市"
  },
  {
    "ID": "1498",
    "PARENT_ID": "1497",
    "CODE": "370201",
    "NAME": "市辖区"
  },
  {
    "ID": "1499",
    "PARENT_ID": "1497",
    "CODE": "370202",
    "NAME": "市南区"
  },
  {
    "ID": "15",
    "PARENT_ID": "2",
    "CODE": "110116",
    "NAME": "怀柔区"
  },
  {
    "ID": "150",
    "PARENT_ID": "131",
    "CODE": "130635",
    "NAME": "蠡县"
  },
  {
    "ID": "1500",
    "PARENT_ID": "1497",
    "CODE": "370203",
    "NAME": "市北区"
  },
  {
    "ID": "1501",
    "PARENT_ID": "1497",
    "CODE": "370211",
    "NAME": "黄岛区"
  },
  {
    "ID": "1502",
    "PARENT_ID": "1497",
    "CODE": "370212",
    "NAME": "崂山区"
  },
  {
    "ID": "1503",
    "PARENT_ID": "1497",
    "CODE": "370213",
    "NAME": "李沧区"
  },
  {
    "ID": "1504",
    "PARENT_ID": "1497",
    "CODE": "370214",
    "NAME": "城阳区"
  },
  {
    "ID": "1505",
    "PARENT_ID": "1497",
    "CODE": "370281",
    "NAME": "胶州市"
  },
  {
    "ID": "1506",
    "PARENT_ID": "1497",
    "CODE": "370282",
    "NAME": "即墨市"
  },
  {
    "ID": "1507",
    "PARENT_ID": "1497",
    "CODE": "370283",
    "NAME": "平度市"
  },
  {
    "ID": "1508",
    "PARENT_ID": "1497",
    "CODE": "370285",
    "NAME": "莱西市"
  },
  {
    "ID": "1509",
    "PARENT_ID": "1484",
    "CODE": "370300",
    "NAME": "淄博市"
  },
  {
    "ID": "151",
    "PARENT_ID": "131",
    "CODE": "130636",
    "NAME": "顺平县"
  },
  {
    "ID": "1510",
    "PARENT_ID": "1509",
    "CODE": "370301",
    "NAME": "市辖区"
  },
  {
    "ID": "1511",
    "PARENT_ID": "1509",
    "CODE": "370302",
    "NAME": "淄川区"
  },
  {
    "ID": "1512",
    "PARENT_ID": "1509",
    "CODE": "370303",
    "NAME": "张店区"
  },
  {
    "ID": "1513",
    "PARENT_ID": "1509",
    "CODE": "370304",
    "NAME": "博山区"
  },
  {
    "ID": "1514",
    "PARENT_ID": "1509",
    "CODE": "370305",
    "NAME": "临淄区"
  },
  {
    "ID": "1515",
    "PARENT_ID": "1509",
    "CODE": "370306",
    "NAME": "周村区"
  },
  {
    "ID": "1516",
    "PARENT_ID": "1509",
    "CODE": "370321",
    "NAME": "桓台县"
  },
  {
    "ID": "1517",
    "PARENT_ID": "1509",
    "CODE": "370322",
    "NAME": "高青县"
  },
  {
    "ID": "1518",
    "PARENT_ID": "1509",
    "CODE": "370323",
    "NAME": "沂源县"
  },
  {
    "ID": "1519",
    "PARENT_ID": "1484",
    "CODE": "370400",
    "NAME": "枣庄市"
  },
  {
    "ID": "152",
    "PARENT_ID": "131",
    "CODE": "130637",
    "NAME": "博野县"
  },
  {
    "ID": "1520",
    "PARENT_ID": "1519",
    "CODE": "370401",
    "NAME": "市辖区"
  },
  {
    "ID": "1521",
    "PARENT_ID": "1519",
    "CODE": "370402",
    "NAME": "市中区"
  },
  {
    "ID": "1522",
    "PARENT_ID": "1519",
    "CODE": "370403",
    "NAME": "薛城区"
  },
  {
    "ID": "1523",
    "PARENT_ID": "1519",
    "CODE": "370404",
    "NAME": "峄城区"
  },
  {
    "ID": "1524",
    "PARENT_ID": "1519",
    "CODE": "370405",
    "NAME": "台儿庄区"
  },
  {
    "ID": "1525",
    "PARENT_ID": "1519",
    "CODE": "370406",
    "NAME": "山亭区"
  },
  {
    "ID": "1526",
    "PARENT_ID": "1519",
    "CODE": "370481",
    "NAME": "滕州市"
  },
  {
    "ID": "1527",
    "PARENT_ID": "1484",
    "CODE": "370500",
    "NAME": "东营市"
  },
  {
    "ID": "1528",
    "PARENT_ID": "1527",
    "CODE": "370501",
    "NAME": "市辖区"
  },
  {
    "ID": "1529",
    "PARENT_ID": "1527",
    "CODE": "370502",
    "NAME": "东营区"
  },
  {
    "ID": "153",
    "PARENT_ID": "131",
    "CODE": "130638",
    "NAME": "雄县"
  },
  {
    "ID": "1530",
    "PARENT_ID": "1527",
    "CODE": "370503",
    "NAME": "河口区"
  },
  {
    "ID": "1531",
    "PARENT_ID": "1527",
    "CODE": "370521",
    "NAME": "垦利县"
  },
  {
    "ID": "1532",
    "PARENT_ID": "1527",
    "CODE": "370522",
    "NAME": "利津县"
  },
  {
    "ID": "1533",
    "PARENT_ID": "1527",
    "CODE": "370523",
    "NAME": "广饶县"
  },
  {
    "ID": "1534",
    "PARENT_ID": "1484",
    "CODE": "370600",
    "NAME": "烟台市"
  },
  {
    "ID": "1535",
    "PARENT_ID": "1534",
    "CODE": "370601",
    "NAME": "市辖区"
  },
  {
    "ID": "1536",
    "PARENT_ID": "1534",
    "CODE": "370602",
    "NAME": "芝罘区"
  },
  {
    "ID": "1537",
    "PARENT_ID": "1534",
    "CODE": "370611",
    "NAME": "福山区"
  },
  {
    "ID": "1538",
    "PARENT_ID": "1534",
    "CODE": "370612",
    "NAME": "牟平区"
  },
  {
    "ID": "1539",
    "PARENT_ID": "1534",
    "CODE": "370613",
    "NAME": "莱山区"
  },
  {
    "ID": "154",
    "PARENT_ID": "131",
    "CODE": "130681",
    "NAME": "涿州市"
  },
  {
    "ID": "1540",
    "PARENT_ID": "1534",
    "CODE": "370634",
    "NAME": "长岛县"
  },
  {
    "ID": "1541",
    "PARENT_ID": "1534",
    "CODE": "370681",
    "NAME": "龙口市"
  },
  {
    "ID": "1542",
    "PARENT_ID": "1534",
    "CODE": "370682",
    "NAME": "莱阳市"
  },
  {
    "ID": "1543",
    "PARENT_ID": "1534",
    "CODE": "370683",
    "NAME": "莱州市"
  },
  {
    "ID": "1544",
    "PARENT_ID": "1534",
    "CODE": "370684",
    "NAME": "蓬莱市"
  },
  {
    "ID": "1545",
    "PARENT_ID": "1534",
    "CODE": "370685",
    "NAME": "招远市"
  },
  {
    "ID": "1546",
    "PARENT_ID": "1534",
    "CODE": "370686",
    "NAME": "栖霞市"
  },
  {
    "ID": "1547",
    "PARENT_ID": "1534",
    "CODE": "370687",
    "NAME": "海阳市"
  },
  {
    "ID": "1548",
    "PARENT_ID": "1484",
    "CODE": "370700",
    "NAME": "潍坊市"
  },
  {
    "ID": "1549",
    "PARENT_ID": "1548",
    "CODE": "370701",
    "NAME": "市辖区"
  },
  {
    "ID": "155",
    "PARENT_ID": "131",
    "CODE": "130682",
    "NAME": "定州市"
  },
  {
    "ID": "1550",
    "PARENT_ID": "1548",
    "CODE": "370702",
    "NAME": "潍城区"
  },
  {
    "ID": "1551",
    "PARENT_ID": "1548",
    "CODE": "370703",
    "NAME": "寒亭区"
  },
  {
    "ID": "1552",
    "PARENT_ID": "1548",
    "CODE": "370704",
    "NAME": "坊子区"
  },
  {
    "ID": "1553",
    "PARENT_ID": "1548",
    "CODE": "370705",
    "NAME": "奎文区"
  },
  {
    "ID": "1554",
    "PARENT_ID": "1548",
    "CODE": "370724",
    "NAME": "临朐县"
  },
  {
    "ID": "1555",
    "PARENT_ID": "1548",
    "CODE": "370725",
    "NAME": "昌乐县"
  },
  {
    "ID": "1556",
    "PARENT_ID": "1548",
    "CODE": "370781",
    "NAME": "青州市"
  },
  {
    "ID": "1557",
    "PARENT_ID": "1548",
    "CODE": "370782",
    "NAME": "诸城市"
  },
  {
    "ID": "1558",
    "PARENT_ID": "1548",
    "CODE": "370783",
    "NAME": "寿光市"
  },
  {
    "ID": "1559",
    "PARENT_ID": "1548",
    "CODE": "370784",
    "NAME": "安丘市"
  },
  {
    "ID": "156",
    "PARENT_ID": "131",
    "CODE": "130683",
    "NAME": "安国市"
  },
  {
    "ID": "1560",
    "PARENT_ID": "1548",
    "CODE": "370785",
    "NAME": "高密市"
  },
  {
    "ID": "1561",
    "PARENT_ID": "1548",
    "CODE": "370786",
    "NAME": "昌邑市"
  },
  {
    "ID": "1562",
    "PARENT_ID": "1484",
    "CODE": "370800",
    "NAME": "济宁市"
  },
  {
    "ID": "1563",
    "PARENT_ID": "1562",
    "CODE": "370801",
    "NAME": "市辖区"
  },
  {
    "ID": "1564",
    "PARENT_ID": "1562",
    "CODE": "370811",
    "NAME": "任城区"
  },
  {
    "ID": "1565",
    "PARENT_ID": "1562",
    "CODE": "370812",
    "NAME": "兖州区"
  },
  {
    "ID": "1566",
    "PARENT_ID": "1562",
    "CODE": "370826",
    "NAME": "微山县"
  },
  {
    "ID": "1567",
    "PARENT_ID": "1562",
    "CODE": "370827",
    "NAME": "鱼台县"
  },
  {
    "ID": "1568",
    "PARENT_ID": "1562",
    "CODE": "370828",
    "NAME": "金乡县"
  },
  {
    "ID": "1569",
    "PARENT_ID": "1562",
    "CODE": "370829",
    "NAME": "嘉祥县"
  },
  {
    "ID": "157",
    "PARENT_ID": "131",
    "CODE": "130684",
    "NAME": "高碑店市"
  },
  {
    "ID": "1570",
    "PARENT_ID": "1562",
    "CODE": "370830",
    "NAME": "汶上县"
  },
  {
    "ID": "1571",
    "PARENT_ID": "1562",
    "CODE": "370831",
    "NAME": "泗水县"
  },
  {
    "ID": "1572",
    "PARENT_ID": "1562",
    "CODE": "370832",
    "NAME": "梁山县"
  },
  {
    "ID": "1573",
    "PARENT_ID": "1562",
    "CODE": "370881",
    "NAME": "曲阜市"
  },
  {
    "ID": "1574",
    "PARENT_ID": "1562",
    "CODE": "370883",
    "NAME": "邹城市"
  },
  {
    "ID": "1575",
    "PARENT_ID": "1484",
    "CODE": "370900",
    "NAME": "泰安市"
  },
  {
    "ID": "1576",
    "PARENT_ID": "1575",
    "CODE": "370901",
    "NAME": "市辖区"
  },
  {
    "ID": "1577",
    "PARENT_ID": "1575",
    "CODE": "370902",
    "NAME": "泰山区"
  },
  {
    "ID": "1578",
    "PARENT_ID": "1575",
    "CODE": "370911",
    "NAME": "岱岳区"
  },
  {
    "ID": "1579",
    "PARENT_ID": "1575",
    "CODE": "370921",
    "NAME": "宁阳县"
  },
  {
    "ID": "158",
    "PARENT_ID": "39",
    "CODE": "130700",
    "NAME": "张家口市"
  },
  {
    "ID": "1580",
    "PARENT_ID": "1575",
    "CODE": "370923",
    "NAME": "东平县"
  },
  {
    "ID": "1581",
    "PARENT_ID": "1575",
    "CODE": "370982",
    "NAME": "新泰市"
  },
  {
    "ID": "1582",
    "PARENT_ID": "1575",
    "CODE": "370983",
    "NAME": "肥城市"
  },
  {
    "ID": "1583",
    "PARENT_ID": "1484",
    "CODE": "371000",
    "NAME": "威海市"
  },
  {
    "ID": "1584",
    "PARENT_ID": "1583",
    "CODE": "371001",
    "NAME": "市辖区"
  },
  {
    "ID": "1585",
    "PARENT_ID": "1583",
    "CODE": "371002",
    "NAME": "环翠区"
  },
  {
    "ID": "1586",
    "PARENT_ID": "1583",
    "CODE": "371003",
    "NAME": "文登区"
  },
  {
    "ID": "1587",
    "PARENT_ID": "1583",
    "CODE": "371082",
    "NAME": "荣成市"
  },
  {
    "ID": "1588",
    "PARENT_ID": "1583",
    "CODE": "371083",
    "NAME": "乳山市"
  },
  {
    "ID": "1589",
    "PARENT_ID": "1484",
    "CODE": "371100",
    "NAME": "日照市"
  },
  {
    "ID": "159",
    "PARENT_ID": "158",
    "CODE": "130701",
    "NAME": "市辖区"
  },
  {
    "ID": "1590",
    "PARENT_ID": "1589",
    "CODE": "371101",
    "NAME": "市辖区"
  },
  {
    "ID": "1591",
    "PARENT_ID": "1589",
    "CODE": "371102",
    "NAME": "东港区"
  },
  {
    "ID": "1592",
    "PARENT_ID": "1589",
    "CODE": "371103",
    "NAME": "岚山区"
  },
  {
    "ID": "1593",
    "PARENT_ID": "1589",
    "CODE": "371121",
    "NAME": "五莲县"
  },
  {
    "ID": "1594",
    "PARENT_ID": "1589",
    "CODE": "371122",
    "NAME": "莒县"
  },
  {
    "ID": "1595",
    "PARENT_ID": "1484",
    "CODE": "371200",
    "NAME": "莱芜市"
  },
  {
    "ID": "1596",
    "PARENT_ID": "1595",
    "CODE": "371201",
    "NAME": "市辖区"
  },
  {
    "ID": "1597",
    "PARENT_ID": "1595",
    "CODE": "371202",
    "NAME": "莱城区"
  },
  {
    "ID": "1598",
    "PARENT_ID": "1595",
    "CODE": "371203",
    "NAME": "钢城区"
  },
  {
    "ID": "1599",
    "PARENT_ID": "1484",
    "CODE": "371300",
    "NAME": "临沂市"
  },
  {
    "ID": "16",
    "PARENT_ID": "2",
    "CODE": "110117",
    "NAME": "平谷区"
  },
  {
    "ID": "160",
    "PARENT_ID": "158",
    "CODE": "130702",
    "NAME": "桥东区"
  },
  {
    "ID": "1600",
    "PARENT_ID": "1599",
    "CODE": "371301",
    "NAME": "市辖区"
  },
  {
    "ID": "1601",
    "PARENT_ID": "1599",
    "CODE": "371302",
    "NAME": "兰山区"
  },
  {
    "ID": "1602",
    "PARENT_ID": "1599",
    "CODE": "371311",
    "NAME": "罗庄区"
  },
  {
    "ID": "1603",
    "PARENT_ID": "1599",
    "CODE": "371312",
    "NAME": "河东区"
  },
  {
    "ID": "1604",
    "PARENT_ID": "1599",
    "CODE": "371321",
    "NAME": "沂南县"
  },
  {
    "ID": "1605",
    "PARENT_ID": "1599",
    "CODE": "371322",
    "NAME": "郯城县"
  },
  {
    "ID": "1606",
    "PARENT_ID": "1599",
    "CODE": "371323",
    "NAME": "沂水县"
  },
  {
    "ID": "1607",
    "PARENT_ID": "1599",
    "CODE": "371324",
    "NAME": "兰陵县"
  },
  {
    "ID": "1608",
    "PARENT_ID": "1599",
    "CODE": "371325",
    "NAME": "费县"
  },
  {
    "ID": "1609",
    "PARENT_ID": "1599",
    "CODE": "371326",
    "NAME": "平邑县"
  },
  {
    "ID": "161",
    "PARENT_ID": "158",
    "CODE": "130703",
    "NAME": "桥西区"
  },
  {
    "ID": "1610",
    "PARENT_ID": "1599",
    "CODE": "371327",
    "NAME": "莒南县"
  },
  {
    "ID": "1611",
    "PARENT_ID": "1599",
    "CODE": "371328",
    "NAME": "蒙阴县"
  },
  {
    "ID": "1612",
    "PARENT_ID": "1599",
    "CODE": "371329",
    "NAME": "临沭县"
  },
  {
    "ID": "1613",
    "PARENT_ID": "1484",
    "CODE": "371400",
    "NAME": "德州市"
  },
  {
    "ID": "1614",
    "PARENT_ID": "1613",
    "CODE": "371401",
    "NAME": "市辖区"
  },
  {
    "ID": "1615",
    "PARENT_ID": "1613",
    "CODE": "371402",
    "NAME": "德城区"
  },
  {
    "ID": "1616",
    "PARENT_ID": "1613",
    "CODE": "371403",
    "NAME": "陵城区"
  },
  {
    "ID": "1617",
    "PARENT_ID": "1613",
    "CODE": "371422",
    "NAME": "宁津县"
  },
  {
    "ID": "1618",
    "PARENT_ID": "1613",
    "CODE": "371423",
    "NAME": "庆云县"
  },
  {
    "ID": "1619",
    "PARENT_ID": "1613",
    "CODE": "371424",
    "NAME": "临邑县"
  },
  {
    "ID": "162",
    "PARENT_ID": "158",
    "CODE": "130705",
    "NAME": "宣化区"
  },
  {
    "ID": "1620",
    "PARENT_ID": "1613",
    "CODE": "371425",
    "NAME": "齐河县"
  },
  {
    "ID": "1621",
    "PARENT_ID": "1613",
    "CODE": "371426",
    "NAME": "平原县"
  },
  {
    "ID": "1622",
    "PARENT_ID": "1613",
    "CODE": "371427",
    "NAME": "夏津县"
  },
  {
    "ID": "1623",
    "PARENT_ID": "1613",
    "CODE": "371428",
    "NAME": "武城县"
  },
  {
    "ID": "1624",
    "PARENT_ID": "1613",
    "CODE": "371481",
    "NAME": "乐陵市"
  },
  {
    "ID": "1625",
    "PARENT_ID": "1613",
    "CODE": "371482",
    "NAME": "禹城市"
  },
  {
    "ID": "1626",
    "PARENT_ID": "1484",
    "CODE": "371500",
    "NAME": "聊城市"
  },
  {
    "ID": "1627",
    "PARENT_ID": "1626",
    "CODE": "371501",
    "NAME": "市辖区"
  },
  {
    "ID": "1628",
    "PARENT_ID": "1626",
    "CODE": "371502",
    "NAME": "东昌府区"
  },
  {
    "ID": "1629",
    "PARENT_ID": "1626",
    "CODE": "371521",
    "NAME": "阳谷县"
  },
  {
    "ID": "163",
    "PARENT_ID": "158",
    "CODE": "130706",
    "NAME": "下花园区"
  },
  {
    "ID": "1630",
    "PARENT_ID": "1626",
    "CODE": "371522",
    "NAME": "莘县"
  },
  {
    "ID": "1631",
    "PARENT_ID": "1626",
    "CODE": "371523",
    "NAME": "茌平县"
  },
  {
    "ID": "1632",
    "PARENT_ID": "1626",
    "CODE": "371524",
    "NAME": "东阿县"
  },
  {
    "ID": "1633",
    "PARENT_ID": "1626",
    "CODE": "371525",
    "NAME": "冠县"
  },
  {
    "ID": "1634",
    "PARENT_ID": "1626",
    "CODE": "371526",
    "NAME": "高唐县"
  },
  {
    "ID": "1635",
    "PARENT_ID": "1626",
    "CODE": "371581",
    "NAME": "临清市"
  },
  {
    "ID": "1636",
    "PARENT_ID": "1484",
    "CODE": "371600",
    "NAME": "滨州市"
  },
  {
    "ID": "1637",
    "PARENT_ID": "1636",
    "CODE": "371601",
    "NAME": "市辖区"
  },
  {
    "ID": "1638",
    "PARENT_ID": "1636",
    "CODE": "371602",
    "NAME": "滨城区"
  },
  {
    "ID": "1639",
    "PARENT_ID": "1636",
    "CODE": "371603",
    "NAME": "沾化区"
  },
  {
    "ID": "164",
    "PARENT_ID": "158",
    "CODE": "130721",
    "NAME": "宣化县"
  },
  {
    "ID": "1640",
    "PARENT_ID": "1636",
    "CODE": "371621",
    "NAME": "惠民县"
  },
  {
    "ID": "1641",
    "PARENT_ID": "1636",
    "CODE": "371622",
    "NAME": "阳信县"
  },
  {
    "ID": "1642",
    "PARENT_ID": "1636",
    "CODE": "371623",
    "NAME": "无棣县"
  },
  {
    "ID": "1643",
    "PARENT_ID": "1636",
    "CODE": "371625",
    "NAME": "博兴县"
  },
  {
    "ID": "1644",
    "PARENT_ID": "1636",
    "CODE": "371626",
    "NAME": "邹平县"
  },
  {
    "ID": "1645",
    "PARENT_ID": "1484",
    "CODE": "371700",
    "NAME": "菏泽市"
  },
  {
    "ID": "1646",
    "PARENT_ID": "1645",
    "CODE": "371701",
    "NAME": "市辖区"
  },
  {
    "ID": "1647",
    "PARENT_ID": "1645",
    "CODE": "371702",
    "NAME": "牡丹区"
  },
  {
    "ID": "1648",
    "PARENT_ID": "1645",
    "CODE": "371721",
    "NAME": "曹县"
  },
  {
    "ID": "1649",
    "PARENT_ID": "1645",
    "CODE": "371722",
    "NAME": "单县"
  },
  {
    "ID": "165",
    "PARENT_ID": "158",
    "CODE": "130722",
    "NAME": "张北县"
  },
  {
    "ID": "1650",
    "PARENT_ID": "1645",
    "CODE": "371723",
    "NAME": "成武县"
  },
  {
    "ID": "1651",
    "PARENT_ID": "1645",
    "CODE": "371724",
    "NAME": "巨野县"
  },
  {
    "ID": "1652",
    "PARENT_ID": "1645",
    "CODE": "371725",
    "NAME": "郓城县"
  },
  {
    "ID": "1653",
    "PARENT_ID": "1645",
    "CODE": "371726",
    "NAME": "鄄城县"
  },
  {
    "ID": "1654",
    "PARENT_ID": "1645",
    "CODE": "371727",
    "NAME": "定陶县"
  },
  {
    "ID": "1655",
    "PARENT_ID": "1645",
    "CODE": "371728",
    "NAME": "东明县"
  },
  {
    "ID": "1656",
    "PARENT_ID": "0",
    "CODE": "410000",
    "NAME": "河南省"
  },
  {
    "ID": "1657",
    "PARENT_ID": "1656",
    "CODE": "410100",
    "NAME": "郑州市"
  },
  {
    "ID": "1658",
    "PARENT_ID": "1657",
    "CODE": "410101",
    "NAME": "市辖区"
  },
  {
    "ID": "1659",
    "PARENT_ID": "1657",
    "CODE": "410102",
    "NAME": "中原区"
  },
  {
    "ID": "166",
    "PARENT_ID": "158",
    "CODE": "130723",
    "NAME": "康保县"
  },
  {
    "ID": "1660",
    "PARENT_ID": "1657",
    "CODE": "410103",
    "NAME": "二七区"
  },
  {
    "ID": "1661",
    "PARENT_ID": "1657",
    "CODE": "410104",
    "NAME": "管城回族区"
  },
  {
    "ID": "1662",
    "PARENT_ID": "1657",
    "CODE": "410105",
    "NAME": "金水区"
  },
  {
    "ID": "1663",
    "PARENT_ID": "1657",
    "CODE": "410106",
    "NAME": "上街区"
  },
  {
    "ID": "1664",
    "PARENT_ID": "1657",
    "CODE": "410108",
    "NAME": "惠济区"
  },
  {
    "ID": "1665",
    "PARENT_ID": "1657",
    "CODE": "410122",
    "NAME": "中牟县"
  },
  {
    "ID": "1666",
    "PARENT_ID": "1657",
    "CODE": "410181",
    "NAME": "巩义市"
  },
  {
    "ID": "1667",
    "PARENT_ID": "1657",
    "CODE": "410182",
    "NAME": "荥阳市"
  },
  {
    "ID": "1668",
    "PARENT_ID": "1657",
    "CODE": "410183",
    "NAME": "新密市"
  },
  {
    "ID": "1669",
    "PARENT_ID": "1657",
    "CODE": "410184",
    "NAME": "新郑市"
  },
  {
    "ID": "167",
    "PARENT_ID": "158",
    "CODE": "130724",
    "NAME": "沽源县"
  },
  {
    "ID": "1670",
    "PARENT_ID": "1657",
    "CODE": "410185",
    "NAME": "登封市"
  },
  {
    "ID": "1671",
    "PARENT_ID": "1656",
    "CODE": "410200",
    "NAME": "开封市"
  },
  {
    "ID": "1672",
    "PARENT_ID": "1671",
    "CODE": "410201",
    "NAME": "市辖区"
  },
  {
    "ID": "1673",
    "PARENT_ID": "1671",
    "CODE": "410202",
    "NAME": "龙亭区"
  },
  {
    "ID": "1674",
    "PARENT_ID": "1671",
    "CODE": "410203",
    "NAME": "顺河回族区"
  },
  {
    "ID": "1675",
    "PARENT_ID": "1671",
    "CODE": "410204",
    "NAME": "鼓楼区"
  },
  {
    "ID": "1676",
    "PARENT_ID": "1671",
    "CODE": "410205",
    "NAME": "禹王台区"
  },
  {
    "ID": "1677",
    "PARENT_ID": "1671",
    "CODE": "410211",
    "NAME": "金明区"
  },
  {
    "ID": "1678",
    "PARENT_ID": "1671",
    "CODE": "410221",
    "NAME": "杞县"
  },
  {
    "ID": "1679",
    "PARENT_ID": "1671",
    "CODE": "410222",
    "NAME": "通许县"
  },
  {
    "ID": "168",
    "PARENT_ID": "158",
    "CODE": "130725",
    "NAME": "尚义县"
  },
  {
    "ID": "1680",
    "PARENT_ID": "1671",
    "CODE": "410223",
    "NAME": "尉氏县"
  },
  {
    "ID": "1681",
    "PARENT_ID": "1671",
    "CODE": "410224",
    "NAME": "开封县"
  },
  {
    "ID": "1682",
    "PARENT_ID": "1671",
    "CODE": "410225",
    "NAME": "兰考县"
  },
  {
    "ID": "1683",
    "PARENT_ID": "1656",
    "CODE": "410300",
    "NAME": "洛阳市"
  },
  {
    "ID": "1684",
    "PARENT_ID": "1683",
    "CODE": "410301",
    "NAME": "市辖区"
  },
  {
    "ID": "1685",
    "PARENT_ID": "1683",
    "CODE": "410302",
    "NAME": "老城区"
  },
  {
    "ID": "1686",
    "PARENT_ID": "1683",
    "CODE": "410303",
    "NAME": "西工区"
  },
  {
    "ID": "1687",
    "PARENT_ID": "1683",
    "CODE": "410304",
    "NAME": "瀍河回族区"
  },
  {
    "ID": "1688",
    "PARENT_ID": "1683",
    "CODE": "410305",
    "NAME": "涧西区"
  },
  {
    "ID": "1689",
    "PARENT_ID": "1683",
    "CODE": "410306",
    "NAME": "吉利区"
  },
  {
    "ID": "169",
    "PARENT_ID": "158",
    "CODE": "130726",
    "NAME": "蔚县"
  },
  {
    "ID": "1690",
    "PARENT_ID": "1683",
    "CODE": "410311",
    "NAME": "洛龙区"
  },
  {
    "ID": "1691",
    "PARENT_ID": "1683",
    "CODE": "410322",
    "NAME": "孟津县"
  },
  {
    "ID": "1692",
    "PARENT_ID": "1683",
    "CODE": "410323",
    "NAME": "新安县"
  },
  {
    "ID": "1693",
    "PARENT_ID": "1683",
    "CODE": "410324",
    "NAME": "栾川县"
  },
  {
    "ID": "1694",
    "PARENT_ID": "1683",
    "CODE": "410325",
    "NAME": "嵩县"
  },
  {
    "ID": "1695",
    "PARENT_ID": "1683",
    "CODE": "410326",
    "NAME": "汝阳县"
  },
  {
    "ID": "1696",
    "PARENT_ID": "1683",
    "CODE": "410327",
    "NAME": "宜阳县"
  },
  {
    "ID": "1697",
    "PARENT_ID": "1683",
    "CODE": "410328",
    "NAME": "洛宁县"
  },
  {
    "ID": "1698",
    "PARENT_ID": "1683",
    "CODE": "410329",
    "NAME": "伊川县"
  },
  {
    "ID": "1699",
    "PARENT_ID": "1683",
    "CODE": "410381",
    "NAME": "偃师市"
  },
  {
    "ID": "17",
    "PARENT_ID": "1",
    "CODE": "110200",
    "NAME": "县(北京)"
  },
  {
    "ID": "170",
    "PARENT_ID": "158",
    "CODE": "130727",
    "NAME": "阳原县"
  },
  {
    "ID": "1700",
    "PARENT_ID": "1656",
    "CODE": "410400",
    "NAME": "平顶山市"
  },
  {
    "ID": "1701",
    "PARENT_ID": "1700",
    "CODE": "410401",
    "NAME": "市辖区"
  },
  {
    "ID": "1702",
    "PARENT_ID": "1700",
    "CODE": "410402",
    "NAME": "新华区"
  },
  {
    "ID": "1703",
    "PARENT_ID": "1700",
    "CODE": "410403",
    "NAME": "卫东区"
  },
  {
    "ID": "1704",
    "PARENT_ID": "1700",
    "CODE": "410404",
    "NAME": "石龙区"
  },
  {
    "ID": "1705",
    "PARENT_ID": "1700",
    "CODE": "410411",
    "NAME": "湛河区"
  },
  {
    "ID": "1706",
    "PARENT_ID": "1700",
    "CODE": "410421",
    "NAME": "宝丰县"
  },
  {
    "ID": "1707",
    "PARENT_ID": "1700",
    "CODE": "410422",
    "NAME": "叶县"
  },
  {
    "ID": "1708",
    "PARENT_ID": "1700",
    "CODE": "410423",
    "NAME": "鲁山县"
  },
  {
    "ID": "1709",
    "PARENT_ID": "1700",
    "CODE": "410425",
    "NAME": "郏县"
  },
  {
    "ID": "171",
    "PARENT_ID": "158",
    "CODE": "130728",
    "NAME": "怀安县"
  },
  {
    "ID": "1710",
    "PARENT_ID": "1700",
    "CODE": "410481",
    "NAME": "舞钢市"
  },
  {
    "ID": "1711",
    "PARENT_ID": "1700",
    "CODE": "410482",
    "NAME": "汝州市"
  },
  {
    "ID": "1712",
    "PARENT_ID": "1656",
    "CODE": "410500",
    "NAME": "安阳市"
  },
  {
    "ID": "1713",
    "PARENT_ID": "1712",
    "CODE": "410501",
    "NAME": "市辖区"
  },
  {
    "ID": "1714",
    "PARENT_ID": "1712",
    "CODE": "410502",
    "NAME": "文峰区"
  },
  {
    "ID": "1715",
    "PARENT_ID": "1712",
    "CODE": "410503",
    "NAME": "北关区"
  },
  {
    "ID": "1716",
    "PARENT_ID": "1712",
    "CODE": "410505",
    "NAME": "殷都区"
  },
  {
    "ID": "1717",
    "PARENT_ID": "1712",
    "CODE": "410506",
    "NAME": "龙安区"
  },
  {
    "ID": "1718",
    "PARENT_ID": "1712",
    "CODE": "410522",
    "NAME": "安阳县"
  },
  {
    "ID": "1719",
    "PARENT_ID": "1712",
    "CODE": "410523",
    "NAME": "汤阴县"
  },
  {
    "ID": "172",
    "PARENT_ID": "158",
    "CODE": "130729",
    "NAME": "万全县"
  },
  {
    "ID": "1720",
    "PARENT_ID": "1712",
    "CODE": "410526",
    "NAME": "滑县"
  },
  {
    "ID": "1721",
    "PARENT_ID": "1712",
    "CODE": "410527",
    "NAME": "内黄县"
  },
  {
    "ID": "1722",
    "PARENT_ID": "1712",
    "CODE": "410581",
    "NAME": "林州市"
  },
  {
    "ID": "1723",
    "PARENT_ID": "1656",
    "CODE": "410600",
    "NAME": "鹤壁市"
  },
  {
    "ID": "1724",
    "PARENT_ID": "1723",
    "CODE": "410601",
    "NAME": "市辖区"
  },
  {
    "ID": "1725",
    "PARENT_ID": "1723",
    "CODE": "410602",
    "NAME": "鹤山区"
  },
  {
    "ID": "1726",
    "PARENT_ID": "1723",
    "CODE": "410603",
    "NAME": "山城区"
  },
  {
    "ID": "1727",
    "PARENT_ID": "1723",
    "CODE": "410611",
    "NAME": "淇滨区"
  },
  {
    "ID": "1728",
    "PARENT_ID": "1723",
    "CODE": "410621",
    "NAME": "浚县"
  },
  {
    "ID": "1729",
    "PARENT_ID": "1723",
    "CODE": "410622",
    "NAME": "淇县"
  },
  {
    "ID": "173",
    "PARENT_ID": "158",
    "CODE": "130730",
    "NAME": "怀来县"
  },
  {
    "ID": "1730",
    "PARENT_ID": "1656",
    "CODE": "410700",
    "NAME": "新乡市"
  },
  {
    "ID": "1731",
    "PARENT_ID": "1730",
    "CODE": "410701",
    "NAME": "市辖区"
  },
  {
    "ID": "1732",
    "PARENT_ID": "1730",
    "CODE": "410702",
    "NAME": "红旗区"
  },
  {
    "ID": "1733",
    "PARENT_ID": "1730",
    "CODE": "410703",
    "NAME": "卫滨区"
  },
  {
    "ID": "1734",
    "PARENT_ID": "1730",
    "CODE": "410704",
    "NAME": "凤泉区"
  },
  {
    "ID": "1735",
    "PARENT_ID": "1730",
    "CODE": "410711",
    "NAME": "牧野区"
  },
  {
    "ID": "1736",
    "PARENT_ID": "1730",
    "CODE": "410721",
    "NAME": "新乡县"
  },
  {
    "ID": "1737",
    "PARENT_ID": "1730",
    "CODE": "410724",
    "NAME": "获嘉县"
  },
  {
    "ID": "1738",
    "PARENT_ID": "1730",
    "CODE": "410725",
    "NAME": "原阳县"
  },
  {
    "ID": "1739",
    "PARENT_ID": "1730",
    "CODE": "410726",
    "NAME": "延津县"
  },
  {
    "ID": "174",
    "PARENT_ID": "158",
    "CODE": "130731",
    "NAME": "涿鹿县"
  },
  {
    "ID": "1740",
    "PARENT_ID": "1730",
    "CODE": "410727",
    "NAME": "封丘县"
  },
  {
    "ID": "1741",
    "PARENT_ID": "1730",
    "CODE": "410728",
    "NAME": "长垣县"
  },
  {
    "ID": "1742",
    "PARENT_ID": "1730",
    "CODE": "410781",
    "NAME": "卫辉市"
  },
  {
    "ID": "1743",
    "PARENT_ID": "1730",
    "CODE": "410782",
    "NAME": "辉县市"
  },
  {
    "ID": "1744",
    "PARENT_ID": "1656",
    "CODE": "410800",
    "NAME": "焦作市"
  },
  {
    "ID": "1745",
    "PARENT_ID": "1744",
    "CODE": "410801",
    "NAME": "市辖区"
  },
  {
    "ID": "1746",
    "PARENT_ID": "1744",
    "CODE": "410802",
    "NAME": "解放区"
  },
  {
    "ID": "1747",
    "PARENT_ID": "1744",
    "CODE": "410803",
    "NAME": "中站区"
  },
  {
    "ID": "1748",
    "PARENT_ID": "1744",
    "CODE": "410804",
    "NAME": "马村区"
  },
  {
    "ID": "1749",
    "PARENT_ID": "1744",
    "CODE": "410811",
    "NAME": "山阳区"
  },
  {
    "ID": "175",
    "PARENT_ID": "158",
    "CODE": "130732",
    "NAME": "赤城县"
  },
  {
    "ID": "1750",
    "PARENT_ID": "1744",
    "CODE": "410821",
    "NAME": "修武县"
  },
  {
    "ID": "1751",
    "PARENT_ID": "1744",
    "CODE": "410822",
    "NAME": "博爱县"
  },
  {
    "ID": "1752",
    "PARENT_ID": "1744",
    "CODE": "410823",
    "NAME": "武陟县"
  },
  {
    "ID": "1753",
    "PARENT_ID": "1744",
    "CODE": "410825",
    "NAME": "温县"
  },
  {
    "ID": "1754",
    "PARENT_ID": "1744",
    "CODE": "410882",
    "NAME": "沁阳市"
  },
  {
    "ID": "1755",
    "PARENT_ID": "1744",
    "CODE": "410883",
    "NAME": "孟州市"
  },
  {
    "ID": "1756",
    "PARENT_ID": "1656",
    "CODE": "410900",
    "NAME": "濮阳市"
  },
  {
    "ID": "1757",
    "PARENT_ID": "1756",
    "CODE": "410901",
    "NAME": "市辖区"
  },
  {
    "ID": "1758",
    "PARENT_ID": "1756",
    "CODE": "410902",
    "NAME": "华龙区"
  },
  {
    "ID": "1759",
    "PARENT_ID": "1756",
    "CODE": "410922",
    "NAME": "清丰县"
  },
  {
    "ID": "176",
    "PARENT_ID": "158",
    "CODE": "130733",
    "NAME": "崇礼县"
  },
  {
    "ID": "1760",
    "PARENT_ID": "1756",
    "CODE": "410923",
    "NAME": "南乐县"
  },
  {
    "ID": "1761",
    "PARENT_ID": "1756",
    "CODE": "410926",
    "NAME": "范县"
  },
  {
    "ID": "1762",
    "PARENT_ID": "1756",
    "CODE": "410927",
    "NAME": "台前县"
  },
  {
    "ID": "1763",
    "PARENT_ID": "1756",
    "CODE": "410928",
    "NAME": "濮阳县"
  },
  {
    "ID": "1764",
    "PARENT_ID": "1656",
    "CODE": "411000",
    "NAME": "许昌市"
  },
  {
    "ID": "1765",
    "PARENT_ID": "1764",
    "CODE": "411001",
    "NAME": "市辖区"
  },
  {
    "ID": "1766",
    "PARENT_ID": "1764",
    "CODE": "411002",
    "NAME": "魏都区"
  },
  {
    "ID": "1767",
    "PARENT_ID": "1764",
    "CODE": "411023",
    "NAME": "许昌县"
  },
  {
    "ID": "1768",
    "PARENT_ID": "1764",
    "CODE": "411024",
    "NAME": "鄢陵县"
  },
  {
    "ID": "1769",
    "PARENT_ID": "1764",
    "CODE": "411025",
    "NAME": "襄城县"
  },
  {
    "ID": "177",
    "PARENT_ID": "39",
    "CODE": "130800",
    "NAME": "承德市"
  },
  {
    "ID": "1770",
    "PARENT_ID": "1764",
    "CODE": "411081",
    "NAME": "禹州市"
  },
  {
    "ID": "1771",
    "PARENT_ID": "1764",
    "CODE": "411082",
    "NAME": "长葛市"
  },
  {
    "ID": "1772",
    "PARENT_ID": "1656",
    "CODE": "411100",
    "NAME": "漯河市"
  },
  {
    "ID": "1773",
    "PARENT_ID": "1772",
    "CODE": "411101",
    "NAME": "市辖区"
  },
  {
    "ID": "1774",
    "PARENT_ID": "1772",
    "CODE": "411102",
    "NAME": "源汇区"
  },
  {
    "ID": "1775",
    "PARENT_ID": "1772",
    "CODE": "411103",
    "NAME": "郾城区"
  },
  {
    "ID": "1776",
    "PARENT_ID": "1772",
    "CODE": "411104",
    "NAME": "召陵区"
  },
  {
    "ID": "1777",
    "PARENT_ID": "1772",
    "CODE": "411121",
    "NAME": "舞阳县"
  },
  {
    "ID": "1778",
    "PARENT_ID": "1772",
    "CODE": "411122",
    "NAME": "临颍县"
  },
  {
    "ID": "1779",
    "PARENT_ID": "1656",
    "CODE": "411200",
    "NAME": "三门峡市"
  },
  {
    "ID": "178",
    "PARENT_ID": "177",
    "CODE": "130801",
    "NAME": "市辖区"
  },
  {
    "ID": "1780",
    "PARENT_ID": "1779",
    "CODE": "411201",
    "NAME": "市辖区"
  },
  {
    "ID": "1781",
    "PARENT_ID": "1779",
    "CODE": "411202",
    "NAME": "湖滨区"
  },
  {
    "ID": "1782",
    "PARENT_ID": "1779",
    "CODE": "411221",
    "NAME": "渑池县"
  },
  {
    "ID": "1783",
    "PARENT_ID": "1779",
    "CODE": "411222",
    "NAME": "陕县"
  },
  {
    "ID": "1784",
    "PARENT_ID": "1779",
    "CODE": "411224",
    "NAME": "卢氏县"
  },
  {
    "ID": "1785",
    "PARENT_ID": "1779",
    "CODE": "411281",
    "NAME": "义马市"
  },
  {
    "ID": "1786",
    "PARENT_ID": "1779",
    "CODE": "411282",
    "NAME": "灵宝市"
  },
  {
    "ID": "1787",
    "PARENT_ID": "1656",
    "CODE": "411300",
    "NAME": "南阳市"
  },
  {
    "ID": "1788",
    "PARENT_ID": "1787",
    "CODE": "411301",
    "NAME": "市辖区"
  },
  {
    "ID": "1789",
    "PARENT_ID": "1787",
    "CODE": "411302",
    "NAME": "宛城区"
  },
  {
    "ID": "179",
    "PARENT_ID": "177",
    "CODE": "130802",
    "NAME": "双桥区"
  },
  {
    "ID": "1790",
    "PARENT_ID": "1787",
    "CODE": "411303",
    "NAME": "卧龙区"
  },
  {
    "ID": "1791",
    "PARENT_ID": "1787",
    "CODE": "411321",
    "NAME": "南召县"
  },
  {
    "ID": "1792",
    "PARENT_ID": "1787",
    "CODE": "411322",
    "NAME": "方城县"
  },
  {
    "ID": "1793",
    "PARENT_ID": "1787",
    "CODE": "411323",
    "NAME": "西峡县"
  },
  {
    "ID": "1794",
    "PARENT_ID": "1787",
    "CODE": "411324",
    "NAME": "镇平县"
  },
  {
    "ID": "1795",
    "PARENT_ID": "1787",
    "CODE": "411325",
    "NAME": "内乡县"
  },
  {
    "ID": "1796",
    "PARENT_ID": "1787",
    "CODE": "411326",
    "NAME": "淅川县"
  },
  {
    "ID": "1797",
    "PARENT_ID": "1787",
    "CODE": "411327",
    "NAME": "社旗县"
  },
  {
    "ID": "1798",
    "PARENT_ID": "1787",
    "CODE": "411328",
    "NAME": "唐河县"
  },
  {
    "ID": "1799",
    "PARENT_ID": "1787",
    "CODE": "411329",
    "NAME": "新野县"
  },
  {
    "ID": "18",
    "PARENT_ID": "17",
    "CODE": "110228",
    "NAME": "密云县"
  },
  {
    "ID": "180",
    "PARENT_ID": "177",
    "CODE": "130803",
    "NAME": "双滦区"
  },
  {
    "ID": "1800",
    "PARENT_ID": "1787",
    "CODE": "411330",
    "NAME": "桐柏县"
  },
  {
    "ID": "1801",
    "PARENT_ID": "1787",
    "CODE": "411381",
    "NAME": "邓州市"
  },
  {
    "ID": "1802",
    "PARENT_ID": "1656",
    "CODE": "411400",
    "NAME": "商丘市"
  },
  {
    "ID": "1803",
    "PARENT_ID": "1802",
    "CODE": "411401",
    "NAME": "市辖区"
  },
  {
    "ID": "1804",
    "PARENT_ID": "1802",
    "CODE": "411402",
    "NAME": "梁园区"
  },
  {
    "ID": "1805",
    "PARENT_ID": "1802",
    "CODE": "411403",
    "NAME": "睢阳区"
  },
  {
    "ID": "1806",
    "PARENT_ID": "1802",
    "CODE": "411421",
    "NAME": "民权县"
  },
  {
    "ID": "1807",
    "PARENT_ID": "1802",
    "CODE": "411422",
    "NAME": "睢县"
  },
  {
    "ID": "1808",
    "PARENT_ID": "1802",
    "CODE": "411423",
    "NAME": "宁陵县"
  },
  {
    "ID": "1809",
    "PARENT_ID": "1802",
    "CODE": "411424",
    "NAME": "柘城县"
  },
  {
    "ID": "181",
    "PARENT_ID": "177",
    "CODE": "130804",
    "NAME": "鹰手营子矿区"
  },
  {
    "ID": "1810",
    "PARENT_ID": "1802",
    "CODE": "411425",
    "NAME": "虞城县"
  },
  {
    "ID": "1811",
    "PARENT_ID": "1802",
    "CODE": "411426",
    "NAME": "夏邑县"
  },
  {
    "ID": "1812",
    "PARENT_ID": "1802",
    "CODE": "411481",
    "NAME": "永城市"
  },
  {
    "ID": "1813",
    "PARENT_ID": "1656",
    "CODE": "411500",
    "NAME": "信阳市"
  },
  {
    "ID": "1814",
    "PARENT_ID": "1813",
    "CODE": "411501",
    "NAME": "市辖区"
  },
  {
    "ID": "1815",
    "PARENT_ID": "1813",
    "CODE": "411502",
    "NAME": "浉河区"
  },
  {
    "ID": "1816",
    "PARENT_ID": "1813",
    "CODE": "411503",
    "NAME": "平桥区"
  },
  {
    "ID": "1817",
    "PARENT_ID": "1813",
    "CODE": "411521",
    "NAME": "罗山县"
  },
  {
    "ID": "1818",
    "PARENT_ID": "1813",
    "CODE": "411522",
    "NAME": "光山县"
  },
  {
    "ID": "1819",
    "PARENT_ID": "1813",
    "CODE": "411523",
    "NAME": "新县"
  },
  {
    "ID": "182",
    "PARENT_ID": "177",
    "CODE": "130821",
    "NAME": "承德县"
  },
  {
    "ID": "1820",
    "PARENT_ID": "1813",
    "CODE": "411524",
    "NAME": "商城县"
  },
  {
    "ID": "1821",
    "PARENT_ID": "1813",
    "CODE": "411525",
    "NAME": "固始县"
  },
  {
    "ID": "1822",
    "PARENT_ID": "1813",
    "CODE": "411526",
    "NAME": "潢川县"
  },
  {
    "ID": "1823",
    "PARENT_ID": "1813",
    "CODE": "411527",
    "NAME": "淮滨县"
  },
  {
    "ID": "1824",
    "PARENT_ID": "1813",
    "CODE": "411528",
    "NAME": "息县"
  },
  {
    "ID": "1825",
    "PARENT_ID": "1656",
    "CODE": "411600",
    "NAME": "周口市"
  },
  {
    "ID": "1826",
    "PARENT_ID": "1825",
    "CODE": "411601",
    "NAME": "市辖区"
  },
  {
    "ID": "1827",
    "PARENT_ID": "1825",
    "CODE": "411602",
    "NAME": "川汇区"
  },
  {
    "ID": "1828",
    "PARENT_ID": "1825",
    "CODE": "411621",
    "NAME": "扶沟县"
  },
  {
    "ID": "1829",
    "PARENT_ID": "1825",
    "CODE": "411622",
    "NAME": "西华县"
  },
  {
    "ID": "183",
    "PARENT_ID": "177",
    "CODE": "130822",
    "NAME": "兴隆县"
  },
  {
    "ID": "1830",
    "PARENT_ID": "1825",
    "CODE": "411623",
    "NAME": "商水县"
  },
  {
    "ID": "1831",
    "PARENT_ID": "1825",
    "CODE": "411624",
    "NAME": "沈丘县"
  },
  {
    "ID": "1832",
    "PARENT_ID": "1825",
    "CODE": "411625",
    "NAME": "郸城县"
  },
  {
    "ID": "1833",
    "PARENT_ID": "1825",
    "CODE": "411626",
    "NAME": "淮阳县"
  },
  {
    "ID": "1834",
    "PARENT_ID": "1825",
    "CODE": "411627",
    "NAME": "太康县"
  },
  {
    "ID": "1835",
    "PARENT_ID": "1825",
    "CODE": "411628",
    "NAME": "鹿邑县"
  },
  {
    "ID": "1836",
    "PARENT_ID": "1825",
    "CODE": "411681",
    "NAME": "项城市"
  },
  {
    "ID": "1837",
    "PARENT_ID": "1656",
    "CODE": "411700",
    "NAME": "驻马店市"
  },
  {
    "ID": "1838",
    "PARENT_ID": "1837",
    "CODE": "411701",
    "NAME": "市辖区"
  },
  {
    "ID": "1839",
    "PARENT_ID": "1837",
    "CODE": "411702",
    "NAME": "驿城区"
  },
  {
    "ID": "184",
    "PARENT_ID": "177",
    "CODE": "130823",
    "NAME": "平泉县"
  },
  {
    "ID": "1840",
    "PARENT_ID": "1837",
    "CODE": "411721",
    "NAME": "西平县"
  },
  {
    "ID": "1841",
    "PARENT_ID": "1837",
    "CODE": "411722",
    "NAME": "上蔡县"
  },
  {
    "ID": "1842",
    "PARENT_ID": "1837",
    "CODE": "411723",
    "NAME": "平舆县"
  },
  {
    "ID": "1843",
    "PARENT_ID": "1837",
    "CODE": "411724",
    "NAME": "正阳县"
  },
  {
    "ID": "1844",
    "PARENT_ID": "1837",
    "CODE": "411725",
    "NAME": "确山县"
  },
  {
    "ID": "1845",
    "PARENT_ID": "1837",
    "CODE": "411726",
    "NAME": "泌阳县"
  },
  {
    "ID": "1846",
    "PARENT_ID": "1837",
    "CODE": "411727",
    "NAME": "汝南县"
  },
  {
    "ID": "1847",
    "PARENT_ID": "1837",
    "CODE": "411728",
    "NAME": "遂平县"
  },
  {
    "ID": "1848",
    "PARENT_ID": "1837",
    "CODE": "411729",
    "NAME": "新蔡县"
  },
  {
    "ID": "1849",
    "PARENT_ID": "1656",
    "CODE": "419000",
    "NAME": "省直辖县级行政区划"
  },
  {
    "ID": "185",
    "PARENT_ID": "177",
    "CODE": "130824",
    "NAME": "滦平县"
  },
  {
    "ID": "1850",
    "PARENT_ID": "1849",
    "CODE": "419001",
    "NAME": "济源市"
  },
  {
    "ID": "1851",
    "PARENT_ID": "0",
    "CODE": "420000",
    "NAME": "湖北省"
  },
  {
    "ID": "1852",
    "PARENT_ID": "1851",
    "CODE": "420100",
    "NAME": "武汉市"
  },
  {
    "ID": "1853",
    "PARENT_ID": "1852",
    "CODE": "420101",
    "NAME": "市辖区"
  },
  {
    "ID": "1854",
    "PARENT_ID": "1852",
    "CODE": "420102",
    "NAME": "江岸区"
  },
  {
    "ID": "1855",
    "PARENT_ID": "1852",
    "CODE": "420103",
    "NAME": "江汉区"
  },
  {
    "ID": "1856",
    "PARENT_ID": "1852",
    "CODE": "420104",
    "NAME": "硚口区"
  },
  {
    "ID": "1857",
    "PARENT_ID": "1852",
    "CODE": "420105",
    "NAME": "汉阳区"
  },
  {
    "ID": "1858",
    "PARENT_ID": "1852",
    "CODE": "420106",
    "NAME": "武昌区"
  },
  {
    "ID": "1859",
    "PARENT_ID": "1852",
    "CODE": "420107",
    "NAME": "青山区"
  },
  {
    "ID": "186",
    "PARENT_ID": "177",
    "CODE": "130825",
    "NAME": "隆化县"
  },
  {
    "ID": "1860",
    "PARENT_ID": "1852",
    "CODE": "420111",
    "NAME": "洪山区"
  },
  {
    "ID": "1861",
    "PARENT_ID": "1852",
    "CODE": "420112",
    "NAME": "东西湖区"
  },
  {
    "ID": "1862",
    "PARENT_ID": "1852",
    "CODE": "420113",
    "NAME": "汉南区"
  },
  {
    "ID": "1863",
    "PARENT_ID": "1852",
    "CODE": "420114",
    "NAME": "蔡甸区"
  },
  {
    "ID": "1864",
    "PARENT_ID": "1852",
    "CODE": "420115",
    "NAME": "江夏区"
  },
  {
    "ID": "1865",
    "PARENT_ID": "1852",
    "CODE": "420116",
    "NAME": "黄陂区"
  },
  {
    "ID": "1866",
    "PARENT_ID": "1852",
    "CODE": "420117",
    "NAME": "新洲区"
  },
  {
    "ID": "1867",
    "PARENT_ID": "1851",
    "CODE": "420200",
    "NAME": "黄石市"
  },
  {
    "ID": "1868",
    "PARENT_ID": "1867",
    "CODE": "420201",
    "NAME": "市辖区"
  },
  {
    "ID": "1869",
    "PARENT_ID": "1867",
    "CODE": "420202",
    "NAME": "黄石港区"
  },
  {
    "ID": "187",
    "PARENT_ID": "177",
    "CODE": "130826",
    "NAME": "丰宁满族自治县"
  },
  {
    "ID": "1870",
    "PARENT_ID": "1867",
    "CODE": "420203",
    "NAME": "西塞山区"
  },
  {
    "ID": "1871",
    "PARENT_ID": "1867",
    "CODE": "420204",
    "NAME": "下陆区"
  },
  {
    "ID": "1872",
    "PARENT_ID": "1867",
    "CODE": "420205",
    "NAME": "铁山区"
  },
  {
    "ID": "1873",
    "PARENT_ID": "1867",
    "CODE": "420222",
    "NAME": "阳新县"
  },
  {
    "ID": "1874",
    "PARENT_ID": "1867",
    "CODE": "420281",
    "NAME": "大冶市"
  },
  {
    "ID": "1875",
    "PARENT_ID": "1851",
    "CODE": "420300",
    "NAME": "十堰市"
  },
  {
    "ID": "1876",
    "PARENT_ID": "1875",
    "CODE": "420301",
    "NAME": "市辖区"
  },
  {
    "ID": "1877",
    "PARENT_ID": "1875",
    "CODE": "420302",
    "NAME": "茅箭区"
  },
  {
    "ID": "1878",
    "PARENT_ID": "1875",
    "CODE": "420303",
    "NAME": "张湾区"
  },
  {
    "ID": "1879",
    "PARENT_ID": "1875",
    "CODE": "420304",
    "NAME": "郧阳区"
  },
  {
    "ID": "188",
    "PARENT_ID": "177",
    "CODE": "130827",
    "NAME": "宽城满族自治县"
  },
  {
    "ID": "1880",
    "PARENT_ID": "1875",
    "CODE": "420322",
    "NAME": "郧西县"
  },
  {
    "ID": "1881",
    "PARENT_ID": "1875",
    "CODE": "420323",
    "NAME": "竹山县"
  },
  {
    "ID": "1882",
    "PARENT_ID": "1875",
    "CODE": "420324",
    "NAME": "竹溪县"
  },
  {
    "ID": "1883",
    "PARENT_ID": "1875",
    "CODE": "420325",
    "NAME": "房县"
  },
  {
    "ID": "1884",
    "PARENT_ID": "1875",
    "CODE": "420381",
    "NAME": "丹江口市"
  },
  {
    "ID": "1885",
    "PARENT_ID": "1851",
    "CODE": "420500",
    "NAME": "宜昌市"
  },
  {
    "ID": "1886",
    "PARENT_ID": "1885",
    "CODE": "420501",
    "NAME": "市辖区"
  },
  {
    "ID": "1887",
    "PARENT_ID": "1885",
    "CODE": "420502",
    "NAME": "西陵区"
  },
  {
    "ID": "1888",
    "PARENT_ID": "1885",
    "CODE": "420503",
    "NAME": "伍家岗区"
  },
  {
    "ID": "1889",
    "PARENT_ID": "1885",
    "CODE": "420504",
    "NAME": "点军区"
  },
  {
    "ID": "189",
    "PARENT_ID": "177",
    "CODE": "130828",
    "NAME": "围场满族蒙古族自治县"
  },
  {
    "ID": "1890",
    "PARENT_ID": "1885",
    "CODE": "420505",
    "NAME": "猇亭区"
  },
  {
    "ID": "1891",
    "PARENT_ID": "1885",
    "CODE": "420506",
    "NAME": "夷陵区"
  },
  {
    "ID": "1892",
    "PARENT_ID": "1885",
    "CODE": "420525",
    "NAME": "远安县"
  },
  {
    "ID": "1893",
    "PARENT_ID": "1885",
    "CODE": "420526",
    "NAME": "兴山县"
  },
  {
    "ID": "1894",
    "PARENT_ID": "1885",
    "CODE": "420527",
    "NAME": "秭归县"
  },
  {
    "ID": "1895",
    "PARENT_ID": "1885",
    "CODE": "420528",
    "NAME": "长阳土家族自治县"
  },
  {
    "ID": "1896",
    "PARENT_ID": "1885",
    "CODE": "420529",
    "NAME": "五峰土家族自治县"
  },
  {
    "ID": "1897",
    "PARENT_ID": "1885",
    "CODE": "420581",
    "NAME": "宜都市"
  },
  {
    "ID": "1898",
    "PARENT_ID": "1885",
    "CODE": "420582",
    "NAME": "当阳市"
  },
  {
    "ID": "1899",
    "PARENT_ID": "1885",
    "CODE": "420583",
    "NAME": "枝江市"
  },
  {
    "ID": "19",
    "PARENT_ID": "17",
    "CODE": "110229",
    "NAME": "延庆县"
  },
  {
    "ID": "190",
    "PARENT_ID": "39",
    "CODE": "130900",
    "NAME": "沧州市"
  },
  {
    "ID": "1900",
    "PARENT_ID": "1851",
    "CODE": "420600",
    "NAME": "襄阳市"
  },
  {
    "ID": "1901",
    "PARENT_ID": "1900",
    "CODE": "420601",
    "NAME": "市辖区"
  },
  {
    "ID": "1902",
    "PARENT_ID": "1900",
    "CODE": "420602",
    "NAME": "襄城区"
  },
  {
    "ID": "1903",
    "PARENT_ID": "1900",
    "CODE": "420606",
    "NAME": "樊城区"
  },
  {
    "ID": "1904",
    "PARENT_ID": "1900",
    "CODE": "420607",
    "NAME": "襄州区"
  },
  {
    "ID": "1905",
    "PARENT_ID": "1900",
    "CODE": "420624",
    "NAME": "南漳县"
  },
  {
    "ID": "1906",
    "PARENT_ID": "1900",
    "CODE": "420625",
    "NAME": "谷城县"
  },
  {
    "ID": "1907",
    "PARENT_ID": "1900",
    "CODE": "420626",
    "NAME": "保康县"
  },
  {
    "ID": "1908",
    "PARENT_ID": "1900",
    "CODE": "420682",
    "NAME": "老河口市"
  },
  {
    "ID": "1909",
    "PARENT_ID": "1900",
    "CODE": "420683",
    "NAME": "枣阳市"
  },
  {
    "ID": "191",
    "PARENT_ID": "190",
    "CODE": "130901",
    "NAME": "市辖区"
  },
  {
    "ID": "1910",
    "PARENT_ID": "1900",
    "CODE": "420684",
    "NAME": "宜城市"
  },
  {
    "ID": "1911",
    "PARENT_ID": "1851",
    "CODE": "420700",
    "NAME": "鄂州市"
  },
  {
    "ID": "1912",
    "PARENT_ID": "1911",
    "CODE": "420701",
    "NAME": "市辖区"
  },
  {
    "ID": "1913",
    "PARENT_ID": "1911",
    "CODE": "420702",
    "NAME": "梁子湖区"
  },
  {
    "ID": "1914",
    "PARENT_ID": "1911",
    "CODE": "420703",
    "NAME": "华容区"
  },
  {
    "ID": "1915",
    "PARENT_ID": "1911",
    "CODE": "420704",
    "NAME": "鄂城区"
  },
  {
    "ID": "1916",
    "PARENT_ID": "1851",
    "CODE": "420800",
    "NAME": "荆门市"
  },
  {
    "ID": "1917",
    "PARENT_ID": "1916",
    "CODE": "420801",
    "NAME": "市辖区"
  },
  {
    "ID": "1918",
    "PARENT_ID": "1916",
    "CODE": "420802",
    "NAME": "东宝区"
  },
  {
    "ID": "1919",
    "PARENT_ID": "1916",
    "CODE": "420804",
    "NAME": "掇刀区"
  },
  {
    "ID": "192",
    "PARENT_ID": "190",
    "CODE": "130902",
    "NAME": "新华区"
  },
  {
    "ID": "1920",
    "PARENT_ID": "1916",
    "CODE": "420821",
    "NAME": "京山县"
  },
  {
    "ID": "1921",
    "PARENT_ID": "1916",
    "CODE": "420822",
    "NAME": "沙洋县"
  },
  {
    "ID": "1922",
    "PARENT_ID": "1916",
    "CODE": "420881",
    "NAME": "钟祥市"
  },
  {
    "ID": "1923",
    "PARENT_ID": "1851",
    "CODE": "420900",
    "NAME": "孝感市"
  },
  {
    "ID": "1924",
    "PARENT_ID": "1923",
    "CODE": "420901",
    "NAME": "市辖区"
  },
  {
    "ID": "1925",
    "PARENT_ID": "1923",
    "CODE": "420902",
    "NAME": "孝南区"
  },
  {
    "ID": "1926",
    "PARENT_ID": "1923",
    "CODE": "420921",
    "NAME": "孝昌县"
  },
  {
    "ID": "1927",
    "PARENT_ID": "1923",
    "CODE": "420922",
    "NAME": "大悟县"
  },
  {
    "ID": "1928",
    "PARENT_ID": "1923",
    "CODE": "420923",
    "NAME": "云梦县"
  },
  {
    "ID": "1929",
    "PARENT_ID": "1923",
    "CODE": "420981",
    "NAME": "应城市"
  },
  {
    "ID": "193",
    "PARENT_ID": "190",
    "CODE": "130903",
    "NAME": "运河区"
  },
  {
    "ID": "1930",
    "PARENT_ID": "1923",
    "CODE": "420982",
    "NAME": "安陆市"
  },
  {
    "ID": "1931",
    "PARENT_ID": "1923",
    "CODE": "420984",
    "NAME": "汉川市"
  },
  {
    "ID": "1932",
    "PARENT_ID": "1851",
    "CODE": "421000",
    "NAME": "荆州市"
  },
  {
    "ID": "1933",
    "PARENT_ID": "1932",
    "CODE": "421001",
    "NAME": "市辖区"
  },
  {
    "ID": "1934",
    "PARENT_ID": "1932",
    "CODE": "421002",
    "NAME": "沙市区"
  },
  {
    "ID": "1935",
    "PARENT_ID": "1932",
    "CODE": "421003",
    "NAME": "荆州区"
  },
  {
    "ID": "1936",
    "PARENT_ID": "1932",
    "CODE": "421022",
    "NAME": "公安县"
  },
  {
    "ID": "1937",
    "PARENT_ID": "1932",
    "CODE": "421023",
    "NAME": "监利县"
  },
  {
    "ID": "1938",
    "PARENT_ID": "1932",
    "CODE": "421024",
    "NAME": "江陵县"
  },
  {
    "ID": "1939",
    "PARENT_ID": "1932",
    "CODE": "421081",
    "NAME": "石首市"
  },
  {
    "ID": "194",
    "PARENT_ID": "190",
    "CODE": "130921",
    "NAME": "沧县"
  },
  {
    "ID": "1940",
    "PARENT_ID": "1932",
    "CODE": "421083",
    "NAME": "洪湖市"
  },
  {
    "ID": "1941",
    "PARENT_ID": "1932",
    "CODE": "421087",
    "NAME": "松滋市"
  },
  {
    "ID": "1942",
    "PARENT_ID": "1851",
    "CODE": "421100",
    "NAME": "黄冈市"
  },
  {
    "ID": "1943",
    "PARENT_ID": "1942",
    "CODE": "421101",
    "NAME": "市辖区"
  },
  {
    "ID": "1944",
    "PARENT_ID": "1942",
    "CODE": "421102",
    "NAME": "黄州区"
  },
  {
    "ID": "1945",
    "PARENT_ID": "1942",
    "CODE": "421121",
    "NAME": "团风县"
  },
  {
    "ID": "1946",
    "PARENT_ID": "1942",
    "CODE": "421122",
    "NAME": "红安县"
  },
  {
    "ID": "1947",
    "PARENT_ID": "1942",
    "CODE": "421123",
    "NAME": "罗田县"
  },
  {
    "ID": "1948",
    "PARENT_ID": "1942",
    "CODE": "421124",
    "NAME": "英山县"
  },
  {
    "ID": "1949",
    "PARENT_ID": "1942",
    "CODE": "421125",
    "NAME": "浠水县"
  },
  {
    "ID": "195",
    "PARENT_ID": "190",
    "CODE": "130922",
    "NAME": "青县"
  },
  {
    "ID": "1950",
    "PARENT_ID": "1942",
    "CODE": "421126",
    "NAME": "蕲春县"
  },
  {
    "ID": "1951",
    "PARENT_ID": "1942",
    "CODE": "421127",
    "NAME": "黄梅县"
  },
  {
    "ID": "1952",
    "PARENT_ID": "1942",
    "CODE": "421181",
    "NAME": "麻城市"
  },
  {
    "ID": "1953",
    "PARENT_ID": "1942",
    "CODE": "421182",
    "NAME": "武穴市"
  },
  {
    "ID": "1954",
    "PARENT_ID": "1851",
    "CODE": "421200",
    "NAME": "咸宁市"
  },
  {
    "ID": "1955",
    "PARENT_ID": "1954",
    "CODE": "421201",
    "NAME": "市辖区"
  },
  {
    "ID": "1956",
    "PARENT_ID": "1954",
    "CODE": "421202",
    "NAME": "咸安区"
  },
  {
    "ID": "1957",
    "PARENT_ID": "1954",
    "CODE": "421221",
    "NAME": "嘉鱼县"
  },
  {
    "ID": "1958",
    "PARENT_ID": "1954",
    "CODE": "421222",
    "NAME": "通城县"
  },
  {
    "ID": "1959",
    "PARENT_ID": "1954",
    "CODE": "421223",
    "NAME": "崇阳县"
  },
  {
    "ID": "196",
    "PARENT_ID": "190",
    "CODE": "130923",
    "NAME": "东光县"
  },
  {
    "ID": "1960",
    "PARENT_ID": "1954",
    "CODE": "421224",
    "NAME": "通山县"
  },
  {
    "ID": "1961",
    "PARENT_ID": "1954",
    "CODE": "421281",
    "NAME": "赤壁市"
  },
  {
    "ID": "1962",
    "PARENT_ID": "1851",
    "CODE": "421300",
    "NAME": "随州市"
  },
  {
    "ID": "1963",
    "PARENT_ID": "1962",
    "CODE": "421301",
    "NAME": "市辖区"
  },
  {
    "ID": "1964",
    "PARENT_ID": "1962",
    "CODE": "421303",
    "NAME": "曾都区"
  },
  {
    "ID": "1965",
    "PARENT_ID": "1962",
    "CODE": "421321",
    "NAME": "随县"
  },
  {
    "ID": "1966",
    "PARENT_ID": "1962",
    "CODE": "421381",
    "NAME": "广水市"
  },
  {
    "ID": "1967",
    "PARENT_ID": "1851",
    "CODE": "422800",
    "NAME": "恩施土家族苗族自治州"
  },
  {
    "ID": "1968",
    "PARENT_ID": "1967",
    "CODE": "422801",
    "NAME": "恩施市"
  },
  {
    "ID": "1969",
    "PARENT_ID": "1967",
    "CODE": "422802",
    "NAME": "利川市"
  },
  {
    "ID": "197",
    "PARENT_ID": "190",
    "CODE": "130924",
    "NAME": "海兴县"
  },
  {
    "ID": "1970",
    "PARENT_ID": "1967",
    "CODE": "422822",
    "NAME": "建始县"
  },
  {
    "ID": "1971",
    "PARENT_ID": "1967",
    "CODE": "422823",
    "NAME": "巴东县"
  },
  {
    "ID": "1972",
    "PARENT_ID": "1967",
    "CODE": "422825",
    "NAME": "宣恩县"
  },
  {
    "ID": "1973",
    "PARENT_ID": "1967",
    "CODE": "422826",
    "NAME": "咸丰县"
  },
  {
    "ID": "1974",
    "PARENT_ID": "1967",
    "CODE": "422827",
    "NAME": "来凤县"
  },
  {
    "ID": "1975",
    "PARENT_ID": "1967",
    "CODE": "422828",
    "NAME": "鹤峰县"
  },
  {
    "ID": "1976",
    "PARENT_ID": "1851",
    "CODE": "429000",
    "NAME": "省直辖县级行政区划"
  },
  {
    "ID": "1977",
    "PARENT_ID": "1976",
    "CODE": "429004",
    "NAME": "仙桃市"
  },
  {
    "ID": "1978",
    "PARENT_ID": "1976",
    "CODE": "429005",
    "NAME": "潜江市"
  },
  {
    "ID": "1979",
    "PARENT_ID": "1976",
    "CODE": "429006",
    "NAME": "天门市"
  },
  {
    "ID": "198",
    "PARENT_ID": "190",
    "CODE": "130925",
    "NAME": "盐山县"
  },
  {
    "ID": "1980",
    "PARENT_ID": "1976",
    "CODE": "429021",
    "NAME": "神农架林区"
  },
  {
    "ID": "1981",
    "PARENT_ID": "0",
    "CODE": "430000",
    "NAME": "湖南省"
  },
  {
    "ID": "1982",
    "PARENT_ID": "1981",
    "CODE": "430100",
    "NAME": "长沙市"
  },
  {
    "ID": "1983",
    "PARENT_ID": "1982",
    "CODE": "430101",
    "NAME": "市辖区"
  },
  {
    "ID": "1984",
    "PARENT_ID": "1982",
    "CODE": "430102",
    "NAME": "芙蓉区"
  },
  {
    "ID": "1985",
    "PARENT_ID": "1982",
    "CODE": "430103",
    "NAME": "天心区"
  },
  {
    "ID": "1986",
    "PARENT_ID": "1982",
    "CODE": "430104",
    "NAME": "岳麓区"
  },
  {
    "ID": "1987",
    "PARENT_ID": "1982",
    "CODE": "430105",
    "NAME": "开福区"
  },
  {
    "ID": "1988",
    "PARENT_ID": "1982",
    "CODE": "430111",
    "NAME": "雨花区"
  },
  {
    "ID": "1989",
    "PARENT_ID": "1982",
    "CODE": "430112",
    "NAME": "望城区"
  },
  {
    "ID": "199",
    "PARENT_ID": "190",
    "CODE": "130926",
    "NAME": "肃宁县"
  },
  {
    "ID": "1990",
    "PARENT_ID": "1982",
    "CODE": "430121",
    "NAME": "长沙县"
  },
  {
    "ID": "1991",
    "PARENT_ID": "1982",
    "CODE": "430124",
    "NAME": "宁乡县"
  },
  {
    "ID": "1992",
    "PARENT_ID": "1982",
    "CODE": "430181",
    "NAME": "浏阳市"
  },
  {
    "ID": "1993",
    "PARENT_ID": "1981",
    "CODE": "430200",
    "NAME": "株洲市"
  },
  {
    "ID": "1994",
    "PARENT_ID": "1993",
    "CODE": "430201",
    "NAME": "市辖区"
  },
  {
    "ID": "1995",
    "PARENT_ID": "1993",
    "CODE": "430202",
    "NAME": "荷塘区"
  },
  {
    "ID": "1996",
    "PARENT_ID": "1993",
    "CODE": "430203",
    "NAME": "芦淞区"
  },
  {
    "ID": "1997",
    "PARENT_ID": "1993",
    "CODE": "430204",
    "NAME": "石峰区"
  },
  {
    "ID": "1998",
    "PARENT_ID": "1993",
    "CODE": "430211",
    "NAME": "天元区"
  },
  {
    "ID": "1999",
    "PARENT_ID": "1993",
    "CODE": "430221",
    "NAME": "株洲县"
  },
  {
    "ID": "2",
    "PARENT_ID": "1",
    "CODE": "110100",
    "NAME": "市辖区(北京)"
  },
  {
    "ID": "20",
    "PARENT_ID": "0",
    "CODE": "120000",
    "NAME": "天津市"
  },
  {
    "ID": "200",
    "PARENT_ID": "190",
    "CODE": "130927",
    "NAME": "南皮县"
  },
  {
    "ID": "2000",
    "PARENT_ID": "1993",
    "CODE": "430223",
    "NAME": "攸县"
  },
  {
    "ID": "2001",
    "PARENT_ID": "1993",
    "CODE": "430224",
    "NAME": "茶陵县"
  },
  {
    "ID": "2002",
    "PARENT_ID": "1993",
    "CODE": "430225",
    "NAME": "炎陵县"
  },
  {
    "ID": "2003",
    "PARENT_ID": "1993",
    "CODE": "430281",
    "NAME": "醴陵市"
  },
  {
    "ID": "2004",
    "PARENT_ID": "1981",
    "CODE": "430300",
    "NAME": "湘潭市"
  },
  {
    "ID": "2005",
    "PARENT_ID": "2004",
    "CODE": "430301",
    "NAME": "市辖区"
  },
  {
    "ID": "2006",
    "PARENT_ID": "2004",
    "CODE": "430302",
    "NAME": "雨湖区"
  },
  {
    "ID": "2007",
    "PARENT_ID": "2004",
    "CODE": "430304",
    "NAME": "岳塘区"
  },
  {
    "ID": "2008",
    "PARENT_ID": "2004",
    "CODE": "430321",
    "NAME": "湘潭县"
  },
  {
    "ID": "2009",
    "PARENT_ID": "2004",
    "CODE": "430381",
    "NAME": "湘乡市"
  },
  {
    "ID": "201",
    "PARENT_ID": "190",
    "CODE": "130928",
    "NAME": "吴桥县"
  },
  {
    "ID": "2010",
    "PARENT_ID": "2004",
    "CODE": "430382",
    "NAME": "韶山市"
  },
  {
    "ID": "2011",
    "PARENT_ID": "1981",
    "CODE": "430400",
    "NAME": "衡阳市"
  },
  {
    "ID": "2012",
    "PARENT_ID": "2011",
    "CODE": "430401",
    "NAME": "市辖区"
  },
  {
    "ID": "2013",
    "PARENT_ID": "2011",
    "CODE": "430405",
    "NAME": "珠晖区"
  },
  {
    "ID": "2014",
    "PARENT_ID": "2011",
    "CODE": "430406",
    "NAME": "雁峰区"
  },
  {
    "ID": "2015",
    "PARENT_ID": "2011",
    "CODE": "430407",
    "NAME": "石鼓区"
  },
  {
    "ID": "2016",
    "PARENT_ID": "2011",
    "CODE": "430408",
    "NAME": "蒸湘区"
  },
  {
    "ID": "2017",
    "PARENT_ID": "2011",
    "CODE": "430412",
    "NAME": "南岳区"
  },
  {
    "ID": "2018",
    "PARENT_ID": "2011",
    "CODE": "430421",
    "NAME": "衡阳县"
  },
  {
    "ID": "2019",
    "PARENT_ID": "2011",
    "CODE": "430422",
    "NAME": "衡南县"
  },
  {
    "ID": "202",
    "PARENT_ID": "190",
    "CODE": "130929",
    "NAME": "献县"
  },
  {
    "ID": "2020",
    "PARENT_ID": "2011",
    "CODE": "430423",
    "NAME": "衡山县"
  },
  {
    "ID": "2021",
    "PARENT_ID": "2011",
    "CODE": "430424",
    "NAME": "衡东县"
  },
  {
    "ID": "2022",
    "PARENT_ID": "2011",
    "CODE": "430426",
    "NAME": "祁东县"
  },
  {
    "ID": "2023",
    "PARENT_ID": "2011",
    "CODE": "430481",
    "NAME": "耒阳市"
  },
  {
    "ID": "2024",
    "PARENT_ID": "2011",
    "CODE": "430482",
    "NAME": "常宁市"
  },
  {
    "ID": "2025",
    "PARENT_ID": "1981",
    "CODE": "430500",
    "NAME": "邵阳市"
  },
  {
    "ID": "2026",
    "PARENT_ID": "2025",
    "CODE": "430501",
    "NAME": "市辖区"
  },
  {
    "ID": "2027",
    "PARENT_ID": "2025",
    "CODE": "430502",
    "NAME": "双清区"
  },
  {
    "ID": "2028",
    "PARENT_ID": "2025",
    "CODE": "430503",
    "NAME": "大祥区"
  },
  {
    "ID": "2029",
    "PARENT_ID": "2025",
    "CODE": "430511",
    "NAME": "北塔区"
  },
  {
    "ID": "203",
    "PARENT_ID": "190",
    "CODE": "130930",
    "NAME": "孟村回族自治县"
  },
  {
    "ID": "2030",
    "PARENT_ID": "2025",
    "CODE": "430521",
    "NAME": "邵东县"
  },
  {
    "ID": "2031",
    "PARENT_ID": "2025",
    "CODE": "430522",
    "NAME": "新邵县"
  },
  {
    "ID": "2032",
    "PARENT_ID": "2025",
    "CODE": "430523",
    "NAME": "邵阳县"
  },
  {
    "ID": "2033",
    "PARENT_ID": "2025",
    "CODE": "430524",
    "NAME": "隆回县"
  },
  {
    "ID": "2034",
    "PARENT_ID": "2025",
    "CODE": "430525",
    "NAME": "洞口县"
  },
  {
    "ID": "2035",
    "PARENT_ID": "2025",
    "CODE": "430527",
    "NAME": "绥宁县"
  },
  {
    "ID": "2036",
    "PARENT_ID": "2025",
    "CODE": "430528",
    "NAME": "新宁县"
  },
  {
    "ID": "2037",
    "PARENT_ID": "2025",
    "CODE": "430529",
    "NAME": "城步苗族自治县"
  },
  {
    "ID": "2038",
    "PARENT_ID": "2025",
    "CODE": "430581",
    "NAME": "武冈市"
  },
  {
    "ID": "2039",
    "PARENT_ID": "1981",
    "CODE": "430600",
    "NAME": "岳阳市"
  },
  {
    "ID": "204",
    "PARENT_ID": "190",
    "CODE": "130981",
    "NAME": "泊头市"
  },
  {
    "ID": "2040",
    "PARENT_ID": "2039",
    "CODE": "430601",
    "NAME": "市辖区"
  },
  {
    "ID": "2041",
    "PARENT_ID": "2039",
    "CODE": "430602",
    "NAME": "岳阳楼区"
  },
  {
    "ID": "2042",
    "PARENT_ID": "2039",
    "CODE": "430603",
    "NAME": "云溪区"
  },
  {
    "ID": "2043",
    "PARENT_ID": "2039",
    "CODE": "430611",
    "NAME": "君山区"
  },
  {
    "ID": "2044",
    "PARENT_ID": "2039",
    "CODE": "430621",
    "NAME": "岳阳县"
  },
  {
    "ID": "2045",
    "PARENT_ID": "2039",
    "CODE": "430623",
    "NAME": "华容县"
  },
  {
    "ID": "2046",
    "PARENT_ID": "2039",
    "CODE": "430624",
    "NAME": "湘阴县"
  },
  {
    "ID": "2047",
    "PARENT_ID": "2039",
    "CODE": "430626",
    "NAME": "平江县"
  },
  {
    "ID": "2048",
    "PARENT_ID": "2039",
    "CODE": "430681",
    "NAME": "汨罗市"
  },
  {
    "ID": "2049",
    "PARENT_ID": "2039",
    "CODE": "430682",
    "NAME": "临湘市"
  },
  {
    "ID": "205",
    "PARENT_ID": "190",
    "CODE": "130982",
    "NAME": "任丘市"
  },
  {
    "ID": "2050",
    "PARENT_ID": "1981",
    "CODE": "430700",
    "NAME": "常德市"
  },
  {
    "ID": "2051",
    "PARENT_ID": "2050",
    "CODE": "430701",
    "NAME": "市辖区"
  },
  {
    "ID": "2052",
    "PARENT_ID": "2050",
    "CODE": "430702",
    "NAME": "武陵区"
  },
  {
    "ID": "2053",
    "PARENT_ID": "2050",
    "CODE": "430703",
    "NAME": "鼎城区"
  },
  {
    "ID": "2054",
    "PARENT_ID": "2050",
    "CODE": "430721",
    "NAME": "安乡县"
  },
  {
    "ID": "2055",
    "PARENT_ID": "2050",
    "CODE": "430722",
    "NAME": "汉寿县"
  },
  {
    "ID": "2056",
    "PARENT_ID": "2050",
    "CODE": "430723",
    "NAME": "澧县"
  },
  {
    "ID": "2057",
    "PARENT_ID": "2050",
    "CODE": "430724",
    "NAME": "临澧县"
  },
  {
    "ID": "2058",
    "PARENT_ID": "2050",
    "CODE": "430725",
    "NAME": "桃源县"
  },
  {
    "ID": "2059",
    "PARENT_ID": "2050",
    "CODE": "430726",
    "NAME": "石门县"
  },
  {
    "ID": "206",
    "PARENT_ID": "190",
    "CODE": "130983",
    "NAME": "黄骅市"
  },
  {
    "ID": "2060",
    "PARENT_ID": "2050",
    "CODE": "430781",
    "NAME": "津市市"
  },
  {
    "ID": "2061",
    "PARENT_ID": "1981",
    "CODE": "430800",
    "NAME": "张家界市"
  },
  {
    "ID": "2062",
    "PARENT_ID": "2061",
    "CODE": "430801",
    "NAME": "市辖区"
  },
  {
    "ID": "2063",
    "PARENT_ID": "2061",
    "CODE": "430802",
    "NAME": "永定区"
  },
  {
    "ID": "2064",
    "PARENT_ID": "2061",
    "CODE": "430811",
    "NAME": "武陵源区"
  },
  {
    "ID": "2065",
    "PARENT_ID": "2061",
    "CODE": "430821",
    "NAME": "慈利县"
  },
  {
    "ID": "2066",
    "PARENT_ID": "2061",
    "CODE": "430822",
    "NAME": "桑植县"
  },
  {
    "ID": "2067",
    "PARENT_ID": "1981",
    "CODE": "430900",
    "NAME": "益阳市"
  },
  {
    "ID": "2068",
    "PARENT_ID": "2067",
    "CODE": "430901",
    "NAME": "市辖区"
  },
  {
    "ID": "2069",
    "PARENT_ID": "2067",
    "CODE": "430902",
    "NAME": "资阳区"
  },
  {
    "ID": "207",
    "PARENT_ID": "190",
    "CODE": "130984",
    "NAME": "河间市"
  },
  {
    "ID": "2070",
    "PARENT_ID": "2067",
    "CODE": "430903",
    "NAME": "赫山区"
  },
  {
    "ID": "2071",
    "PARENT_ID": "2067",
    "CODE": "430921",
    "NAME": "南县"
  },
  {
    "ID": "2072",
    "PARENT_ID": "2067",
    "CODE": "430922",
    "NAME": "桃江县"
  },
  {
    "ID": "2073",
    "PARENT_ID": "2067",
    "CODE": "430923",
    "NAME": "安化县"
  },
  {
    "ID": "2074",
    "PARENT_ID": "2067",
    "CODE": "430981",
    "NAME": "沅江市"
  },
  {
    "ID": "2075",
    "PARENT_ID": "1981",
    "CODE": "431000",
    "NAME": "郴州市"
  },
  {
    "ID": "2076",
    "PARENT_ID": "2075",
    "CODE": "431001",
    "NAME": "市辖区"
  },
  {
    "ID": "2077",
    "PARENT_ID": "2075",
    "CODE": "431002",
    "NAME": "北湖区"
  },
  {
    "ID": "2078",
    "PARENT_ID": "2075",
    "CODE": "431003",
    "NAME": "苏仙区"
  },
  {
    "ID": "2079",
    "PARENT_ID": "2075",
    "CODE": "431021",
    "NAME": "桂阳县"
  },
  {
    "ID": "208",
    "PARENT_ID": "39",
    "CODE": "131000",
    "NAME": "廊坊市"
  },
  {
    "ID": "2080",
    "PARENT_ID": "2075",
    "CODE": "431022",
    "NAME": "宜章县"
  },
  {
    "ID": "2081",
    "PARENT_ID": "2075",
    "CODE": "431023",
    "NAME": "永兴县"
  },
  {
    "ID": "2082",
    "PARENT_ID": "2075",
    "CODE": "431024",
    "NAME": "嘉禾县"
  },
  {
    "ID": "2083",
    "PARENT_ID": "2075",
    "CODE": "431025",
    "NAME": "临武县"
  },
  {
    "ID": "2084",
    "PARENT_ID": "2075",
    "CODE": "431026",
    "NAME": "汝城县"
  },
  {
    "ID": "2085",
    "PARENT_ID": "2075",
    "CODE": "431027",
    "NAME": "桂东县"
  },
  {
    "ID": "2086",
    "PARENT_ID": "2075",
    "CODE": "431028",
    "NAME": "安仁县"
  },
  {
    "ID": "2087",
    "PARENT_ID": "2075",
    "CODE": "431081",
    "NAME": "资兴市"
  },
  {
    "ID": "2088",
    "PARENT_ID": "1981",
    "CODE": "431100",
    "NAME": "永州市"
  },
  {
    "ID": "2089",
    "PARENT_ID": "2088",
    "CODE": "431101",
    "NAME": "市辖区"
  },
  {
    "ID": "209",
    "PARENT_ID": "208",
    "CODE": "131001",
    "NAME": "市辖区"
  },
  {
    "ID": "2090",
    "PARENT_ID": "2088",
    "CODE": "431102",
    "NAME": "零陵区"
  },
  {
    "ID": "2091",
    "PARENT_ID": "2088",
    "CODE": "431103",
    "NAME": "冷水滩区"
  },
  {
    "ID": "2092",
    "PARENT_ID": "2088",
    "CODE": "431121",
    "NAME": "祁阳县"
  },
  {
    "ID": "2093",
    "PARENT_ID": "2088",
    "CODE": "431122",
    "NAME": "东安县"
  },
  {
    "ID": "2094",
    "PARENT_ID": "2088",
    "CODE": "431123",
    "NAME": "双牌县"
  },
  {
    "ID": "2095",
    "PARENT_ID": "2088",
    "CODE": "431124",
    "NAME": "道县"
  },
  {
    "ID": "2096",
    "PARENT_ID": "2088",
    "CODE": "431125",
    "NAME": "江永县"
  },
  {
    "ID": "2097",
    "PARENT_ID": "2088",
    "CODE": "431126",
    "NAME": "宁远县"
  },
  {
    "ID": "2098",
    "PARENT_ID": "2088",
    "CODE": "431127",
    "NAME": "蓝山县"
  },
  {
    "ID": "2099",
    "PARENT_ID": "2088",
    "CODE": "431128",
    "NAME": "新田县"
  },
  {
    "ID": "21",
    "PARENT_ID": "20",
    "CODE": "120100",
    "NAME": "市辖区(天津)"
  },
  {
    "ID": "210",
    "PARENT_ID": "208",
    "CODE": "131002",
    "NAME": "安次区"
  },
  {
    "ID": "2100",
    "PARENT_ID": "2088",
    "CODE": "431129",
    "NAME": "江华瑶族自治县"
  },
  {
    "ID": "2101",
    "PARENT_ID": "1981",
    "CODE": "431200",
    "NAME": "怀化市"
  },
  {
    "ID": "2102",
    "PARENT_ID": "2101",
    "CODE": "431201",
    "NAME": "市辖区"
  },
  {
    "ID": "2103",
    "PARENT_ID": "2101",
    "CODE": "431202",
    "NAME": "鹤城区"
  },
  {
    "ID": "2104",
    "PARENT_ID": "2101",
    "CODE": "431221",
    "NAME": "中方县"
  },
  {
    "ID": "2105",
    "PARENT_ID": "2101",
    "CODE": "431222",
    "NAME": "沅陵县"
  },
  {
    "ID": "2106",
    "PARENT_ID": "2101",
    "CODE": "431223",
    "NAME": "辰溪县"
  },
  {
    "ID": "2107",
    "PARENT_ID": "2101",
    "CODE": "431224",
    "NAME": "溆浦县"
  },
  {
    "ID": "2108",
    "PARENT_ID": "2101",
    "CODE": "431225",
    "NAME": "会同县"
  },
  {
    "ID": "2109",
    "PARENT_ID": "2101",
    "CODE": "431226",
    "NAME": "麻阳苗族自治县"
  },
  {
    "ID": "211",
    "PARENT_ID": "208",
    "CODE": "131003",
    "NAME": "广阳区"
  },
  {
    "ID": "2110",
    "PARENT_ID": "2101",
    "CODE": "431227",
    "NAME": "新晃侗族自治县"
  },
  {
    "ID": "2111",
    "PARENT_ID": "2101",
    "CODE": "431228",
    "NAME": "芷江侗族自治县"
  },
  {
    "ID": "2112",
    "PARENT_ID": "2101",
    "CODE": "431229",
    "NAME": "靖州苗族侗族自治县"
  },
  {
    "ID": "2113",
    "PARENT_ID": "2101",
    "CODE": "431230",
    "NAME": "通道侗族自治县"
  },
  {
    "ID": "2114",
    "PARENT_ID": "2101",
    "CODE": "431281",
    "NAME": "洪江市"
  },
  {
    "ID": "2115",
    "PARENT_ID": "1981",
    "CODE": "431300",
    "NAME": "娄底市"
  },
  {
    "ID": "2116",
    "PARENT_ID": "2115",
    "CODE": "431301",
    "NAME": "市辖区"
  },
  {
    "ID": "2117",
    "PARENT_ID": "2115",
    "CODE": "431302",
    "NAME": "娄星区"
  },
  {
    "ID": "2118",
    "PARENT_ID": "2115",
    "CODE": "431321",
    "NAME": "双峰县"
  },
  {
    "ID": "2119",
    "PARENT_ID": "2115",
    "CODE": "431322",
    "NAME": "新化县"
  },
  {
    "ID": "212",
    "PARENT_ID": "208",
    "CODE": "131022",
    "NAME": "固安县"
  },
  {
    "ID": "2120",
    "PARENT_ID": "2115",
    "CODE": "431381",
    "NAME": "冷水江市"
  },
  {
    "ID": "2121",
    "PARENT_ID": "2115",
    "CODE": "431382",
    "NAME": "涟源市"
  },
  {
    "ID": "2122",
    "PARENT_ID": "1981",
    "CODE": "433100",
    "NAME": "湘西土家族苗族自治州"
  },
  {
    "ID": "2123",
    "PARENT_ID": "2122",
    "CODE": "433101",
    "NAME": "吉首市"
  },
  {
    "ID": "2124",
    "PARENT_ID": "2122",
    "CODE": "433122",
    "NAME": "泸溪县"
  },
  {
    "ID": "2125",
    "PARENT_ID": "2122",
    "CODE": "433123",
    "NAME": "凤凰县"
  },
  {
    "ID": "2126",
    "PARENT_ID": "2122",
    "CODE": "433124",
    "NAME": "花垣县"
  },
  {
    "ID": "2127",
    "PARENT_ID": "2122",
    "CODE": "433125",
    "NAME": "保靖县"
  },
  {
    "ID": "2128",
    "PARENT_ID": "2122",
    "CODE": "433126",
    "NAME": "古丈县"
  },
  {
    "ID": "2129",
    "PARENT_ID": "2122",
    "CODE": "433127",
    "NAME": "永顺县"
  },
  {
    "ID": "213",
    "PARENT_ID": "208",
    "CODE": "131023",
    "NAME": "永清县"
  },
  {
    "ID": "2130",
    "PARENT_ID": "2122",
    "CODE": "433130",
    "NAME": "龙山县"
  },
  {
    "ID": "2131",
    "PARENT_ID": "0",
    "CODE": "440000",
    "NAME": "广东省"
  },
  {
    "ID": "2132",
    "PARENT_ID": "2131",
    "CODE": "440100",
    "NAME": "广州市"
  },
  {
    "ID": "2133",
    "PARENT_ID": "2132",
    "CODE": "440101",
    "NAME": "市辖区"
  },
  {
    "ID": "2134",
    "PARENT_ID": "2132",
    "CODE": "440103",
    "NAME": "荔湾区"
  },
  {
    "ID": "2135",
    "PARENT_ID": "2132",
    "CODE": "440104",
    "NAME": "越秀区"
  },
  {
    "ID": "2136",
    "PARENT_ID": "2132",
    "CODE": "440105",
    "NAME": "海珠区"
  },
  {
    "ID": "2137",
    "PARENT_ID": "2132",
    "CODE": "440106",
    "NAME": "天河区"
  },
  {
    "ID": "2138",
    "PARENT_ID": "2132",
    "CODE": "440111",
    "NAME": "白云区"
  },
  {
    "ID": "2139",
    "PARENT_ID": "2132",
    "CODE": "440112",
    "NAME": "黄埔区"
  },
  {
    "ID": "214",
    "PARENT_ID": "208",
    "CODE": "131024",
    "NAME": "香河县"
  },
  {
    "ID": "2140",
    "PARENT_ID": "2132",
    "CODE": "440113",
    "NAME": "番禺区"
  },
  {
    "ID": "2141",
    "PARENT_ID": "2132",
    "CODE": "440114",
    "NAME": "花都区"
  },
  {
    "ID": "2142",
    "PARENT_ID": "2132",
    "CODE": "440115",
    "NAME": "南沙区"
  },
  {
    "ID": "2143",
    "PARENT_ID": "2132",
    "CODE": "440116",
    "NAME": "萝岗区"
  },
  {
    "ID": "2144",
    "PARENT_ID": "2132",
    "CODE": "440117",
    "NAME": "从化区"
  },
  {
    "ID": "2145",
    "PARENT_ID": "2132",
    "CODE": "440118",
    "NAME": "增城区"
  },
  {
    "ID": "2146",
    "PARENT_ID": "2131",
    "CODE": "440200",
    "NAME": "韶关市"
  },
  {
    "ID": "2147",
    "PARENT_ID": "2146",
    "CODE": "440201",
    "NAME": "市辖区"
  },
  {
    "ID": "2148",
    "PARENT_ID": "2146",
    "CODE": "440203",
    "NAME": "武江区"
  },
  {
    "ID": "2149",
    "PARENT_ID": "2146",
    "CODE": "440204",
    "NAME": "浈江区"
  },
  {
    "ID": "215",
    "PARENT_ID": "208",
    "CODE": "131025",
    "NAME": "大城县"
  },
  {
    "ID": "2150",
    "PARENT_ID": "2146",
    "CODE": "440205",
    "NAME": "曲江区"
  },
  {
    "ID": "2151",
    "PARENT_ID": "2146",
    "CODE": "440222",
    "NAME": "始兴县"
  },
  {
    "ID": "2152",
    "PARENT_ID": "2146",
    "CODE": "440224",
    "NAME": "仁化县"
  },
  {
    "ID": "2153",
    "PARENT_ID": "2146",
    "CODE": "440229",
    "NAME": "翁源县"
  },
  {
    "ID": "2154",
    "PARENT_ID": "2146",
    "CODE": "440232",
    "NAME": "乳源瑶族自治县"
  },
  {
    "ID": "2155",
    "PARENT_ID": "2146",
    "CODE": "440233",
    "NAME": "新丰县"
  },
  {
    "ID": "2156",
    "PARENT_ID": "2146",
    "CODE": "440281",
    "NAME": "乐昌市"
  },
  {
    "ID": "2157",
    "PARENT_ID": "2146",
    "CODE": "440282",
    "NAME": "南雄市"
  },
  {
    "ID": "2158",
    "PARENT_ID": "2131",
    "CODE": "440300",
    "NAME": "深圳市"
  },
  {
    "ID": "2159",
    "PARENT_ID": "2158",
    "CODE": "440301",
    "NAME": "市辖区"
  },
  {
    "ID": "216",
    "PARENT_ID": "208",
    "CODE": "131026",
    "NAME": "文安县"
  },
  {
    "ID": "2160",
    "PARENT_ID": "2158",
    "CODE": "440303",
    "NAME": "罗湖区"
  },
  {
    "ID": "2161",
    "PARENT_ID": "2158",
    "CODE": "440304",
    "NAME": "福田区"
  },
  {
    "ID": "2162",
    "PARENT_ID": "2158",
    "CODE": "440305",
    "NAME": "南山区"
  },
  {
    "ID": "2163",
    "PARENT_ID": "2158",
    "CODE": "440306",
    "NAME": "宝安区"
  },
  {
    "ID": "2164",
    "PARENT_ID": "2158",
    "CODE": "440307",
    "NAME": "龙岗区"
  },
  {
    "ID": "2165",
    "PARENT_ID": "2158",
    "CODE": "440308",
    "NAME": "盐田区"
  },
  {
    "ID": "2166",
    "PARENT_ID": "2131",
    "CODE": "440400",
    "NAME": "珠海市"
  },
  {
    "ID": "2167",
    "PARENT_ID": "2166",
    "CODE": "440401",
    "NAME": "市辖区"
  },
  {
    "ID": "2168",
    "PARENT_ID": "2166",
    "CODE": "440402",
    "NAME": "香洲区"
  },
  {
    "ID": "2169",
    "PARENT_ID": "2166",
    "CODE": "440403",
    "NAME": "斗门区"
  },
  {
    "ID": "217",
    "PARENT_ID": "208",
    "CODE": "131028",
    "NAME": "大厂回族自治县"
  },
  {
    "ID": "2170",
    "PARENT_ID": "2166",
    "CODE": "440404",
    "NAME": "金湾区"
  },
  {
    "ID": "2171",
    "PARENT_ID": "2131",
    "CODE": "440500",
    "NAME": "汕头市"
  },
  {
    "ID": "2172",
    "PARENT_ID": "2171",
    "CODE": "440501",
    "NAME": "市辖区"
  },
  {
    "ID": "2173",
    "PARENT_ID": "2171",
    "CODE": "440507",
    "NAME": "龙湖区"
  },
  {
    "ID": "2174",
    "PARENT_ID": "2171",
    "CODE": "440511",
    "NAME": "金平区"
  },
  {
    "ID": "2175",
    "PARENT_ID": "2171",
    "CODE": "440512",
    "NAME": "濠江区"
  },
  {
    "ID": "2176",
    "PARENT_ID": "2171",
    "CODE": "440513",
    "NAME": "潮阳区"
  },
  {
    "ID": "2177",
    "PARENT_ID": "2171",
    "CODE": "440514",
    "NAME": "潮南区"
  },
  {
    "ID": "2178",
    "PARENT_ID": "2171",
    "CODE": "440515",
    "NAME": "澄海区"
  },
  {
    "ID": "2179",
    "PARENT_ID": "2171",
    "CODE": "440523",
    "NAME": "南澳县"
  },
  {
    "ID": "218",
    "PARENT_ID": "208",
    "CODE": "131081",
    "NAME": "霸州市"
  },
  {
    "ID": "2180",
    "PARENT_ID": "2131",
    "CODE": "440600",
    "NAME": "佛山市"
  },
  {
    "ID": "2181",
    "PARENT_ID": "2180",
    "CODE": "440601",
    "NAME": "市辖区"
  },
  {
    "ID": "2182",
    "PARENT_ID": "2180",
    "CODE": "440604",
    "NAME": "禅城区"
  },
  {
    "ID": "2183",
    "PARENT_ID": "2180",
    "CODE": "440605",
    "NAME": "南海区"
  },
  {
    "ID": "2184",
    "PARENT_ID": "2180",
    "CODE": "440606",
    "NAME": "顺德区"
  },
  {
    "ID": "2185",
    "PARENT_ID": "2180",
    "CODE": "440607",
    "NAME": "三水区"
  },
  {
    "ID": "2186",
    "PARENT_ID": "2180",
    "CODE": "440608",
    "NAME": "高明区"
  },
  {
    "ID": "2187",
    "PARENT_ID": "2131",
    "CODE": "440700",
    "NAME": "江门市"
  },
  {
    "ID": "2188",
    "PARENT_ID": "2187",
    "CODE": "440701",
    "NAME": "市辖区"
  },
  {
    "ID": "2189",
    "PARENT_ID": "2187",
    "CODE": "440703",
    "NAME": "蓬江区"
  },
  {
    "ID": "219",
    "PARENT_ID": "208",
    "CODE": "131082",
    "NAME": "三河市"
  },
  {
    "ID": "2190",
    "PARENT_ID": "2187",
    "CODE": "440704",
    "NAME": "江海区"
  },
  {
    "ID": "2191",
    "PARENT_ID": "2187",
    "CODE": "440705",
    "NAME": "新会区"
  },
  {
    "ID": "2192",
    "PARENT_ID": "2187",
    "CODE": "440781",
    "NAME": "台山市"
  },
  {
    "ID": "2193",
    "PARENT_ID": "2187",
    "CODE": "440783",
    "NAME": "开平市"
  },
  {
    "ID": "2194",
    "PARENT_ID": "2187",
    "CODE": "440784",
    "NAME": "鹤山市"
  },
  {
    "ID": "2195",
    "PARENT_ID": "2187",
    "CODE": "440785",
    "NAME": "恩平市"
  },
  {
    "ID": "2196",
    "PARENT_ID": "2131",
    "CODE": "440800",
    "NAME": "湛江市"
  },
  {
    "ID": "2197",
    "PARENT_ID": "2196",
    "CODE": "440801",
    "NAME": "市辖区"
  },
  {
    "ID": "2198",
    "PARENT_ID": "2196",
    "CODE": "440802",
    "NAME": "赤坎区"
  },
  {
    "ID": "2199",
    "PARENT_ID": "2196",
    "CODE": "440803",
    "NAME": "霞山区"
  },
  {
    "ID": "22",
    "PARENT_ID": "21",
    "CODE": "120101",
    "NAME": "和平区"
  },
  {
    "ID": "220",
    "PARENT_ID": "39",
    "CODE": "131100",
    "NAME": "衡水市"
  },
  {
    "ID": "2200",
    "PARENT_ID": "2196",
    "CODE": "440804",
    "NAME": "坡头区"
  },
  {
    "ID": "2201",
    "PARENT_ID": "2196",
    "CODE": "440811",
    "NAME": "麻章区"
  },
  {
    "ID": "2202",
    "PARENT_ID": "2196",
    "CODE": "440823",
    "NAME": "遂溪县"
  },
  {
    "ID": "2203",
    "PARENT_ID": "2196",
    "CODE": "440825",
    "NAME": "徐闻县"
  },
  {
    "ID": "2204",
    "PARENT_ID": "2196",
    "CODE": "440881",
    "NAME": "廉江市"
  },
  {
    "ID": "2205",
    "PARENT_ID": "2196",
    "CODE": "440882",
    "NAME": "雷州市"
  },
  {
    "ID": "2206",
    "PARENT_ID": "2196",
    "CODE": "440883",
    "NAME": "吴川市"
  },
  {
    "ID": "2207",
    "PARENT_ID": "2131",
    "CODE": "440900",
    "NAME": "茂名市"
  },
  {
    "ID": "2208",
    "PARENT_ID": "2207",
    "CODE": "440901",
    "NAME": "市辖区"
  },
  {
    "ID": "2209",
    "PARENT_ID": "2207",
    "CODE": "440902",
    "NAME": "茂南区"
  },
  {
    "ID": "221",
    "PARENT_ID": "220",
    "CODE": "131101",
    "NAME": "市辖区"
  },
  {
    "ID": "2210",
    "PARENT_ID": "2207",
    "CODE": "440904",
    "NAME": "电白区"
  },
  {
    "ID": "2211",
    "PARENT_ID": "2207",
    "CODE": "440981",
    "NAME": "高州市"
  },
  {
    "ID": "2212",
    "PARENT_ID": "2207",
    "CODE": "440982",
    "NAME": "化州市"
  },
  {
    "ID": "2213",
    "PARENT_ID": "2207",
    "CODE": "440983",
    "NAME": "信宜市"
  },
  {
    "ID": "2214",
    "PARENT_ID": "2131",
    "CODE": "441200",
    "NAME": "肇庆市"
  },
  {
    "ID": "2215",
    "PARENT_ID": "2214",
    "CODE": "441201",
    "NAME": "市辖区"
  },
  {
    "ID": "2216",
    "PARENT_ID": "2214",
    "CODE": "441202",
    "NAME": "端州区"
  },
  {
    "ID": "2217",
    "PARENT_ID": "2214",
    "CODE": "441203",
    "NAME": "鼎湖区"
  },
  {
    "ID": "2218",
    "PARENT_ID": "2214",
    "CODE": "441223",
    "NAME": "广宁县"
  },
  {
    "ID": "2219",
    "PARENT_ID": "2214",
    "CODE": "441224",
    "NAME": "怀集县"
  },
  {
    "ID": "222",
    "PARENT_ID": "220",
    "CODE": "131102",
    "NAME": "桃城区"
  },
  {
    "ID": "2220",
    "PARENT_ID": "2214",
    "CODE": "441225",
    "NAME": "封开县"
  },
  {
    "ID": "2221",
    "PARENT_ID": "2214",
    "CODE": "441226",
    "NAME": "德庆县"
  },
  {
    "ID": "2222",
    "PARENT_ID": "2214",
    "CODE": "441283",
    "NAME": "高要市"
  },
  {
    "ID": "2223",
    "PARENT_ID": "2214",
    "CODE": "441284",
    "NAME": "四会市"
  },
  {
    "ID": "2224",
    "PARENT_ID": "2131",
    "CODE": "441300",
    "NAME": "惠州市"
  },
  {
    "ID": "2225",
    "PARENT_ID": "2224",
    "CODE": "441301",
    "NAME": "市辖区"
  },
  {
    "ID": "2226",
    "PARENT_ID": "2224",
    "CODE": "441302",
    "NAME": "惠城区"
  },
  {
    "ID": "2227",
    "PARENT_ID": "2224",
    "CODE": "441303",
    "NAME": "惠阳区"
  },
  {
    "ID": "2228",
    "PARENT_ID": "2224",
    "CODE": "441322",
    "NAME": "博罗县"
  },
  {
    "ID": "2229",
    "PARENT_ID": "2224",
    "CODE": "441323",
    "NAME": "惠东县"
  },
  {
    "ID": "223",
    "PARENT_ID": "220",
    "CODE": "131121",
    "NAME": "枣强县"
  },
  {
    "ID": "2230",
    "PARENT_ID": "2224",
    "CODE": "441324",
    "NAME": "龙门县"
  },
  {
    "ID": "2231",
    "PARENT_ID": "2131",
    "CODE": "441400",
    "NAME": "梅州市"
  },
  {
    "ID": "2232",
    "PARENT_ID": "2231",
    "CODE": "441401",
    "NAME": "市辖区"
  },
  {
    "ID": "2233",
    "PARENT_ID": "2231",
    "CODE": "441402",
    "NAME": "梅江区"
  },
  {
    "ID": "2234",
    "PARENT_ID": "2231",
    "CODE": "441403",
    "NAME": "梅县区"
  },
  {
    "ID": "2235",
    "PARENT_ID": "2231",
    "CODE": "441422",
    "NAME": "大埔县"
  },
  {
    "ID": "2236",
    "PARENT_ID": "2231",
    "CODE": "441423",
    "NAME": "丰顺县"
  },
  {
    "ID": "2237",
    "PARENT_ID": "2231",
    "CODE": "441424",
    "NAME": "五华县"
  },
  {
    "ID": "2238",
    "PARENT_ID": "2231",
    "CODE": "441426",
    "NAME": "平远县"
  },
  {
    "ID": "2239",
    "PARENT_ID": "2231",
    "CODE": "441427",
    "NAME": "蕉岭县"
  },
  {
    "ID": "224",
    "PARENT_ID": "220",
    "CODE": "131122",
    "NAME": "武邑县"
  },
  {
    "ID": "2240",
    "PARENT_ID": "2231",
    "CODE": "441481",
    "NAME": "兴宁市"
  },
  {
    "ID": "2241",
    "PARENT_ID": "2131",
    "CODE": "441500",
    "NAME": "汕尾市"
  },
  {
    "ID": "2242",
    "PARENT_ID": "2241",
    "CODE": "441501",
    "NAME": "市辖区"
  },
  {
    "ID": "2243",
    "PARENT_ID": "2241",
    "CODE": "441502",
    "NAME": "城区"
  },
  {
    "ID": "2244",
    "PARENT_ID": "2241",
    "CODE": "441521",
    "NAME": "海丰县"
  },
  {
    "ID": "2245",
    "PARENT_ID": "2241",
    "CODE": "441523",
    "NAME": "陆河县"
  },
  {
    "ID": "2246",
    "PARENT_ID": "2241",
    "CODE": "441581",
    "NAME": "陆丰市"
  },
  {
    "ID": "2247",
    "PARENT_ID": "2131",
    "CODE": "441600",
    "NAME": "河源市"
  },
  {
    "ID": "2248",
    "PARENT_ID": "2247",
    "CODE": "441601",
    "NAME": "市辖区"
  },
  {
    "ID": "2249",
    "PARENT_ID": "2247",
    "CODE": "441602",
    "NAME": "源城区"
  },
  {
    "ID": "225",
    "PARENT_ID": "220",
    "CODE": "131123",
    "NAME": "武强县"
  },
  {
    "ID": "2250",
    "PARENT_ID": "2247",
    "CODE": "441621",
    "NAME": "紫金县"
  },
  {
    "ID": "2251",
    "PARENT_ID": "2247",
    "CODE": "441622",
    "NAME": "龙川县"
  },
  {
    "ID": "2252",
    "PARENT_ID": "2247",
    "CODE": "441623",
    "NAME": "连平县"
  },
  {
    "ID": "2253",
    "PARENT_ID": "2247",
    "CODE": "441624",
    "NAME": "和平县"
  },
  {
    "ID": "2254",
    "PARENT_ID": "2247",
    "CODE": "441625",
    "NAME": "东源县"
  },
  {
    "ID": "2255",
    "PARENT_ID": "2131",
    "CODE": "441700",
    "NAME": "阳江市"
  },
  {
    "ID": "2256",
    "PARENT_ID": "2255",
    "CODE": "441701",
    "NAME": "市辖区"
  },
  {
    "ID": "2257",
    "PARENT_ID": "2255",
    "CODE": "441702",
    "NAME": "江城区"
  },
  {
    "ID": "2258",
    "PARENT_ID": "2255",
    "CODE": "441721",
    "NAME": "阳西县"
  },
  {
    "ID": "2259",
    "PARENT_ID": "2255",
    "CODE": "441723",
    "NAME": "阳东县"
  },
  {
    "ID": "226",
    "PARENT_ID": "220",
    "CODE": "131124",
    "NAME": "饶阳县"
  },
  {
    "ID": "2260",
    "PARENT_ID": "2255",
    "CODE": "441781",
    "NAME": "阳春市"
  },
  {
    "ID": "2261",
    "PARENT_ID": "2131",
    "CODE": "441800",
    "NAME": "清远市"
  },
  {
    "ID": "2262",
    "PARENT_ID": "2261",
    "CODE": "441801",
    "NAME": "市辖区"
  },
  {
    "ID": "2263",
    "PARENT_ID": "2261",
    "CODE": "441802",
    "NAME": "清城区"
  },
  {
    "ID": "2264",
    "PARENT_ID": "2261",
    "CODE": "441803",
    "NAME": "清新区"
  },
  {
    "ID": "2265",
    "PARENT_ID": "2261",
    "CODE": "441821",
    "NAME": "佛冈县"
  },
  {
    "ID": "2266",
    "PARENT_ID": "2261",
    "CODE": "441823",
    "NAME": "阳山县"
  },
  {
    "ID": "2267",
    "PARENT_ID": "2261",
    "CODE": "441825",
    "NAME": "连山壮族瑶族自治县"
  },
  {
    "ID": "2268",
    "PARENT_ID": "2261",
    "CODE": "441826",
    "NAME": "连南瑶族自治县"
  },
  {
    "ID": "2269",
    "PARENT_ID": "2261",
    "CODE": "441881",
    "NAME": "英德市"
  },
  {
    "ID": "227",
    "PARENT_ID": "220",
    "CODE": "131125",
    "NAME": "安平县"
  },
  {
    "ID": "2270",
    "PARENT_ID": "2261",
    "CODE": "441882",
    "NAME": "连州市"
  },
  {
    "ID": "2271",
    "PARENT_ID": "2131",
    "CODE": "441900",
    "NAME": "东莞市"
  },
  {
    "ID": "2272",
    "PARENT_ID": "2131",
    "CODE": "442000",
    "NAME": "中山市"
  },
  {
    "ID": "2273",
    "PARENT_ID": "2131",
    "CODE": "445100",
    "NAME": "潮州市"
  },
  {
    "ID": "2274",
    "PARENT_ID": "2273",
    "CODE": "445101",
    "NAME": "市辖区"
  },
  {
    "ID": "2275",
    "PARENT_ID": "2273",
    "CODE": "445102",
    "NAME": "湘桥区"
  },
  {
    "ID": "2276",
    "PARENT_ID": "2273",
    "CODE": "445103",
    "NAME": "潮安区"
  },
  {
    "ID": "2277",
    "PARENT_ID": "2273",
    "CODE": "445122",
    "NAME": "饶平县"
  },
  {
    "ID": "2278",
    "PARENT_ID": "2131",
    "CODE": "445200",
    "NAME": "揭阳市"
  },
  {
    "ID": "2279",
    "PARENT_ID": "2278",
    "CODE": "445201",
    "NAME": "市辖区"
  },
  {
    "ID": "228",
    "PARENT_ID": "220",
    "CODE": "131126",
    "NAME": "故城县"
  },
  {
    "ID": "2280",
    "PARENT_ID": "2278",
    "CODE": "445202",
    "NAME": "榕城区"
  },
  {
    "ID": "2281",
    "PARENT_ID": "2278",
    "CODE": "445203",
    "NAME": "揭东区"
  },
  {
    "ID": "2282",
    "PARENT_ID": "2278",
    "CODE": "445222",
    "NAME": "揭西县"
  },
  {
    "ID": "2283",
    "PARENT_ID": "2278",
    "CODE": "445224",
    "NAME": "惠来县"
  },
  {
    "ID": "2284",
    "PARENT_ID": "2278",
    "CODE": "445281",
    "NAME": "普宁市"
  },
  {
    "ID": "2285",
    "PARENT_ID": "2131",
    "CODE": "445300",
    "NAME": "云浮市"
  },
  {
    "ID": "2286",
    "PARENT_ID": "2285",
    "CODE": "445301",
    "NAME": "市辖区"
  },
  {
    "ID": "2287",
    "PARENT_ID": "2285",
    "CODE": "445302",
    "NAME": "云城区"
  },
  {
    "ID": "2288",
    "PARENT_ID": "2285",
    "CODE": "445303",
    "NAME": "云安区"
  },
  {
    "ID": "2289",
    "PARENT_ID": "2285",
    "CODE": "445321",
    "NAME": "新兴县"
  },
  {
    "ID": "229",
    "PARENT_ID": "220",
    "CODE": "131127",
    "NAME": "景县"
  },
  {
    "ID": "2290",
    "PARENT_ID": "2285",
    "CODE": "445322",
    "NAME": "郁南县"
  },
  {
    "ID": "2291",
    "PARENT_ID": "2285",
    "CODE": "445381",
    "NAME": "罗定市"
  },
  {
    "ID": "2292",
    "PARENT_ID": "0",
    "CODE": "450000",
    "NAME": "广西壮族自治区"
  },
  {
    "ID": "2293",
    "PARENT_ID": "2292",
    "CODE": "450100",
    "NAME": "南宁市"
  },
  {
    "ID": "2294",
    "PARENT_ID": "2293",
    "CODE": "450101",
    "NAME": "市辖区"
  },
  {
    "ID": "2295",
    "PARENT_ID": "2293",
    "CODE": "450102",
    "NAME": "兴宁区"
  },
  {
    "ID": "2296",
    "PARENT_ID": "2293",
    "CODE": "450103",
    "NAME": "青秀区"
  },
  {
    "ID": "2297",
    "PARENT_ID": "2293",
    "CODE": "450105",
    "NAME": "江南区"
  },
  {
    "ID": "2298",
    "PARENT_ID": "2293",
    "CODE": "450107",
    "NAME": "西乡塘区"
  },
  {
    "ID": "2299",
    "PARENT_ID": "2293",
    "CODE": "450108",
    "NAME": "良庆区"
  },
  {
    "ID": "23",
    "PARENT_ID": "21",
    "CODE": "120102",
    "NAME": "河东区"
  },
  {
    "ID": "230",
    "PARENT_ID": "220",
    "CODE": "131128",
    "NAME": "阜城县"
  },
  {
    "ID": "2300",
    "PARENT_ID": "2293",
    "CODE": "450109",
    "NAME": "邕宁区"
  },
  {
    "ID": "2301",
    "PARENT_ID": "2293",
    "CODE": "450122",
    "NAME": "武鸣县"
  },
  {
    "ID": "2302",
    "PARENT_ID": "2293",
    "CODE": "450123",
    "NAME": "隆安县"
  },
  {
    "ID": "2303",
    "PARENT_ID": "2293",
    "CODE": "450124",
    "NAME": "马山县"
  },
  {
    "ID": "2304",
    "PARENT_ID": "2293",
    "CODE": "450125",
    "NAME": "上林县"
  },
  {
    "ID": "2305",
    "PARENT_ID": "2293",
    "CODE": "450126",
    "NAME": "宾阳县"
  },
  {
    "ID": "2306",
    "PARENT_ID": "2293",
    "CODE": "450127",
    "NAME": "横县"
  },
  {
    "ID": "2307",
    "PARENT_ID": "2292",
    "CODE": "450200",
    "NAME": "柳州市"
  },
  {
    "ID": "2308",
    "PARENT_ID": "2307",
    "CODE": "450201",
    "NAME": "市辖区"
  },
  {
    "ID": "2309",
    "PARENT_ID": "2307",
    "CODE": "450202",
    "NAME": "城中区"
  },
  {
    "ID": "231",
    "PARENT_ID": "220",
    "CODE": "131181",
    "NAME": "冀州市"
  },
  {
    "ID": "2310",
    "PARENT_ID": "2307",
    "CODE": "450203",
    "NAME": "鱼峰区"
  },
  {
    "ID": "2311",
    "PARENT_ID": "2307",
    "CODE": "450204",
    "NAME": "柳南区"
  },
  {
    "ID": "2312",
    "PARENT_ID": "2307",
    "CODE": "450205",
    "NAME": "柳北区"
  },
  {
    "ID": "2313",
    "PARENT_ID": "2307",
    "CODE": "450221",
    "NAME": "柳江县"
  },
  {
    "ID": "2314",
    "PARENT_ID": "2307",
    "CODE": "450222",
    "NAME": "柳城县"
  },
  {
    "ID": "2315",
    "PARENT_ID": "2307",
    "CODE": "450223",
    "NAME": "鹿寨县"
  },
  {
    "ID": "2316",
    "PARENT_ID": "2307",
    "CODE": "450224",
    "NAME": "融安县"
  },
  {
    "ID": "2317",
    "PARENT_ID": "2307",
    "CODE": "450225",
    "NAME": "融水苗族自治县"
  },
  {
    "ID": "2318",
    "PARENT_ID": "2307",
    "CODE": "450226",
    "NAME": "三江侗族自治县"
  },
  {
    "ID": "2319",
    "PARENT_ID": "2292",
    "CODE": "450300",
    "NAME": "桂林市"
  },
  {
    "ID": "232",
    "PARENT_ID": "220",
    "CODE": "131182",
    "NAME": "深州市"
  },
  {
    "ID": "2320",
    "PARENT_ID": "2319",
    "CODE": "450301",
    "NAME": "市辖区"
  },
  {
    "ID": "2321",
    "PARENT_ID": "2319",
    "CODE": "450302",
    "NAME": "秀峰区"
  },
  {
    "ID": "2322",
    "PARENT_ID": "2319",
    "CODE": "450303",
    "NAME": "叠彩区"
  },
  {
    "ID": "2323",
    "PARENT_ID": "2319",
    "CODE": "450304",
    "NAME": "象山区"
  },
  {
    "ID": "2324",
    "PARENT_ID": "2319",
    "CODE": "450305",
    "NAME": "七星区"
  },
  {
    "ID": "2325",
    "PARENT_ID": "2319",
    "CODE": "450311",
    "NAME": "雁山区"
  },
  {
    "ID": "2326",
    "PARENT_ID": "2319",
    "CODE": "450312",
    "NAME": "临桂区"
  },
  {
    "ID": "2327",
    "PARENT_ID": "2319",
    "CODE": "450321",
    "NAME": "阳朔县"
  },
  {
    "ID": "2328",
    "PARENT_ID": "2319",
    "CODE": "450323",
    "NAME": "灵川县"
  },
  {
    "ID": "2329",
    "PARENT_ID": "2319",
    "CODE": "450324",
    "NAME": "全州县"
  },
  {
    "ID": "233",
    "PARENT_ID": "0",
    "CODE": "140000",
    "NAME": "山西省"
  },
  {
    "ID": "2330",
    "PARENT_ID": "2319",
    "CODE": "450325",
    "NAME": "兴安县"
  },
  {
    "ID": "2331",
    "PARENT_ID": "2319",
    "CODE": "450326",
    "NAME": "永福县"
  },
  {
    "ID": "2332",
    "PARENT_ID": "2319",
    "CODE": "450327",
    "NAME": "灌阳县"
  },
  {
    "ID": "2333",
    "PARENT_ID": "2319",
    "CODE": "450328",
    "NAME": "龙胜各族自治县"
  },
  {
    "ID": "2334",
    "PARENT_ID": "2319",
    "CODE": "450329",
    "NAME": "资源县"
  },
  {
    "ID": "2335",
    "PARENT_ID": "2319",
    "CODE": "450330",
    "NAME": "平乐县"
  },
  {
    "ID": "2336",
    "PARENT_ID": "2319",
    "CODE": "450331",
    "NAME": "荔浦县"
  },
  {
    "ID": "2337",
    "PARENT_ID": "2319",
    "CODE": "450332",
    "NAME": "恭城瑶族自治县"
  },
  {
    "ID": "2338",
    "PARENT_ID": "2292",
    "CODE": "450400",
    "NAME": "梧州市"
  },
  {
    "ID": "2339",
    "PARENT_ID": "2338",
    "CODE": "450401",
    "NAME": "市辖区"
  },
  {
    "ID": "234",
    "PARENT_ID": "233",
    "CODE": "140100",
    "NAME": "太原市"
  },
  {
    "ID": "2340",
    "PARENT_ID": "2338",
    "CODE": "450403",
    "NAME": "万秀区"
  },
  {
    "ID": "2341",
    "PARENT_ID": "2338",
    "CODE": "450405",
    "NAME": "长洲区"
  },
  {
    "ID": "2342",
    "PARENT_ID": "2338",
    "CODE": "450406",
    "NAME": "龙圩区"
  },
  {
    "ID": "2343",
    "PARENT_ID": "2338",
    "CODE": "450421",
    "NAME": "苍梧县"
  },
  {
    "ID": "2344",
    "PARENT_ID": "2338",
    "CODE": "450422",
    "NAME": "藤县"
  },
  {
    "ID": "2345",
    "PARENT_ID": "2338",
    "CODE": "450423",
    "NAME": "蒙山县"
  },
  {
    "ID": "2346",
    "PARENT_ID": "2338",
    "CODE": "450481",
    "NAME": "岑溪市"
  },
  {
    "ID": "2347",
    "PARENT_ID": "2292",
    "CODE": "450500",
    "NAME": "北海市"
  },
  {
    "ID": "2348",
    "PARENT_ID": "2347",
    "CODE": "450501",
    "NAME": "市辖区"
  },
  {
    "ID": "2349",
    "PARENT_ID": "2347",
    "CODE": "450502",
    "NAME": "海城区"
  },
  {
    "ID": "235",
    "PARENT_ID": "234",
    "CODE": "140101",
    "NAME": "市辖区"
  },
  {
    "ID": "2350",
    "PARENT_ID": "2347",
    "CODE": "450503",
    "NAME": "银海区"
  },
  {
    "ID": "2351",
    "PARENT_ID": "2347",
    "CODE": "450512",
    "NAME": "铁山港区"
  },
  {
    "ID": "2352",
    "PARENT_ID": "2347",
    "CODE": "450521",
    "NAME": "合浦县"
  },
  {
    "ID": "2353",
    "PARENT_ID": "2292",
    "CODE": "450600",
    "NAME": "防城港市"
  },
  {
    "ID": "2354",
    "PARENT_ID": "2353",
    "CODE": "450601",
    "NAME": "市辖区"
  },
  {
    "ID": "2355",
    "PARENT_ID": "2353",
    "CODE": "450602",
    "NAME": "港口区"
  },
  {
    "ID": "2356",
    "PARENT_ID": "2353",
    "CODE": "450603",
    "NAME": "防城区"
  },
  {
    "ID": "2357",
    "PARENT_ID": "2353",
    "CODE": "450621",
    "NAME": "上思县"
  },
  {
    "ID": "2358",
    "PARENT_ID": "2353",
    "CODE": "450681",
    "NAME": "东兴市"
  },
  {
    "ID": "2359",
    "PARENT_ID": "2292",
    "CODE": "450700",
    "NAME": "钦州市"
  },
  {
    "ID": "236",
    "PARENT_ID": "234",
    "CODE": "140105",
    "NAME": "小店区"
  },
  {
    "ID": "2360",
    "PARENT_ID": "2359",
    "CODE": "450701",
    "NAME": "市辖区"
  },
  {
    "ID": "2361",
    "PARENT_ID": "2359",
    "CODE": "450702",
    "NAME": "钦南区"
  },
  {
    "ID": "2362",
    "PARENT_ID": "2359",
    "CODE": "450703",
    "NAME": "钦北区"
  },
  {
    "ID": "2363",
    "PARENT_ID": "2359",
    "CODE": "450721",
    "NAME": "灵山县"
  },
  {
    "ID": "2364",
    "PARENT_ID": "2359",
    "CODE": "450722",
    "NAME": "浦北县"
  },
  {
    "ID": "2365",
    "PARENT_ID": "2292",
    "CODE": "450800",
    "NAME": "贵港市"
  },
  {
    "ID": "2366",
    "PARENT_ID": "2365",
    "CODE": "450801",
    "NAME": "市辖区"
  },
  {
    "ID": "2367",
    "PARENT_ID": "2365",
    "CODE": "450802",
    "NAME": "港北区"
  },
  {
    "ID": "2368",
    "PARENT_ID": "2365",
    "CODE": "450803",
    "NAME": "港南区"
  },
  {
    "ID": "2369",
    "PARENT_ID": "2365",
    "CODE": "450804",
    "NAME": "覃塘区"
  },
  {
    "ID": "237",
    "PARENT_ID": "234",
    "CODE": "140106",
    "NAME": "迎泽区"
  },
  {
    "ID": "2370",
    "PARENT_ID": "2365",
    "CODE": "450821",
    "NAME": "平南县"
  },
  {
    "ID": "2371",
    "PARENT_ID": "2365",
    "CODE": "450881",
    "NAME": "桂平市"
  },
  {
    "ID": "2372",
    "PARENT_ID": "2292",
    "CODE": "450900",
    "NAME": "玉林市"
  },
  {
    "ID": "2373",
    "PARENT_ID": "2372",
    "CODE": "450901",
    "NAME": "市辖区"
  },
  {
    "ID": "2374",
    "PARENT_ID": "2372",
    "CODE": "450902",
    "NAME": "玉州区"
  },
  {
    "ID": "2375",
    "PARENT_ID": "2372",
    "CODE": "450903",
    "NAME": "福绵区"
  },
  {
    "ID": "2376",
    "PARENT_ID": "2372",
    "CODE": "450921",
    "NAME": "容县"
  },
  {
    "ID": "2377",
    "PARENT_ID": "2372",
    "CODE": "450922",
    "NAME": "陆川县"
  },
  {
    "ID": "2378",
    "PARENT_ID": "2372",
    "CODE": "450923",
    "NAME": "博白县"
  },
  {
    "ID": "2379",
    "PARENT_ID": "2372",
    "CODE": "450924",
    "NAME": "兴业县"
  },
  {
    "ID": "238",
    "PARENT_ID": "234",
    "CODE": "140107",
    "NAME": "杏花岭区"
  },
  {
    "ID": "2380",
    "PARENT_ID": "2372",
    "CODE": "450981",
    "NAME": "北流市"
  },
  {
    "ID": "2381",
    "PARENT_ID": "2292",
    "CODE": "451000",
    "NAME": "百色市"
  },
  {
    "ID": "2382",
    "PARENT_ID": "2381",
    "CODE": "451001",
    "NAME": "市辖区"
  },
  {
    "ID": "2383",
    "PARENT_ID": "2381",
    "CODE": "451002",
    "NAME": "右江区"
  },
  {
    "ID": "2384",
    "PARENT_ID": "2381",
    "CODE": "451021",
    "NAME": "田阳县"
  },
  {
    "ID": "2385",
    "PARENT_ID": "2381",
    "CODE": "451022",
    "NAME": "田东县"
  },
  {
    "ID": "2386",
    "PARENT_ID": "2381",
    "CODE": "451023",
    "NAME": "平果县"
  },
  {
    "ID": "2387",
    "PARENT_ID": "2381",
    "CODE": "451024",
    "NAME": "德保县"
  },
  {
    "ID": "2388",
    "PARENT_ID": "2381",
    "CODE": "451025",
    "NAME": "靖西县"
  },
  {
    "ID": "2389",
    "PARENT_ID": "2381",
    "CODE": "451026",
    "NAME": "那坡县"
  },
  {
    "ID": "239",
    "PARENT_ID": "234",
    "CODE": "140108",
    "NAME": "尖草坪区"
  },
  {
    "ID": "2390",
    "PARENT_ID": "2381",
    "CODE": "451027",
    "NAME": "凌云县"
  },
  {
    "ID": "2391",
    "PARENT_ID": "2381",
    "CODE": "451028",
    "NAME": "乐业县"
  },
  {
    "ID": "2392",
    "PARENT_ID": "2381",
    "CODE": "451029",
    "NAME": "田林县"
  },
  {
    "ID": "2393",
    "PARENT_ID": "2381",
    "CODE": "451030",
    "NAME": "西林县"
  },
  {
    "ID": "2394",
    "PARENT_ID": "2381",
    "CODE": "451031",
    "NAME": "隆林各族自治县"
  },
  {
    "ID": "2395",
    "PARENT_ID": "2292",
    "CODE": "451100",
    "NAME": "贺州市"
  },
  {
    "ID": "2396",
    "PARENT_ID": "2395",
    "CODE": "451101",
    "NAME": "市辖区"
  },
  {
    "ID": "2397",
    "PARENT_ID": "2395",
    "CODE": "451102",
    "NAME": "八步区"
  },
  {
    "ID": "2398",
    "PARENT_ID": "2395",
    "CODE": "451121",
    "NAME": "昭平县"
  },
  {
    "ID": "2399",
    "PARENT_ID": "2395",
    "CODE": "451122",
    "NAME": "钟山县"
  },
  {
    "ID": "24",
    "PARENT_ID": "21",
    "CODE": "120103",
    "NAME": "河西区"
  },
  {
    "ID": "240",
    "PARENT_ID": "234",
    "CODE": "140109",
    "NAME": "万柏林区"
  },
  {
    "ID": "2400",
    "PARENT_ID": "2395",
    "CODE": "451123",
    "NAME": "富川瑶族自治县"
  },
  {
    "ID": "2401",
    "PARENT_ID": "2292",
    "CODE": "451200",
    "NAME": "河池市"
  },
  {
    "ID": "2402",
    "PARENT_ID": "2401",
    "CODE": "451201",
    "NAME": "市辖区"
  },
  {
    "ID": "2403",
    "PARENT_ID": "2401",
    "CODE": "451202",
    "NAME": "金城江区"
  },
  {
    "ID": "2404",
    "PARENT_ID": "2401",
    "CODE": "451221",
    "NAME": "南丹县"
  },
  {
    "ID": "2405",
    "PARENT_ID": "2401",
    "CODE": "451222",
    "NAME": "天峨县"
  },
  {
    "ID": "2406",
    "PARENT_ID": "2401",
    "CODE": "451223",
    "NAME": "凤山县"
  },
  {
    "ID": "2407",
    "PARENT_ID": "2401",
    "CODE": "451224",
    "NAME": "东兰县"
  },
  {
    "ID": "2408",
    "PARENT_ID": "2401",
    "CODE": "451225",
    "NAME": "罗城仫佬族自治县"
  },
  {
    "ID": "2409",
    "PARENT_ID": "2401",
    "CODE": "451226",
    "NAME": "环江毛南族自治县"
  },
  {
    "ID": "241",
    "PARENT_ID": "234",
    "CODE": "140110",
    "NAME": "晋源区"
  },
  {
    "ID": "2410",
    "PARENT_ID": "2401",
    "CODE": "451227",
    "NAME": "巴马瑶族自治县"
  },
  {
    "ID": "2411",
    "PARENT_ID": "2401",
    "CODE": "451228",
    "NAME": "都安瑶族自治县"
  },
  {
    "ID": "2412",
    "PARENT_ID": "2401",
    "CODE": "451229",
    "NAME": "大化瑶族自治县"
  },
  {
    "ID": "2413",
    "PARENT_ID": "2401",
    "CODE": "451281",
    "NAME": "宜州市"
  },
  {
    "ID": "2414",
    "PARENT_ID": "2292",
    "CODE": "451300",
    "NAME": "来宾市"
  },
  {
    "ID": "2415",
    "PARENT_ID": "2414",
    "CODE": "451301",
    "NAME": "市辖区"
  },
  {
    "ID": "2416",
    "PARENT_ID": "2414",
    "CODE": "451302",
    "NAME": "兴宾区"
  },
  {
    "ID": "2417",
    "PARENT_ID": "2414",
    "CODE": "451321",
    "NAME": "忻城县"
  },
  {
    "ID": "2418",
    "PARENT_ID": "2414",
    "CODE": "451322",
    "NAME": "象州县"
  },
  {
    "ID": "2419",
    "PARENT_ID": "2414",
    "CODE": "451323",
    "NAME": "武宣县"
  },
  {
    "ID": "242",
    "PARENT_ID": "234",
    "CODE": "140121",
    "NAME": "清徐县"
  },
  {
    "ID": "2420",
    "PARENT_ID": "2414",
    "CODE": "451324",
    "NAME": "金秀瑶族自治县"
  },
  {
    "ID": "2421",
    "PARENT_ID": "2414",
    "CODE": "451381",
    "NAME": "合山市"
  },
  {
    "ID": "2422",
    "PARENT_ID": "2292",
    "CODE": "451400",
    "NAME": "崇左市"
  },
  {
    "ID": "2423",
    "PARENT_ID": "2422",
    "CODE": "451401",
    "NAME": "市辖区"
  },
  {
    "ID": "2424",
    "PARENT_ID": "2422",
    "CODE": "451402",
    "NAME": "江州区"
  },
  {
    "ID": "2425",
    "PARENT_ID": "2422",
    "CODE": "451421",
    "NAME": "扶绥县"
  },
  {
    "ID": "2426",
    "PARENT_ID": "2422",
    "CODE": "451422",
    "NAME": "宁明县"
  },
  {
    "ID": "2427",
    "PARENT_ID": "2422",
    "CODE": "451423",
    "NAME": "龙州县"
  },
  {
    "ID": "2428",
    "PARENT_ID": "2422",
    "CODE": "451424",
    "NAME": "大新县"
  },
  {
    "ID": "2429",
    "PARENT_ID": "2422",
    "CODE": "451425",
    "NAME": "天等县"
  },
  {
    "ID": "243",
    "PARENT_ID": "234",
    "CODE": "140122",
    "NAME": "阳曲县"
  },
  {
    "ID": "2430",
    "PARENT_ID": "2422",
    "CODE": "451481",
    "NAME": "凭祥市"
  },
  {
    "ID": "2431",
    "PARENT_ID": "0",
    "CODE": "460000",
    "NAME": "海南省"
  },
  {
    "ID": "2432",
    "PARENT_ID": "2431",
    "CODE": "460100",
    "NAME": "海口市"
  },
  {
    "ID": "2433",
    "PARENT_ID": "2432",
    "CODE": "460101",
    "NAME": "市辖区"
  },
  {
    "ID": "2434",
    "PARENT_ID": "2432",
    "CODE": "460105",
    "NAME": "秀英区"
  },
  {
    "ID": "2435",
    "PARENT_ID": "2432",
    "CODE": "460106",
    "NAME": "龙华区"
  },
  {
    "ID": "2436",
    "PARENT_ID": "2432",
    "CODE": "460107",
    "NAME": "琼山区"
  },
  {
    "ID": "2437",
    "PARENT_ID": "2432",
    "CODE": "460108",
    "NAME": "美兰区"
  },
  {
    "ID": "2438",
    "PARENT_ID": "2431",
    "CODE": "460200",
    "NAME": "三亚市"
  },
  {
    "ID": "2439",
    "PARENT_ID": "2438",
    "CODE": "460201",
    "NAME": "市辖区"
  },
  {
    "ID": "244",
    "PARENT_ID": "234",
    "CODE": "140123",
    "NAME": "娄烦县"
  },
  {
    "ID": "2440",
    "PARENT_ID": "2438",
    "CODE": "460202",
    "NAME": "海棠区"
  },
  {
    "ID": "2441",
    "PARENT_ID": "2438",
    "CODE": "460203",
    "NAME": "吉阳区"
  },
  {
    "ID": "2442",
    "PARENT_ID": "2438",
    "CODE": "460204",
    "NAME": "天涯区"
  },
  {
    "ID": "2443",
    "PARENT_ID": "2438",
    "CODE": "460205",
    "NAME": "崖州区"
  },
  {
    "ID": "2444",
    "PARENT_ID": "2431",
    "CODE": "460300",
    "NAME": "三沙市"
  },
  {
    "ID": "2445",
    "PARENT_ID": "2431",
    "CODE": "469000",
    "NAME": "省直辖县级行政区划"
  },
  {
    "ID": "2446",
    "PARENT_ID": "2445",
    "CODE": "469001",
    "NAME": "五指山市"
  },
  {
    "ID": "2447",
    "PARENT_ID": "2445",
    "CODE": "469002",
    "NAME": "琼海市"
  },
  {
    "ID": "2448",
    "PARENT_ID": "2445",
    "CODE": "469003",
    "NAME": "儋州市"
  },
  {
    "ID": "2449",
    "PARENT_ID": "2445",
    "CODE": "469005",
    "NAME": "文昌市"
  },
  {
    "ID": "245",
    "PARENT_ID": "234",
    "CODE": "140181",
    "NAME": "古交市"
  },
  {
    "ID": "2450",
    "PARENT_ID": "2445",
    "CODE": "469006",
    "NAME": "万宁市"
  },
  {
    "ID": "2451",
    "PARENT_ID": "2445",
    "CODE": "469007",
    "NAME": "东方市"
  },
  {
    "ID": "2452",
    "PARENT_ID": "2445",
    "CODE": "469021",
    "NAME": "定安县"
  },
  {
    "ID": "2453",
    "PARENT_ID": "2445",
    "CODE": "469022",
    "NAME": "屯昌县"
  },
  {
    "ID": "2454",
    "PARENT_ID": "2445",
    "CODE": "469023",
    "NAME": "澄迈县"
  },
  {
    "ID": "2455",
    "PARENT_ID": "2445",
    "CODE": "469024",
    "NAME": "临高县"
  },
  {
    "ID": "2456",
    "PARENT_ID": "2445",
    "CODE": "469025",
    "NAME": "白沙黎族自治县"
  },
  {
    "ID": "2457",
    "PARENT_ID": "2445",
    "CODE": "469026",
    "NAME": "昌江黎族自治县"
  },
  {
    "ID": "2458",
    "PARENT_ID": "2445",
    "CODE": "469027",
    "NAME": "乐东黎族自治县"
  },
  {
    "ID": "2459",
    "PARENT_ID": "2445",
    "CODE": "469028",
    "NAME": "陵水黎族自治县"
  },
  {
    "ID": "246",
    "PARENT_ID": "233",
    "CODE": "140200",
    "NAME": "大同市"
  },
  {
    "ID": "2460",
    "PARENT_ID": "2445",
    "CODE": "469029",
    "NAME": "保亭黎族苗族自治县"
  },
  {
    "ID": "2461",
    "PARENT_ID": "2445",
    "CODE": "469030",
    "NAME": "琼中黎族苗族自治县"
  },
  {
    "ID": "2462",
    "PARENT_ID": "0",
    "CODE": "500000",
    "NAME": "重庆市"
  },
  {
    "ID": "2463",
    "PARENT_ID": "2462",
    "CODE": "500100",
    "NAME": "市辖区(重庆)"
  },
  {
    "ID": "2464",
    "PARENT_ID": "2463",
    "CODE": "500101",
    "NAME": "万州区"
  },
  {
    "ID": "2465",
    "PARENT_ID": "2463",
    "CODE": "500102",
    "NAME": "涪陵区"
  },
  {
    "ID": "2466",
    "PARENT_ID": "2463",
    "CODE": "500103",
    "NAME": "渝中区"
  },
  {
    "ID": "2467",
    "PARENT_ID": "2463",
    "CODE": "500104",
    "NAME": "大渡口区"
  },
  {
    "ID": "2468",
    "PARENT_ID": "2463",
    "CODE": "500105",
    "NAME": "江北区"
  },
  {
    "ID": "2469",
    "PARENT_ID": "2463",
    "CODE": "500106",
    "NAME": "沙坪坝区"
  },
  {
    "ID": "247",
    "PARENT_ID": "246",
    "CODE": "140201",
    "NAME": "市辖区"
  },
  {
    "ID": "2470",
    "PARENT_ID": "2463",
    "CODE": "500107",
    "NAME": "九龙坡区"
  },
  {
    "ID": "2471",
    "PARENT_ID": "2463",
    "CODE": "500108",
    "NAME": "南岸区"
  },
  {
    "ID": "2472",
    "PARENT_ID": "2463",
    "CODE": "500109",
    "NAME": "北碚区"
  },
  {
    "ID": "2473",
    "PARENT_ID": "2463",
    "CODE": "500110",
    "NAME": "綦江区"
  },
  {
    "ID": "2474",
    "PARENT_ID": "2463",
    "CODE": "500111",
    "NAME": "大足区"
  },
  {
    "ID": "2475",
    "PARENT_ID": "2463",
    "CODE": "500112",
    "NAME": "渝北区"
  },
  {
    "ID": "2476",
    "PARENT_ID": "2463",
    "CODE": "500113",
    "NAME": "巴南区"
  },
  {
    "ID": "2477",
    "PARENT_ID": "2463",
    "CODE": "500114",
    "NAME": "黔江区"
  },
  {
    "ID": "2478",
    "PARENT_ID": "2463",
    "CODE": "500115",
    "NAME": "长寿区"
  },
  {
    "ID": "2479",
    "PARENT_ID": "2463",
    "CODE": "500116",
    "NAME": "江津区"
  },
  {
    "ID": "248",
    "PARENT_ID": "246",
    "CODE": "140202",
    "NAME": "城区"
  },
  {
    "ID": "2480",
    "PARENT_ID": "2463",
    "CODE": "500117",
    "NAME": "合川区"
  },
  {
    "ID": "2481",
    "PARENT_ID": "2463",
    "CODE": "500118",
    "NAME": "永川区"
  },
  {
    "ID": "2482",
    "PARENT_ID": "2463",
    "CODE": "500119",
    "NAME": "南川区"
  },
  {
    "ID": "2483",
    "PARENT_ID": "2463",
    "CODE": "500120",
    "NAME": "璧山区"
  },
  {
    "ID": "2484",
    "PARENT_ID": "2463",
    "CODE": "500151",
    "NAME": "铜梁区"
  },
  {
    "ID": "2485",
    "PARENT_ID": "2462",
    "CODE": "500200",
    "NAME": "县(重庆)"
  },
  {
    "ID": "2486",
    "PARENT_ID": "2485",
    "CODE": "500223",
    "NAME": "潼南县"
  },
  {
    "ID": "2487",
    "PARENT_ID": "2485",
    "CODE": "500226",
    "NAME": "荣昌县"
  },
  {
    "ID": "2488",
    "PARENT_ID": "2485",
    "CODE": "500228",
    "NAME": "梁平县"
  },
  {
    "ID": "2489",
    "PARENT_ID": "2485",
    "CODE": "500229",
    "NAME": "城口县"
  },
  {
    "ID": "249",
    "PARENT_ID": "246",
    "CODE": "140203",
    "NAME": "矿区"
  },
  {
    "ID": "2490",
    "PARENT_ID": "2485",
    "CODE": "500230",
    "NAME": "丰都县"
  },
  {
    "ID": "2491",
    "PARENT_ID": "2485",
    "CODE": "500231",
    "NAME": "垫江县"
  },
  {
    "ID": "2492",
    "PARENT_ID": "2485",
    "CODE": "500232",
    "NAME": "武隆县"
  },
  {
    "ID": "2493",
    "PARENT_ID": "2485",
    "CODE": "500233",
    "NAME": "忠县"
  },
  {
    "ID": "2494",
    "PARENT_ID": "2485",
    "CODE": "500234",
    "NAME": "开县"
  },
  {
    "ID": "2495",
    "PARENT_ID": "2485",
    "CODE": "500235",
    "NAME": "云阳县"
  },
  {
    "ID": "2496",
    "PARENT_ID": "2485",
    "CODE": "500236",
    "NAME": "奉节县"
  },
  {
    "ID": "2497",
    "PARENT_ID": "2485",
    "CODE": "500237",
    "NAME": "巫山县"
  },
  {
    "ID": "2498",
    "PARENT_ID": "2485",
    "CODE": "500238",
    "NAME": "巫溪县"
  },
  {
    "ID": "2499",
    "PARENT_ID": "2485",
    "CODE": "500240",
    "NAME": "石柱土家族自治县"
  },
  {
    "ID": "25",
    "PARENT_ID": "21",
    "CODE": "120104",
    "NAME": "南开区"
  },
  {
    "ID": "250",
    "PARENT_ID": "246",
    "CODE": "140211",
    "NAME": "南郊区"
  },
  {
    "ID": "2500",
    "PARENT_ID": "2485",
    "CODE": "500241",
    "NAME": "秀山土家族苗族自治县"
  },
  {
    "ID": "2501",
    "PARENT_ID": "2485",
    "CODE": "500242",
    "NAME": "酉阳土家族苗族自治县"
  },
  {
    "ID": "2502",
    "PARENT_ID": "2485",
    "CODE": "500243",
    "NAME": "彭水苗族土家族自治县"
  },
  {
    "ID": "2503",
    "PARENT_ID": "0",
    "CODE": "510000",
    "NAME": "四川省"
  },
  {
    "ID": "2504",
    "PARENT_ID": "2503",
    "CODE": "510100",
    "NAME": "成都市"
  },
  {
    "ID": "2505",
    "PARENT_ID": "2504",
    "CODE": "510101",
    "NAME": "市辖区"
  },
  {
    "ID": "2506",
    "PARENT_ID": "2504",
    "CODE": "510104",
    "NAME": "锦江区"
  },
  {
    "ID": "2507",
    "PARENT_ID": "2504",
    "CODE": "510105",
    "NAME": "青羊区"
  },
  {
    "ID": "2508",
    "PARENT_ID": "2504",
    "CODE": "510106",
    "NAME": "金牛区"
  },
  {
    "ID": "2509",
    "PARENT_ID": "2504",
    "CODE": "510107",
    "NAME": "武侯区"
  },
  {
    "ID": "251",
    "PARENT_ID": "246",
    "CODE": "140212",
    "NAME": "新荣区"
  },
  {
    "ID": "2510",
    "PARENT_ID": "2504",
    "CODE": "510108",
    "NAME": "成华区"
  },
  {
    "ID": "2511",
    "PARENT_ID": "2504",
    "CODE": "510112",
    "NAME": "龙泉驿区"
  },
  {
    "ID": "2512",
    "PARENT_ID": "2504",
    "CODE": "510113",
    "NAME": "青白江区"
  },
  {
    "ID": "2513",
    "PARENT_ID": "2504",
    "CODE": "510114",
    "NAME": "新都区"
  },
  {
    "ID": "2514",
    "PARENT_ID": "2504",
    "CODE": "510115",
    "NAME": "温江区"
  },
  {
    "ID": "2515",
    "PARENT_ID": "2504",
    "CODE": "510121",
    "NAME": "金堂县"
  },
  {
    "ID": "2516",
    "PARENT_ID": "2504",
    "CODE": "510122",
    "NAME": "双流县"
  },
  {
    "ID": "2517",
    "PARENT_ID": "2504",
    "CODE": "510124",
    "NAME": "郫县"
  },
  {
    "ID": "2518",
    "PARENT_ID": "2504",
    "CODE": "510129",
    "NAME": "大邑县"
  },
  {
    "ID": "2519",
    "PARENT_ID": "2504",
    "CODE": "510131",
    "NAME": "蒲江县"
  },
  {
    "ID": "252",
    "PARENT_ID": "246",
    "CODE": "140221",
    "NAME": "阳高县"
  },
  {
    "ID": "2520",
    "PARENT_ID": "2504",
    "CODE": "510132",
    "NAME": "新津县"
  },
  {
    "ID": "2521",
    "PARENT_ID": "2504",
    "CODE": "510181",
    "NAME": "都江堰市"
  },
  {
    "ID": "2522",
    "PARENT_ID": "2504",
    "CODE": "510182",
    "NAME": "彭州市"
  },
  {
    "ID": "2523",
    "PARENT_ID": "2504",
    "CODE": "510183",
    "NAME": "邛崃市"
  },
  {
    "ID": "2524",
    "PARENT_ID": "2504",
    "CODE": "510184",
    "NAME": "崇州市"
  },
  {
    "ID": "2525",
    "PARENT_ID": "2503",
    "CODE": "510300",
    "NAME": "自贡市"
  },
  {
    "ID": "2526",
    "PARENT_ID": "2525",
    "CODE": "510301",
    "NAME": "市辖区"
  },
  {
    "ID": "2527",
    "PARENT_ID": "2525",
    "CODE": "510302",
    "NAME": "自流井区"
  },
  {
    "ID": "2528",
    "PARENT_ID": "2525",
    "CODE": "510303",
    "NAME": "贡井区"
  },
  {
    "ID": "2529",
    "PARENT_ID": "2525",
    "CODE": "510304",
    "NAME": "大安区"
  },
  {
    "ID": "253",
    "PARENT_ID": "246",
    "CODE": "140222",
    "NAME": "天镇县"
  },
  {
    "ID": "2530",
    "PARENT_ID": "2525",
    "CODE": "510311",
    "NAME": "沿滩区"
  },
  {
    "ID": "2531",
    "PARENT_ID": "2525",
    "CODE": "510321",
    "NAME": "荣县"
  },
  {
    "ID": "2532",
    "PARENT_ID": "2525",
    "CODE": "510322",
    "NAME": "富顺县"
  },
  {
    "ID": "2533",
    "PARENT_ID": "2503",
    "CODE": "510400",
    "NAME": "攀枝花市"
  },
  {
    "ID": "2534",
    "PARENT_ID": "2533",
    "CODE": "510401",
    "NAME": "市辖区"
  },
  {
    "ID": "2535",
    "PARENT_ID": "2533",
    "CODE": "510402",
    "NAME": "东区"
  },
  {
    "ID": "2536",
    "PARENT_ID": "2533",
    "CODE": "510403",
    "NAME": "西区"
  },
  {
    "ID": "2537",
    "PARENT_ID": "2533",
    "CODE": "510411",
    "NAME": "仁和区"
  },
  {
    "ID": "2538",
    "PARENT_ID": "2533",
    "CODE": "510421",
    "NAME": "米易县"
  },
  {
    "ID": "2539",
    "PARENT_ID": "2533",
    "CODE": "510422",
    "NAME": "盐边县"
  },
  {
    "ID": "254",
    "PARENT_ID": "246",
    "CODE": "140223",
    "NAME": "广灵县"
  },
  {
    "ID": "2540",
    "PARENT_ID": "2503",
    "CODE": "510500",
    "NAME": "泸州市"
  },
  {
    "ID": "2541",
    "PARENT_ID": "2540",
    "CODE": "510501",
    "NAME": "市辖区"
  },
  {
    "ID": "2542",
    "PARENT_ID": "2540",
    "CODE": "510502",
    "NAME": "江阳区"
  },
  {
    "ID": "2543",
    "PARENT_ID": "2540",
    "CODE": "510503",
    "NAME": "纳溪区"
  },
  {
    "ID": "2544",
    "PARENT_ID": "2540",
    "CODE": "510504",
    "NAME": "龙马潭区"
  },
  {
    "ID": "2545",
    "PARENT_ID": "2540",
    "CODE": "510521",
    "NAME": "泸县"
  },
  {
    "ID": "2546",
    "PARENT_ID": "2540",
    "CODE": "510522",
    "NAME": "合江县"
  },
  {
    "ID": "2547",
    "PARENT_ID": "2540",
    "CODE": "510524",
    "NAME": "叙永县"
  },
  {
    "ID": "2548",
    "PARENT_ID": "2540",
    "CODE": "510525",
    "NAME": "古蔺县"
  },
  {
    "ID": "2549",
    "PARENT_ID": "2503",
    "CODE": "510600",
    "NAME": "德阳市"
  },
  {
    "ID": "255",
    "PARENT_ID": "246",
    "CODE": "140224",
    "NAME": "灵丘县"
  },
  {
    "ID": "2550",
    "PARENT_ID": "2549",
    "CODE": "510601",
    "NAME": "市辖区"
  },
  {
    "ID": "2551",
    "PARENT_ID": "2549",
    "CODE": "510603",
    "NAME": "旌阳区"
  },
  {
    "ID": "2552",
    "PARENT_ID": "2549",
    "CODE": "510623",
    "NAME": "中江县"
  },
  {
    "ID": "2553",
    "PARENT_ID": "2549",
    "CODE": "510626",
    "NAME": "罗江县"
  },
  {
    "ID": "2554",
    "PARENT_ID": "2549",
    "CODE": "510681",
    "NAME": "广汉市"
  },
  {
    "ID": "2555",
    "PARENT_ID": "2549",
    "CODE": "510682",
    "NAME": "什邡市"
  },
  {
    "ID": "2556",
    "PARENT_ID": "2549",
    "CODE": "510683",
    "NAME": "绵竹市"
  },
  {
    "ID": "2557",
    "PARENT_ID": "2503",
    "CODE": "510700",
    "NAME": "绵阳市"
  },
  {
    "ID": "2558",
    "PARENT_ID": "2557",
    "CODE": "510701",
    "NAME": "市辖区"
  },
  {
    "ID": "2559",
    "PARENT_ID": "2557",
    "CODE": "510703",
    "NAME": "涪城区"
  },
  {
    "ID": "256",
    "PARENT_ID": "246",
    "CODE": "140225",
    "NAME": "浑源县"
  },
  {
    "ID": "2560",
    "PARENT_ID": "2557",
    "CODE": "510704",
    "NAME": "游仙区"
  },
  {
    "ID": "2561",
    "PARENT_ID": "2557",
    "CODE": "510722",
    "NAME": "三台县"
  },
  {
    "ID": "2562",
    "PARENT_ID": "2557",
    "CODE": "510723",
    "NAME": "盐亭县"
  },
  {
    "ID": "2563",
    "PARENT_ID": "2557",
    "CODE": "510724",
    "NAME": "安县"
  },
  {
    "ID": "2564",
    "PARENT_ID": "2557",
    "CODE": "510725",
    "NAME": "梓潼县"
  },
  {
    "ID": "2565",
    "PARENT_ID": "2557",
    "CODE": "510726",
    "NAME": "北川羌族自治县"
  },
  {
    "ID": "2566",
    "PARENT_ID": "2557",
    "CODE": "510727",
    "NAME": "平武县"
  },
  {
    "ID": "2567",
    "PARENT_ID": "2557",
    "CODE": "510781",
    "NAME": "江油市"
  },
  {
    "ID": "2568",
    "PARENT_ID": "2503",
    "CODE": "510800",
    "NAME": "广元市"
  },
  {
    "ID": "2569",
    "PARENT_ID": "2568",
    "CODE": "510801",
    "NAME": "市辖区"
  },
  {
    "ID": "257",
    "PARENT_ID": "246",
    "CODE": "140226",
    "NAME": "左云县"
  },
  {
    "ID": "2570",
    "PARENT_ID": "2568",
    "CODE": "510802",
    "NAME": "利州区"
  },
  {
    "ID": "2571",
    "PARENT_ID": "2568",
    "CODE": "510811",
    "NAME": "昭化区"
  },
  {
    "ID": "2572",
    "PARENT_ID": "2568",
    "CODE": "510812",
    "NAME": "朝天区"
  },
  {
    "ID": "2573",
    "PARENT_ID": "2568",
    "CODE": "510821",
    "NAME": "旺苍县"
  },
  {
    "ID": "2574",
    "PARENT_ID": "2568",
    "CODE": "510822",
    "NAME": "青川县"
  },
  {
    "ID": "2575",
    "PARENT_ID": "2568",
    "CODE": "510823",
    "NAME": "剑阁县"
  },
  {
    "ID": "2576",
    "PARENT_ID": "2568",
    "CODE": "510824",
    "NAME": "苍溪县"
  },
  {
    "ID": "2577",
    "PARENT_ID": "2503",
    "CODE": "510900",
    "NAME": "遂宁市"
  },
  {
    "ID": "2578",
    "PARENT_ID": "2577",
    "CODE": "510901",
    "NAME": "市辖区"
  },
  {
    "ID": "2579",
    "PARENT_ID": "2577",
    "CODE": "510903",
    "NAME": "船山区"
  },
  {
    "ID": "258",
    "PARENT_ID": "246",
    "CODE": "140227",
    "NAME": "大同县"
  },
  {
    "ID": "2580",
    "PARENT_ID": "2577",
    "CODE": "510904",
    "NAME": "安居区"
  },
  {
    "ID": "2581",
    "PARENT_ID": "2577",
    "CODE": "510921",
    "NAME": "蓬溪县"
  },
  {
    "ID": "2582",
    "PARENT_ID": "2577",
    "CODE": "510922",
    "NAME": "射洪县"
  },
  {
    "ID": "2583",
    "PARENT_ID": "2577",
    "CODE": "510923",
    "NAME": "大英县"
  },
  {
    "ID": "2584",
    "PARENT_ID": "2503",
    "CODE": "511000",
    "NAME": "内江市"
  },
  {
    "ID": "2585",
    "PARENT_ID": "2584",
    "CODE": "511001",
    "NAME": "市辖区"
  },
  {
    "ID": "2586",
    "PARENT_ID": "2584",
    "CODE": "511002",
    "NAME": "市中区"
  },
  {
    "ID": "2587",
    "PARENT_ID": "2584",
    "CODE": "511011",
    "NAME": "东兴区"
  },
  {
    "ID": "2588",
    "PARENT_ID": "2584",
    "CODE": "511024",
    "NAME": "威远县"
  },
  {
    "ID": "2589",
    "PARENT_ID": "2584",
    "CODE": "511025",
    "NAME": "资中县"
  },
  {
    "ID": "259",
    "PARENT_ID": "233",
    "CODE": "140300",
    "NAME": "阳泉市"
  },
  {
    "ID": "2590",
    "PARENT_ID": "2584",
    "CODE": "511028",
    "NAME": "隆昌县"
  },
  {
    "ID": "2591",
    "PARENT_ID": "2503",
    "CODE": "511100",
    "NAME": "乐山市"
  },
  {
    "ID": "2592",
    "PARENT_ID": "2591",
    "CODE": "511101",
    "NAME": "市辖区"
  },
  {
    "ID": "2593",
    "PARENT_ID": "2591",
    "CODE": "511102",
    "NAME": "市中区"
  },
  {
    "ID": "2594",
    "PARENT_ID": "2591",
    "CODE": "511111",
    "NAME": "沙湾区"
  },
  {
    "ID": "2595",
    "PARENT_ID": "2591",
    "CODE": "511112",
    "NAME": "五通桥区"
  },
  {
    "ID": "2596",
    "PARENT_ID": "2591",
    "CODE": "511113",
    "NAME": "金口河区"
  },
  {
    "ID": "2597",
    "PARENT_ID": "2591",
    "CODE": "511123",
    "NAME": "犍为县"
  },
  {
    "ID": "2598",
    "PARENT_ID": "2591",
    "CODE": "511124",
    "NAME": "井研县"
  },
  {
    "ID": "2599",
    "PARENT_ID": "2591",
    "CODE": "511126",
    "NAME": "夹江县"
  },
  {
    "ID": "26",
    "PARENT_ID": "21",
    "CODE": "120105",
    "NAME": "河北区"
  },
  {
    "ID": "260",
    "PARENT_ID": "259",
    "CODE": "140301",
    "NAME": "市辖区"
  },
  {
    "ID": "2600",
    "PARENT_ID": "2591",
    "CODE": "511129",
    "NAME": "沐川县"
  },
  {
    "ID": "2601",
    "PARENT_ID": "2591",
    "CODE": "511132",
    "NAME": "峨边彝族自治县"
  },
  {
    "ID": "2602",
    "PARENT_ID": "2591",
    "CODE": "511133",
    "NAME": "马边彝族自治县"
  },
  {
    "ID": "2603",
    "PARENT_ID": "2591",
    "CODE": "511181",
    "NAME": "峨眉山市"
  },
  {
    "ID": "2604",
    "PARENT_ID": "2503",
    "CODE": "511300",
    "NAME": "南充市"
  },
  {
    "ID": "2605",
    "PARENT_ID": "2604",
    "CODE": "511301",
    "NAME": "市辖区"
  },
  {
    "ID": "2606",
    "PARENT_ID": "2604",
    "CODE": "511302",
    "NAME": "顺庆区"
  },
  {
    "ID": "2607",
    "PARENT_ID": "2604",
    "CODE": "511303",
    "NAME": "高坪区"
  },
  {
    "ID": "2608",
    "PARENT_ID": "2604",
    "CODE": "511304",
    "NAME": "嘉陵区"
  },
  {
    "ID": "2609",
    "PARENT_ID": "2604",
    "CODE": "511321",
    "NAME": "南部县"
  },
  {
    "ID": "261",
    "PARENT_ID": "259",
    "CODE": "140302",
    "NAME": "城区"
  },
  {
    "ID": "2610",
    "PARENT_ID": "2604",
    "CODE": "511322",
    "NAME": "营山县"
  },
  {
    "ID": "2611",
    "PARENT_ID": "2604",
    "CODE": "511323",
    "NAME": "蓬安县"
  },
  {
    "ID": "2612",
    "PARENT_ID": "2604",
    "CODE": "511324",
    "NAME": "仪陇县"
  },
  {
    "ID": "2613",
    "PARENT_ID": "2604",
    "CODE": "511325",
    "NAME": "西充县"
  },
  {
    "ID": "2614",
    "PARENT_ID": "2604",
    "CODE": "511381",
    "NAME": "阆中市"
  },
  {
    "ID": "2615",
    "PARENT_ID": "2503",
    "CODE": "511400",
    "NAME": "眉山市"
  },
  {
    "ID": "2616",
    "PARENT_ID": "2615",
    "CODE": "511401",
    "NAME": "市辖区"
  },
  {
    "ID": "2617",
    "PARENT_ID": "2615",
    "CODE": "511402",
    "NAME": "东坡区"
  },
  {
    "ID": "2618",
    "PARENT_ID": "2615",
    "CODE": "511421",
    "NAME": "仁寿县"
  },
  {
    "ID": "2619",
    "PARENT_ID": "2615",
    "CODE": "511422",
    "NAME": "彭山县"
  },
  {
    "ID": "262",
    "PARENT_ID": "259",
    "CODE": "140303",
    "NAME": "矿区"
  },
  {
    "ID": "2620",
    "PARENT_ID": "2615",
    "CODE": "511423",
    "NAME": "洪雅县"
  },
  {
    "ID": "2621",
    "PARENT_ID": "2615",
    "CODE": "511424",
    "NAME": "丹棱县"
  },
  {
    "ID": "2622",
    "PARENT_ID": "2615",
    "CODE": "511425",
    "NAME": "青神县"
  },
  {
    "ID": "2623",
    "PARENT_ID": "2503",
    "CODE": "511500",
    "NAME": "宜宾市"
  },
  {
    "ID": "2624",
    "PARENT_ID": "2623",
    "CODE": "511501",
    "NAME": "市辖区"
  },
  {
    "ID": "2625",
    "PARENT_ID": "2623",
    "CODE": "511502",
    "NAME": "翠屏区"
  },
  {
    "ID": "2626",
    "PARENT_ID": "2623",
    "CODE": "511503",
    "NAME": "南溪区"
  },
  {
    "ID": "2627",
    "PARENT_ID": "2623",
    "CODE": "511521",
    "NAME": "宜宾县"
  },
  {
    "ID": "2628",
    "PARENT_ID": "2623",
    "CODE": "511523",
    "NAME": "江安县"
  },
  {
    "ID": "2629",
    "PARENT_ID": "2623",
    "CODE": "511524",
    "NAME": "长宁县"
  },
  {
    "ID": "263",
    "PARENT_ID": "259",
    "CODE": "140311",
    "NAME": "郊区"
  },
  {
    "ID": "2630",
    "PARENT_ID": "2623",
    "CODE": "511525",
    "NAME": "高县"
  },
  {
    "ID": "2631",
    "PARENT_ID": "2623",
    "CODE": "511526",
    "NAME": "珙县"
  },
  {
    "ID": "2632",
    "PARENT_ID": "2623",
    "CODE": "511527",
    "NAME": "筠连县"
  },
  {
    "ID": "2633",
    "PARENT_ID": "2623",
    "CODE": "511528",
    "NAME": "兴文县"
  },
  {
    "ID": "2634",
    "PARENT_ID": "2623",
    "CODE": "511529",
    "NAME": "屏山县"
  },
  {
    "ID": "2635",
    "PARENT_ID": "2503",
    "CODE": "511600",
    "NAME": "广安市"
  },
  {
    "ID": "2636",
    "PARENT_ID": "2635",
    "CODE": "511601",
    "NAME": "市辖区"
  },
  {
    "ID": "2637",
    "PARENT_ID": "2635",
    "CODE": "511602",
    "NAME": "广安区"
  },
  {
    "ID": "2638",
    "PARENT_ID": "2635",
    "CODE": "511603",
    "NAME": "前锋区"
  },
  {
    "ID": "2639",
    "PARENT_ID": "2635",
    "CODE": "511621",
    "NAME": "岳池县"
  },
  {
    "ID": "264",
    "PARENT_ID": "259",
    "CODE": "140321",
    "NAME": "平定县"
  },
  {
    "ID": "2640",
    "PARENT_ID": "2635",
    "CODE": "511622",
    "NAME": "武胜县"
  },
  {
    "ID": "2641",
    "PARENT_ID": "2635",
    "CODE": "511623",
    "NAME": "邻水县"
  },
  {
    "ID": "2642",
    "PARENT_ID": "2635",
    "CODE": "511681",
    "NAME": "华蓥市"
  },
  {
    "ID": "2643",
    "PARENT_ID": "2503",
    "CODE": "511700",
    "NAME": "达州市"
  },
  {
    "ID": "2644",
    "PARENT_ID": "2643",
    "CODE": "511701",
    "NAME": "市辖区"
  },
  {
    "ID": "2645",
    "PARENT_ID": "2643",
    "CODE": "511702",
    "NAME": "通川区"
  },
  {
    "ID": "2646",
    "PARENT_ID": "2643",
    "CODE": "511703",
    "NAME": "达川区"
  },
  {
    "ID": "2647",
    "PARENT_ID": "2643",
    "CODE": "511722",
    "NAME": "宣汉县"
  },
  {
    "ID": "2648",
    "PARENT_ID": "2643",
    "CODE": "511723",
    "NAME": "开江县"
  },
  {
    "ID": "2649",
    "PARENT_ID": "2643",
    "CODE": "511724",
    "NAME": "大竹县"
  },
  {
    "ID": "265",
    "PARENT_ID": "259",
    "CODE": "140322",
    "NAME": "盂县"
  },
  {
    "ID": "2650",
    "PARENT_ID": "2643",
    "CODE": "511725",
    "NAME": "渠县"
  },
  {
    "ID": "2651",
    "PARENT_ID": "2643",
    "CODE": "511781",
    "NAME": "万源市"
  },
  {
    "ID": "2652",
    "PARENT_ID": "2503",
    "CODE": "511800",
    "NAME": "雅安市"
  },
  {
    "ID": "2653",
    "PARENT_ID": "2652",
    "CODE": "511801",
    "NAME": "市辖区"
  },
  {
    "ID": "2654",
    "PARENT_ID": "2652",
    "CODE": "511802",
    "NAME": "雨城区"
  },
  {
    "ID": "2655",
    "PARENT_ID": "2652",
    "CODE": "511803",
    "NAME": "名山区"
  },
  {
    "ID": "2656",
    "PARENT_ID": "2652",
    "CODE": "511822",
    "NAME": "荥经县"
  },
  {
    "ID": "2657",
    "PARENT_ID": "2652",
    "CODE": "511823",
    "NAME": "汉源县"
  },
  {
    "ID": "2658",
    "PARENT_ID": "2652",
    "CODE": "511824",
    "NAME": "石棉县"
  },
  {
    "ID": "2659",
    "PARENT_ID": "2652",
    "CODE": "511825",
    "NAME": "天全县"
  },
  {
    "ID": "266",
    "PARENT_ID": "233",
    "CODE": "140400",
    "NAME": "长治市"
  },
  {
    "ID": "2660",
    "PARENT_ID": "2652",
    "CODE": "511826",
    "NAME": "芦山县"
  },
  {
    "ID": "2661",
    "PARENT_ID": "2652",
    "CODE": "511827",
    "NAME": "宝兴县"
  },
  {
    "ID": "2662",
    "PARENT_ID": "2503",
    "CODE": "511900",
    "NAME": "巴中市"
  },
  {
    "ID": "2663",
    "PARENT_ID": "2662",
    "CODE": "511901",
    "NAME": "市辖区"
  },
  {
    "ID": "2664",
    "PARENT_ID": "2662",
    "CODE": "511902",
    "NAME": "巴州区"
  },
  {
    "ID": "2665",
    "PARENT_ID": "2662",
    "CODE": "511903",
    "NAME": "恩阳区"
  },
  {
    "ID": "2666",
    "PARENT_ID": "2662",
    "CODE": "511921",
    "NAME": "通江县"
  },
  {
    "ID": "2667",
    "PARENT_ID": "2662",
    "CODE": "511922",
    "NAME": "南江县"
  },
  {
    "ID": "2668",
    "PARENT_ID": "2662",
    "CODE": "511923",
    "NAME": "平昌县"
  },
  {
    "ID": "2669",
    "PARENT_ID": "2503",
    "CODE": "512000",
    "NAME": "资阳市"
  },
  {
    "ID": "267",
    "PARENT_ID": "266",
    "CODE": "140401",
    "NAME": "市辖区"
  },
  {
    "ID": "2670",
    "PARENT_ID": "2669",
    "CODE": "512001",
    "NAME": "市辖区"
  },
  {
    "ID": "2671",
    "PARENT_ID": "2669",
    "CODE": "512002",
    "NAME": "雁江区"
  },
  {
    "ID": "2672",
    "PARENT_ID": "2669",
    "CODE": "512021",
    "NAME": "安岳县"
  },
  {
    "ID": "2673",
    "PARENT_ID": "2669",
    "CODE": "512022",
    "NAME": "乐至县"
  },
  {
    "ID": "2674",
    "PARENT_ID": "2669",
    "CODE": "512081",
    "NAME": "简阳市"
  },
  {
    "ID": "2675",
    "PARENT_ID": "2503",
    "CODE": "513200",
    "NAME": "阿坝藏族羌族自治州"
  },
  {
    "ID": "2676",
    "PARENT_ID": "2675",
    "CODE": "513221",
    "NAME": "汶川县"
  },
  {
    "ID": "2677",
    "PARENT_ID": "2675",
    "CODE": "513222",
    "NAME": "理县"
  },
  {
    "ID": "2678",
    "PARENT_ID": "2675",
    "CODE": "513223",
    "NAME": "茂县"
  },
  {
    "ID": "2679",
    "PARENT_ID": "2675",
    "CODE": "513224",
    "NAME": "松潘县"
  },
  {
    "ID": "268",
    "PARENT_ID": "266",
    "CODE": "140402",
    "NAME": "城区"
  },
  {
    "ID": "2680",
    "PARENT_ID": "2675",
    "CODE": "513225",
    "NAME": "九寨沟县"
  },
  {
    "ID": "2681",
    "PARENT_ID": "2675",
    "CODE": "513226",
    "NAME": "金川县"
  },
  {
    "ID": "2682",
    "PARENT_ID": "2675",
    "CODE": "513227",
    "NAME": "小金县"
  },
  {
    "ID": "2683",
    "PARENT_ID": "2675",
    "CODE": "513228",
    "NAME": "黑水县"
  },
  {
    "ID": "2684",
    "PARENT_ID": "2675",
    "CODE": "513229",
    "NAME": "马尔康县"
  },
  {
    "ID": "2685",
    "PARENT_ID": "2675",
    "CODE": "513230",
    "NAME": "壤塘县"
  },
  {
    "ID": "2686",
    "PARENT_ID": "2675",
    "CODE": "513231",
    "NAME": "阿坝县"
  },
  {
    "ID": "2687",
    "PARENT_ID": "2675",
    "CODE": "513232",
    "NAME": "若尔盖县"
  },
  {
    "ID": "2688",
    "PARENT_ID": "2675",
    "CODE": "513233",
    "NAME": "红原县"
  },
  {
    "ID": "2689",
    "PARENT_ID": "2503",
    "CODE": "513300",
    "NAME": "甘孜藏族自治州"
  },
  {
    "ID": "269",
    "PARENT_ID": "266",
    "CODE": "140411",
    "NAME": "郊区"
  },
  {
    "ID": "2690",
    "PARENT_ID": "2689",
    "CODE": "513321",
    "NAME": "康定县"
  },
  {
    "ID": "2691",
    "PARENT_ID": "2689",
    "CODE": "513322",
    "NAME": "泸定县"
  },
  {
    "ID": "2692",
    "PARENT_ID": "2689",
    "CODE": "513323",
    "NAME": "丹巴县"
  },
  {
    "ID": "2693",
    "PARENT_ID": "2689",
    "CODE": "513324",
    "NAME": "九龙县"
  },
  {
    "ID": "2694",
    "PARENT_ID": "2689",
    "CODE": "513325",
    "NAME": "雅江县"
  },
  {
    "ID": "2695",
    "PARENT_ID": "2689",
    "CODE": "513326",
    "NAME": "道孚县"
  },
  {
    "ID": "2696",
    "PARENT_ID": "2689",
    "CODE": "513327",
    "NAME": "炉霍县"
  },
  {
    "ID": "2697",
    "PARENT_ID": "2689",
    "CODE": "513328",
    "NAME": "甘孜县"
  },
  {
    "ID": "2698",
    "PARENT_ID": "2689",
    "CODE": "513329",
    "NAME": "新龙县"
  },
  {
    "ID": "2699",
    "PARENT_ID": "2689",
    "CODE": "513330",
    "NAME": "德格县"
  },
  {
    "ID": "27",
    "PARENT_ID": "21",
    "CODE": "120106",
    "NAME": "红桥区"
  },
  {
    "ID": "270",
    "PARENT_ID": "266",
    "CODE": "140421",
    "NAME": "长治县"
  },
  {
    "ID": "2700",
    "PARENT_ID": "2689",
    "CODE": "513331",
    "NAME": "白玉县"
  },
  {
    "ID": "2701",
    "PARENT_ID": "2689",
    "CODE": "513332",
    "NAME": "石渠县"
  },
  {
    "ID": "2702",
    "PARENT_ID": "2689",
    "CODE": "513333",
    "NAME": "色达县"
  },
  {
    "ID": "2703",
    "PARENT_ID": "2689",
    "CODE": "513334",
    "NAME": "理塘县"
  },
  {
    "ID": "2704",
    "PARENT_ID": "2689",
    "CODE": "513335",
    "NAME": "巴塘县"
  },
  {
    "ID": "2705",
    "PARENT_ID": "2689",
    "CODE": "513336",
    "NAME": "乡城县"
  },
  {
    "ID": "2706",
    "PARENT_ID": "2689",
    "CODE": "513337",
    "NAME": "稻城县"
  },
  {
    "ID": "2707",
    "PARENT_ID": "2689",
    "CODE": "513338",
    "NAME": "得荣县"
  },
  {
    "ID": "2708",
    "PARENT_ID": "2503",
    "CODE": "513400",
    "NAME": "凉山彝族自治州"
  },
  {
    "ID": "2709",
    "PARENT_ID": "2708",
    "CODE": "513401",
    "NAME": "西昌市"
  },
  {
    "ID": "271",
    "PARENT_ID": "266",
    "CODE": "140423",
    "NAME": "襄垣县"
  },
  {
    "ID": "2710",
    "PARENT_ID": "2708",
    "CODE": "513422",
    "NAME": "木里藏族自治县"
  },
  {
    "ID": "2711",
    "PARENT_ID": "2708",
    "CODE": "513423",
    "NAME": "盐源县"
  },
  {
    "ID": "2712",
    "PARENT_ID": "2708",
    "CODE": "513424",
    "NAME": "德昌县"
  },
  {
    "ID": "2713",
    "PARENT_ID": "2708",
    "CODE": "513425",
    "NAME": "会理县"
  },
  {
    "ID": "2714",
    "PARENT_ID": "2708",
    "CODE": "513426",
    "NAME": "会东县"
  },
  {
    "ID": "2715",
    "PARENT_ID": "2708",
    "CODE": "513427",
    "NAME": "宁南县"
  },
  {
    "ID": "2716",
    "PARENT_ID": "2708",
    "CODE": "513428",
    "NAME": "普格县"
  },
  {
    "ID": "2717",
    "PARENT_ID": "2708",
    "CODE": "513429",
    "NAME": "布拖县"
  },
  {
    "ID": "2718",
    "PARENT_ID": "2708",
    "CODE": "513430",
    "NAME": "金阳县"
  },
  {
    "ID": "2719",
    "PARENT_ID": "2708",
    "CODE": "513431",
    "NAME": "昭觉县"
  },
  {
    "ID": "272",
    "PARENT_ID": "266",
    "CODE": "140424",
    "NAME": "屯留县"
  },
  {
    "ID": "2720",
    "PARENT_ID": "2708",
    "CODE": "513432",
    "NAME": "喜德县"
  },
  {
    "ID": "2721",
    "PARENT_ID": "2708",
    "CODE": "513433",
    "NAME": "冕宁县"
  },
  {
    "ID": "2722",
    "PARENT_ID": "2708",
    "CODE": "513434",
    "NAME": "越西县"
  },
  {
    "ID": "2723",
    "PARENT_ID": "2708",
    "CODE": "513435",
    "NAME": "甘洛县"
  },
  {
    "ID": "2724",
    "PARENT_ID": "2708",
    "CODE": "513436",
    "NAME": "美姑县"
  },
  {
    "ID": "2725",
    "PARENT_ID": "2708",
    "CODE": "513437",
    "NAME": "雷波县"
  },
  {
    "ID": "2726",
    "PARENT_ID": "0",
    "CODE": "520000",
    "NAME": "贵州省"
  },
  {
    "ID": "2727",
    "PARENT_ID": "2726",
    "CODE": "520100",
    "NAME": "贵阳市"
  },
  {
    "ID": "2728",
    "PARENT_ID": "2727",
    "CODE": "520101",
    "NAME": "市辖区"
  },
  {
    "ID": "2729",
    "PARENT_ID": "2727",
    "CODE": "520102",
    "NAME": "南明区"
  },
  {
    "ID": "273",
    "PARENT_ID": "266",
    "CODE": "140425",
    "NAME": "平顺县"
  },
  {
    "ID": "2730",
    "PARENT_ID": "2727",
    "CODE": "520103",
    "NAME": "云岩区"
  },
  {
    "ID": "2731",
    "PARENT_ID": "2727",
    "CODE": "520111",
    "NAME": "花溪区"
  },
  {
    "ID": "2732",
    "PARENT_ID": "2727",
    "CODE": "520112",
    "NAME": "乌当区"
  },
  {
    "ID": "2733",
    "PARENT_ID": "2727",
    "CODE": "520113",
    "NAME": "白云区"
  },
  {
    "ID": "2734",
    "PARENT_ID": "2727",
    "CODE": "520115",
    "NAME": "观山湖区"
  },
  {
    "ID": "2735",
    "PARENT_ID": "2727",
    "CODE": "520121",
    "NAME": "开阳县"
  },
  {
    "ID": "2736",
    "PARENT_ID": "2727",
    "CODE": "520122",
    "NAME": "息烽县"
  },
  {
    "ID": "2737",
    "PARENT_ID": "2727",
    "CODE": "520123",
    "NAME": "修文县"
  },
  {
    "ID": "2738",
    "PARENT_ID": "2727",
    "CODE": "520181",
    "NAME": "清镇市"
  },
  {
    "ID": "2739",
    "PARENT_ID": "2726",
    "CODE": "520200",
    "NAME": "六盘水市"
  },
  {
    "ID": "274",
    "PARENT_ID": "266",
    "CODE": "140426",
    "NAME": "黎城县"
  },
  {
    "ID": "2740",
    "PARENT_ID": "2739",
    "CODE": "520201",
    "NAME": "钟山区"
  },
  {
    "ID": "2741",
    "PARENT_ID": "2739",
    "CODE": "520203",
    "NAME": "六枝特区"
  },
  {
    "ID": "2742",
    "PARENT_ID": "2739",
    "CODE": "520221",
    "NAME": "水城县"
  },
  {
    "ID": "2743",
    "PARENT_ID": "2739",
    "CODE": "520222",
    "NAME": "盘县"
  },
  {
    "ID": "2744",
    "PARENT_ID": "2726",
    "CODE": "520300",
    "NAME": "遵义市"
  },
  {
    "ID": "2745",
    "PARENT_ID": "2744",
    "CODE": "520301",
    "NAME": "市辖区"
  },
  {
    "ID": "2746",
    "PARENT_ID": "2744",
    "CODE": "520302",
    "NAME": "红花岗区"
  },
  {
    "ID": "2747",
    "PARENT_ID": "2744",
    "CODE": "520303",
    "NAME": "汇川区"
  },
  {
    "ID": "2748",
    "PARENT_ID": "2744",
    "CODE": "520321",
    "NAME": "遵义县"
  },
  {
    "ID": "2749",
    "PARENT_ID": "2744",
    "CODE": "520322",
    "NAME": "桐梓县"
  },
  {
    "ID": "275",
    "PARENT_ID": "266",
    "CODE": "140427",
    "NAME": "壶关县"
  },
  {
    "ID": "2750",
    "PARENT_ID": "2744",
    "CODE": "520323",
    "NAME": "绥阳县"
  },
  {
    "ID": "2751",
    "PARENT_ID": "2744",
    "CODE": "520324",
    "NAME": "正安县"
  },
  {
    "ID": "2752",
    "PARENT_ID": "2744",
    "CODE": "520325",
    "NAME": "道真仡佬族苗族自治县"
  },
  {
    "ID": "2753",
    "PARENT_ID": "2744",
    "CODE": "520326",
    "NAME": "务川仡佬族苗族自治县"
  },
  {
    "ID": "2754",
    "PARENT_ID": "2744",
    "CODE": "520327",
    "NAME": "凤冈县"
  },
  {
    "ID": "2755",
    "PARENT_ID": "2744",
    "CODE": "520328",
    "NAME": "湄潭县"
  },
  {
    "ID": "2756",
    "PARENT_ID": "2744",
    "CODE": "520329",
    "NAME": "余庆县"
  },
  {
    "ID": "2757",
    "PARENT_ID": "2744",
    "CODE": "520330",
    "NAME": "习水县"
  },
  {
    "ID": "2758",
    "PARENT_ID": "2744",
    "CODE": "520381",
    "NAME": "赤水市"
  },
  {
    "ID": "2759",
    "PARENT_ID": "2744",
    "CODE": "520382",
    "NAME": "仁怀市"
  },
  {
    "ID": "276",
    "PARENT_ID": "266",
    "CODE": "140428",
    "NAME": "长子县"
  },
  {
    "ID": "2760",
    "PARENT_ID": "2726",
    "CODE": "520400",
    "NAME": "安顺市"
  },
  {
    "ID": "2761",
    "PARENT_ID": "2760",
    "CODE": "520401",
    "NAME": "市辖区"
  },
  {
    "ID": "2762",
    "PARENT_ID": "2760",
    "CODE": "520402",
    "NAME": "西秀区"
  },
  {
    "ID": "2763",
    "PARENT_ID": "2760",
    "CODE": "520421",
    "NAME": "平坝县"
  },
  {
    "ID": "2764",
    "PARENT_ID": "2760",
    "CODE": "520422",
    "NAME": "普定县"
  },
  {
    "ID": "2765",
    "PARENT_ID": "2760",
    "CODE": "520423",
    "NAME": "镇宁布依族苗族自治县"
  },
  {
    "ID": "2766",
    "PARENT_ID": "2760",
    "CODE": "520424",
    "NAME": "关岭布依族苗族自治县"
  },
  {
    "ID": "2767",
    "PARENT_ID": "2760",
    "CODE": "520425",
    "NAME": "紫云苗族布依族自治县"
  },
  {
    "ID": "2768",
    "PARENT_ID": "2726",
    "CODE": "520500",
    "NAME": "毕节市"
  },
  {
    "ID": "2769",
    "PARENT_ID": "2768",
    "CODE": "520501",
    "NAME": "市辖区"
  },
  {
    "ID": "277",
    "PARENT_ID": "266",
    "CODE": "140429",
    "NAME": "武乡县"
  },
  {
    "ID": "2770",
    "PARENT_ID": "2768",
    "CODE": "520502",
    "NAME": "七星关区"
  },
  {
    "ID": "2771",
    "PARENT_ID": "2768",
    "CODE": "520521",
    "NAME": "大方县"
  },
  {
    "ID": "2772",
    "PARENT_ID": "2768",
    "CODE": "520522",
    "NAME": "黔西县"
  },
  {
    "ID": "2773",
    "PARENT_ID": "2768",
    "CODE": "520523",
    "NAME": "金沙县"
  },
  {
    "ID": "2774",
    "PARENT_ID": "2768",
    "CODE": "520524",
    "NAME": "织金县"
  },
  {
    "ID": "2775",
    "PARENT_ID": "2768",
    "CODE": "520525",
    "NAME": "纳雍县"
  },
  {
    "ID": "2776",
    "PARENT_ID": "2768",
    "CODE": "520526",
    "NAME": "威宁彝族回族苗族自治县"
  },
  {
    "ID": "2777",
    "PARENT_ID": "2768",
    "CODE": "520527",
    "NAME": "赫章县"
  },
  {
    "ID": "2778",
    "PARENT_ID": "2726",
    "CODE": "520600",
    "NAME": "铜仁市"
  },
  {
    "ID": "2779",
    "PARENT_ID": "2778",
    "CODE": "520601",
    "NAME": "市辖区"
  },
  {
    "ID": "278",
    "PARENT_ID": "266",
    "CODE": "140430",
    "NAME": "沁县"
  },
  {
    "ID": "2780",
    "PARENT_ID": "2778",
    "CODE": "520602",
    "NAME": "碧江区"
  },
  {
    "ID": "2781",
    "PARENT_ID": "2778",
    "CODE": "520603",
    "NAME": "万山区"
  },
  {
    "ID": "2782",
    "PARENT_ID": "2778",
    "CODE": "520621",
    "NAME": "江口县"
  },
  {
    "ID": "2783",
    "PARENT_ID": "2778",
    "CODE": "520622",
    "NAME": "玉屏侗族自治县"
  },
  {
    "ID": "2784",
    "PARENT_ID": "2778",
    "CODE": "520623",
    "NAME": "石阡县"
  },
  {
    "ID": "2785",
    "PARENT_ID": "2778",
    "CODE": "520624",
    "NAME": "思南县"
  },
  {
    "ID": "2786",
    "PARENT_ID": "2778",
    "CODE": "520625",
    "NAME": "印江土家族苗族自治县"
  },
  {
    "ID": "2787",
    "PARENT_ID": "2778",
    "CODE": "520626",
    "NAME": "德江县"
  },
  {
    "ID": "2788",
    "PARENT_ID": "2778",
    "CODE": "520627",
    "NAME": "沿河土家族自治县"
  },
  {
    "ID": "2789",
    "PARENT_ID": "2778",
    "CODE": "520628",
    "NAME": "松桃苗族自治县"
  },
  {
    "ID": "279",
    "PARENT_ID": "266",
    "CODE": "140431",
    "NAME": "沁源县"
  },
  {
    "ID": "2790",
    "PARENT_ID": "2726",
    "CODE": "522300",
    "NAME": "黔西南布依族苗族自治州"
  },
  {
    "ID": "2791",
    "PARENT_ID": "2790",
    "CODE": "522301",
    "NAME": "兴义市"
  },
  {
    "ID": "2792",
    "PARENT_ID": "2790",
    "CODE": "522322",
    "NAME": "兴仁县"
  },
  {
    "ID": "2793",
    "PARENT_ID": "2790",
    "CODE": "522323",
    "NAME": "普安县"
  },
  {
    "ID": "2794",
    "PARENT_ID": "2790",
    "CODE": "522324",
    "NAME": "晴隆县"
  },
  {
    "ID": "2795",
    "PARENT_ID": "2790",
    "CODE": "522325",
    "NAME": "贞丰县"
  },
  {
    "ID": "2796",
    "PARENT_ID": "2790",
    "CODE": "522326",
    "NAME": "望谟县"
  },
  {
    "ID": "2797",
    "PARENT_ID": "2790",
    "CODE": "522327",
    "NAME": "册亨县"
  },
  {
    "ID": "2798",
    "PARENT_ID": "2790",
    "CODE": "522328",
    "NAME": "安龙县"
  },
  {
    "ID": "2799",
    "PARENT_ID": "2726",
    "CODE": "522600",
    "NAME": "黔东南苗族侗族自治州"
  },
  {
    "ID": "28",
    "PARENT_ID": "21",
    "CODE": "120110",
    "NAME": "东丽区"
  },
  {
    "ID": "280",
    "PARENT_ID": "266",
    "CODE": "140481",
    "NAME": "潞城市"
  },
  {
    "ID": "2800",
    "PARENT_ID": "2799",
    "CODE": "522601",
    "NAME": "凯里市"
  },
  {
    "ID": "2801",
    "PARENT_ID": "2799",
    "CODE": "522622",
    "NAME": "黄平县"
  },
  {
    "ID": "2802",
    "PARENT_ID": "2799",
    "CODE": "522623",
    "NAME": "施秉县"
  },
  {
    "ID": "2803",
    "PARENT_ID": "2799",
    "CODE": "522624",
    "NAME": "三穗县"
  },
  {
    "ID": "2804",
    "PARENT_ID": "2799",
    "CODE": "522625",
    "NAME": "镇远县"
  },
  {
    "ID": "2805",
    "PARENT_ID": "2799",
    "CODE": "522626",
    "NAME": "岑巩县"
  },
  {
    "ID": "2806",
    "PARENT_ID": "2799",
    "CODE": "522627",
    "NAME": "天柱县"
  },
  {
    "ID": "2807",
    "PARENT_ID": "2799",
    "CODE": "522628",
    "NAME": "锦屏县"
  },
  {
    "ID": "2808",
    "PARENT_ID": "2799",
    "CODE": "522629",
    "NAME": "剑河县"
  },
  {
    "ID": "2809",
    "PARENT_ID": "2799",
    "CODE": "522630",
    "NAME": "台江县"
  },
  {
    "ID": "281",
    "PARENT_ID": "233",
    "CODE": "140500",
    "NAME": "晋城市"
  },
  {
    "ID": "2810",
    "PARENT_ID": "2799",
    "CODE": "522631",
    "NAME": "黎平县"
  },
  {
    "ID": "2811",
    "PARENT_ID": "2799",
    "CODE": "522632",
    "NAME": "榕江县"
  },
  {
    "ID": "2812",
    "PARENT_ID": "2799",
    "CODE": "522633",
    "NAME": "从江县"
  },
  {
    "ID": "2813",
    "PARENT_ID": "2799",
    "CODE": "522634",
    "NAME": "雷山县"
  },
  {
    "ID": "2814",
    "PARENT_ID": "2799",
    "CODE": "522635",
    "NAME": "麻江县"
  },
  {
    "ID": "2815",
    "PARENT_ID": "2799",
    "CODE": "522636",
    "NAME": "丹寨县"
  },
  {
    "ID": "2816",
    "PARENT_ID": "2726",
    "CODE": "522700",
    "NAME": "黔南布依族苗族自治州"
  },
  {
    "ID": "2817",
    "PARENT_ID": "2816",
    "CODE": "522701",
    "NAME": "都匀市"
  },
  {
    "ID": "2818",
    "PARENT_ID": "2816",
    "CODE": "522702",
    "NAME": "福泉市"
  },
  {
    "ID": "2819",
    "PARENT_ID": "2816",
    "CODE": "522722",
    "NAME": "荔波县"
  },
  {
    "ID": "282",
    "PARENT_ID": "281",
    "CODE": "140501",
    "NAME": "市辖区"
  },
  {
    "ID": "2820",
    "PARENT_ID": "2816",
    "CODE": "522723",
    "NAME": "贵定县"
  },
  {
    "ID": "2821",
    "PARENT_ID": "2816",
    "CODE": "522725",
    "NAME": "瓮安县"
  },
  {
    "ID": "2822",
    "PARENT_ID": "2816",
    "CODE": "522726",
    "NAME": "独山县"
  },
  {
    "ID": "2823",
    "PARENT_ID": "2816",
    "CODE": "522727",
    "NAME": "平塘县"
  },
  {
    "ID": "2824",
    "PARENT_ID": "2816",
    "CODE": "522728",
    "NAME": "罗甸县"
  },
  {
    "ID": "2825",
    "PARENT_ID": "2816",
    "CODE": "522729",
    "NAME": "长顺县"
  },
  {
    "ID": "2826",
    "PARENT_ID": "2816",
    "CODE": "522730",
    "NAME": "龙里县"
  },
  {
    "ID": "2827",
    "PARENT_ID": "2816",
    "CODE": "522731",
    "NAME": "惠水县"
  },
  {
    "ID": "2828",
    "PARENT_ID": "2816",
    "CODE": "522732",
    "NAME": "三都水族自治县"
  },
  {
    "ID": "2829",
    "PARENT_ID": "0",
    "CODE": "530000",
    "NAME": "云南省"
  },
  {
    "ID": "283",
    "PARENT_ID": "281",
    "CODE": "140502",
    "NAME": "城区"
  },
  {
    "ID": "2830",
    "PARENT_ID": "2829",
    "CODE": "530100",
    "NAME": "昆明市"
  },
  {
    "ID": "2831",
    "PARENT_ID": "2830",
    "CODE": "530101",
    "NAME": "市辖区"
  },
  {
    "ID": "2832",
    "PARENT_ID": "2830",
    "CODE": "530102",
    "NAME": "五华区"
  },
  {
    "ID": "2833",
    "PARENT_ID": "2830",
    "CODE": "530103",
    "NAME": "盘龙区"
  },
  {
    "ID": "2834",
    "PARENT_ID": "2830",
    "CODE": "530111",
    "NAME": "官渡区"
  },
  {
    "ID": "2835",
    "PARENT_ID": "2830",
    "CODE": "530112",
    "NAME": "西山区"
  },
  {
    "ID": "2836",
    "PARENT_ID": "2830",
    "CODE": "530113",
    "NAME": "东川区"
  },
  {
    "ID": "2837",
    "PARENT_ID": "2830",
    "CODE": "530114",
    "NAME": "呈贡区"
  },
  {
    "ID": "2838",
    "PARENT_ID": "2830",
    "CODE": "530122",
    "NAME": "晋宁县"
  },
  {
    "ID": "2839",
    "PARENT_ID": "2830",
    "CODE": "530124",
    "NAME": "富民县"
  },
  {
    "ID": "284",
    "PARENT_ID": "281",
    "CODE": "140521",
    "NAME": "沁水县"
  },
  {
    "ID": "2840",
    "PARENT_ID": "2830",
    "CODE": "530125",
    "NAME": "宜良县"
  },
  {
    "ID": "2841",
    "PARENT_ID": "2830",
    "CODE": "530126",
    "NAME": "石林彝族自治县"
  },
  {
    "ID": "2842",
    "PARENT_ID": "2830",
    "CODE": "530127",
    "NAME": "嵩明县"
  },
  {
    "ID": "2843",
    "PARENT_ID": "2830",
    "CODE": "530128",
    "NAME": "禄劝彝族苗族自治县"
  },
  {
    "ID": "2844",
    "PARENT_ID": "2830",
    "CODE": "530129",
    "NAME": "寻甸回族彝族自治县"
  },
  {
    "ID": "2845",
    "PARENT_ID": "2830",
    "CODE": "530181",
    "NAME": "安宁市"
  },
  {
    "ID": "2846",
    "PARENT_ID": "2829",
    "CODE": "530300",
    "NAME": "曲靖市"
  },
  {
    "ID": "2847",
    "PARENT_ID": "2846",
    "CODE": "530301",
    "NAME": "市辖区"
  },
  {
    "ID": "2848",
    "PARENT_ID": "2846",
    "CODE": "530302",
    "NAME": "麒麟区"
  },
  {
    "ID": "2849",
    "PARENT_ID": "2846",
    "CODE": "530321",
    "NAME": "马龙县"
  },
  {
    "ID": "285",
    "PARENT_ID": "281",
    "CODE": "140522",
    "NAME": "阳城县"
  },
  {
    "ID": "2850",
    "PARENT_ID": "2846",
    "CODE": "530322",
    "NAME": "陆良县"
  },
  {
    "ID": "2851",
    "PARENT_ID": "2846",
    "CODE": "530323",
    "NAME": "师宗县"
  },
  {
    "ID": "2852",
    "PARENT_ID": "2846",
    "CODE": "530324",
    "NAME": "罗平县"
  },
  {
    "ID": "2853",
    "PARENT_ID": "2846",
    "CODE": "530325",
    "NAME": "富源县"
  },
  {
    "ID": "2854",
    "PARENT_ID": "2846",
    "CODE": "530326",
    "NAME": "会泽县"
  },
  {
    "ID": "2855",
    "PARENT_ID": "2846",
    "CODE": "530328",
    "NAME": "沾益县"
  },
  {
    "ID": "2856",
    "PARENT_ID": "2846",
    "CODE": "530381",
    "NAME": "宣威市"
  },
  {
    "ID": "2857",
    "PARENT_ID": "2829",
    "CODE": "530400",
    "NAME": "玉溪市"
  },
  {
    "ID": "2858",
    "PARENT_ID": "2857",
    "CODE": "530401",
    "NAME": "市辖区"
  },
  {
    "ID": "2859",
    "PARENT_ID": "2857",
    "CODE": "530402",
    "NAME": "红塔区"
  },
  {
    "ID": "286",
    "PARENT_ID": "281",
    "CODE": "140524",
    "NAME": "陵川县"
  },
  {
    "ID": "2860",
    "PARENT_ID": "2857",
    "CODE": "530421",
    "NAME": "江川县"
  },
  {
    "ID": "2861",
    "PARENT_ID": "2857",
    "CODE": "530422",
    "NAME": "澄江县"
  },
  {
    "ID": "2862",
    "PARENT_ID": "2857",
    "CODE": "530423",
    "NAME": "通海县"
  },
  {
    "ID": "2863",
    "PARENT_ID": "2857",
    "CODE": "530424",
    "NAME": "华宁县"
  },
  {
    "ID": "2864",
    "PARENT_ID": "2857",
    "CODE": "530425",
    "NAME": "易门县"
  },
  {
    "ID": "2865",
    "PARENT_ID": "2857",
    "CODE": "530426",
    "NAME": "峨山彝族自治县"
  },
  {
    "ID": "2866",
    "PARENT_ID": "2857",
    "CODE": "530427",
    "NAME": "新平彝族傣族自治县"
  },
  {
    "ID": "2867",
    "PARENT_ID": "2857",
    "CODE": "530428",
    "NAME": "元江哈尼族彝族傣族自治县"
  },
  {
    "ID": "2868",
    "PARENT_ID": "2829",
    "CODE": "530500",
    "NAME": "保山市"
  },
  {
    "ID": "2869",
    "PARENT_ID": "2868",
    "CODE": "530501",
    "NAME": "市辖区"
  },
  {
    "ID": "287",
    "PARENT_ID": "281",
    "CODE": "140525",
    "NAME": "泽州县"
  },
  {
    "ID": "2870",
    "PARENT_ID": "2868",
    "CODE": "530502",
    "NAME": "隆阳区"
  },
  {
    "ID": "2871",
    "PARENT_ID": "2868",
    "CODE": "530521",
    "NAME": "施甸县"
  },
  {
    "ID": "2872",
    "PARENT_ID": "2868",
    "CODE": "530522",
    "NAME": "腾冲县"
  },
  {
    "ID": "2873",
    "PARENT_ID": "2868",
    "CODE": "530523",
    "NAME": "龙陵县"
  },
  {
    "ID": "2874",
    "PARENT_ID": "2868",
    "CODE": "530524",
    "NAME": "昌宁县"
  },
  {
    "ID": "2875",
    "PARENT_ID": "2829",
    "CODE": "530600",
    "NAME": "昭通市"
  },
  {
    "ID": "2876",
    "PARENT_ID": "2875",
    "CODE": "530601",
    "NAME": "市辖区"
  },
  {
    "ID": "2877",
    "PARENT_ID": "2875",
    "CODE": "530602",
    "NAME": "昭阳区"
  },
  {
    "ID": "2878",
    "PARENT_ID": "2875",
    "CODE": "530621",
    "NAME": "鲁甸县"
  },
  {
    "ID": "2879",
    "PARENT_ID": "2875",
    "CODE": "530622",
    "NAME": "巧家县"
  },
  {
    "ID": "288",
    "PARENT_ID": "281",
    "CODE": "140581",
    "NAME": "高平市"
  },
  {
    "ID": "2880",
    "PARENT_ID": "2875",
    "CODE": "530623",
    "NAME": "盐津县"
  },
  {
    "ID": "2881",
    "PARENT_ID": "2875",
    "CODE": "530624",
    "NAME": "大关县"
  },
  {
    "ID": "2882",
    "PARENT_ID": "2875",
    "CODE": "530625",
    "NAME": "永善县"
  },
  {
    "ID": "2883",
    "PARENT_ID": "2875",
    "CODE": "530626",
    "NAME": "绥江县"
  },
  {
    "ID": "2884",
    "PARENT_ID": "2875",
    "CODE": "530627",
    "NAME": "镇雄县"
  },
  {
    "ID": "2885",
    "PARENT_ID": "2875",
    "CODE": "530628",
    "NAME": "彝良县"
  },
  {
    "ID": "2886",
    "PARENT_ID": "2875",
    "CODE": "530629",
    "NAME": "威信县"
  },
  {
    "ID": "2887",
    "PARENT_ID": "2875",
    "CODE": "530630",
    "NAME": "水富县"
  },
  {
    "ID": "2888",
    "PARENT_ID": "2829",
    "CODE": "530700",
    "NAME": "丽江市"
  },
  {
    "ID": "2889",
    "PARENT_ID": "2888",
    "CODE": "530701",
    "NAME": "市辖区"
  },
  {
    "ID": "289",
    "PARENT_ID": "233",
    "CODE": "140600",
    "NAME": "朔州市"
  },
  {
    "ID": "2890",
    "PARENT_ID": "2888",
    "CODE": "530702",
    "NAME": "古城区"
  },
  {
    "ID": "2891",
    "PARENT_ID": "2888",
    "CODE": "530721",
    "NAME": "玉龙纳西族自治县"
  },
  {
    "ID": "2892",
    "PARENT_ID": "2888",
    "CODE": "530722",
    "NAME": "永胜县"
  },
  {
    "ID": "2893",
    "PARENT_ID": "2888",
    "CODE": "530723",
    "NAME": "华坪县"
  },
  {
    "ID": "2894",
    "PARENT_ID": "2888",
    "CODE": "530724",
    "NAME": "宁蒗彝族自治县"
  },
  {
    "ID": "2895",
    "PARENT_ID": "2829",
    "CODE": "530800",
    "NAME": "普洱市"
  },
  {
    "ID": "2896",
    "PARENT_ID": "2895",
    "CODE": "530801",
    "NAME": "市辖区"
  },
  {
    "ID": "2897",
    "PARENT_ID": "2895",
    "CODE": "530802",
    "NAME": "思茅区"
  },
  {
    "ID": "2898",
    "PARENT_ID": "2895",
    "CODE": "530821",
    "NAME": "宁洱哈尼族彝族自治县"
  },
  {
    "ID": "2899",
    "PARENT_ID": "2895",
    "CODE": "530822",
    "NAME": "墨江哈尼族自治县"
  },
  {
    "ID": "29",
    "PARENT_ID": "21",
    "CODE": "120111",
    "NAME": "西青区"
  },
  {
    "ID": "290",
    "PARENT_ID": "289",
    "CODE": "140601",
    "NAME": "市辖区"
  },
  {
    "ID": "2900",
    "PARENT_ID": "2895",
    "CODE": "530823",
    "NAME": "景东彝族自治县"
  },
  {
    "ID": "2901",
    "PARENT_ID": "2895",
    "CODE": "530824",
    "NAME": "景谷傣族彝族自治县"
  },
  {
    "ID": "2902",
    "PARENT_ID": "2895",
    "CODE": "530825",
    "NAME": "镇沅彝族哈尼族拉祜族自治县"
  },
  {
    "ID": "2903",
    "PARENT_ID": "2895",
    "CODE": "530826",
    "NAME": "江城哈尼族彝族自治县"
  },
  {
    "ID": "2904",
    "PARENT_ID": "2895",
    "CODE": "530827",
    "NAME": "孟连傣族拉祜族佤族自治县"
  },
  {
    "ID": "2905",
    "PARENT_ID": "2895",
    "CODE": "530828",
    "NAME": "澜沧拉祜族自治县"
  },
  {
    "ID": "2906",
    "PARENT_ID": "2895",
    "CODE": "530829",
    "NAME": "西盟佤族自治县"
  },
  {
    "ID": "2907",
    "PARENT_ID": "2829",
    "CODE": "530900",
    "NAME": "临沧市"
  },
  {
    "ID": "2908",
    "PARENT_ID": "2907",
    "CODE": "530901",
    "NAME": "市辖区"
  },
  {
    "ID": "2909",
    "PARENT_ID": "2907",
    "CODE": "530902",
    "NAME": "临翔区"
  },
  {
    "ID": "291",
    "PARENT_ID": "289",
    "CODE": "140602",
    "NAME": "朔城区"
  },
  {
    "ID": "2910",
    "PARENT_ID": "2907",
    "CODE": "530921",
    "NAME": "凤庆县"
  },
  {
    "ID": "2911",
    "PARENT_ID": "2907",
    "CODE": "530922",
    "NAME": "云县"
  },
  {
    "ID": "2912",
    "PARENT_ID": "2907",
    "CODE": "530923",
    "NAME": "永德县"
  },
  {
    "ID": "2913",
    "PARENT_ID": "2907",
    "CODE": "530924",
    "NAME": "镇康县"
  },
  {
    "ID": "2914",
    "PARENT_ID": "2907",
    "CODE": "530925",
    "NAME": "双江拉祜族佤族布朗族傣族自治县"
  },
  {
    "ID": "2915",
    "PARENT_ID": "2907",
    "CODE": "530926",
    "NAME": "耿马傣族佤族自治县"
  },
  {
    "ID": "2916",
    "PARENT_ID": "2907",
    "CODE": "530927",
    "NAME": "沧源佤族自治县"
  },
  {
    "ID": "2917",
    "PARENT_ID": "2829",
    "CODE": "532300",
    "NAME": "楚雄彝族自治州"
  },
  {
    "ID": "2918",
    "PARENT_ID": "2917",
    "CODE": "532301",
    "NAME": "楚雄市"
  },
  {
    "ID": "2919",
    "PARENT_ID": "2917",
    "CODE": "532322",
    "NAME": "双柏县"
  },
  {
    "ID": "292",
    "PARENT_ID": "289",
    "CODE": "140603",
    "NAME": "平鲁区"
  },
  {
    "ID": "2920",
    "PARENT_ID": "2917",
    "CODE": "532323",
    "NAME": "牟定县"
  },
  {
    "ID": "2921",
    "PARENT_ID": "2917",
    "CODE": "532324",
    "NAME": "南华县"
  },
  {
    "ID": "2922",
    "PARENT_ID": "2917",
    "CODE": "532325",
    "NAME": "姚安县"
  },
  {
    "ID": "2923",
    "PARENT_ID": "2917",
    "CODE": "532326",
    "NAME": "大姚县"
  },
  {
    "ID": "2924",
    "PARENT_ID": "2917",
    "CODE": "532327",
    "NAME": "永仁县"
  },
  {
    "ID": "2925",
    "PARENT_ID": "2917",
    "CODE": "532328",
    "NAME": "元谋县"
  },
  {
    "ID": "2926",
    "PARENT_ID": "2917",
    "CODE": "532329",
    "NAME": "武定县"
  },
  {
    "ID": "2927",
    "PARENT_ID": "2917",
    "CODE": "532331",
    "NAME": "禄丰县"
  },
  {
    "ID": "2928",
    "PARENT_ID": "2829",
    "CODE": "532500",
    "NAME": "红河哈尼族彝族自治州"
  },
  {
    "ID": "2929",
    "PARENT_ID": "2928",
    "CODE": "532501",
    "NAME": "个旧市"
  },
  {
    "ID": "293",
    "PARENT_ID": "289",
    "CODE": "140621",
    "NAME": "山阴县"
  },
  {
    "ID": "2930",
    "PARENT_ID": "2928",
    "CODE": "532502",
    "NAME": "开远市"
  },
  {
    "ID": "2931",
    "PARENT_ID": "2928",
    "CODE": "532503",
    "NAME": "蒙自市"
  },
  {
    "ID": "2932",
    "PARENT_ID": "2928",
    "CODE": "532504",
    "NAME": "弥勒市"
  },
  {
    "ID": "2933",
    "PARENT_ID": "2928",
    "CODE": "532523",
    "NAME": "屏边苗族自治县"
  },
  {
    "ID": "2934",
    "PARENT_ID": "2928",
    "CODE": "532524",
    "NAME": "建水县"
  },
  {
    "ID": "2935",
    "PARENT_ID": "2928",
    "CODE": "532525",
    "NAME": "石屏县"
  },
  {
    "ID": "2936",
    "PARENT_ID": "2928",
    "CODE": "532527",
    "NAME": "泸西县"
  },
  {
    "ID": "2937",
    "PARENT_ID": "2928",
    "CODE": "532528",
    "NAME": "元阳县"
  },
  {
    "ID": "2938",
    "PARENT_ID": "2928",
    "CODE": "532529",
    "NAME": "红河县"
  },
  {
    "ID": "2939",
    "PARENT_ID": "2928",
    "CODE": "532530",
    "NAME": "金平苗族瑶族傣族自治县"
  },
  {
    "ID": "294",
    "PARENT_ID": "289",
    "CODE": "140622",
    "NAME": "应县"
  },
  {
    "ID": "2940",
    "PARENT_ID": "2928",
    "CODE": "532531",
    "NAME": "绿春县"
  },
  {
    "ID": "2941",
    "PARENT_ID": "2928",
    "CODE": "532532",
    "NAME": "河口瑶族自治县"
  },
  {
    "ID": "2942",
    "PARENT_ID": "2829",
    "CODE": "532600",
    "NAME": "文山壮族苗族自治州"
  },
  {
    "ID": "2943",
    "PARENT_ID": "2942",
    "CODE": "532601",
    "NAME": "文山市"
  },
  {
    "ID": "2944",
    "PARENT_ID": "2942",
    "CODE": "532622",
    "NAME": "砚山县"
  },
  {
    "ID": "2945",
    "PARENT_ID": "2942",
    "CODE": "532623",
    "NAME": "西畴县"
  },
  {
    "ID": "2946",
    "PARENT_ID": "2942",
    "CODE": "532624",
    "NAME": "麻栗坡县"
  },
  {
    "ID": "2947",
    "PARENT_ID": "2942",
    "CODE": "532625",
    "NAME": "马关县"
  },
  {
    "ID": "2948",
    "PARENT_ID": "2942",
    "CODE": "532626",
    "NAME": "丘北县"
  },
  {
    "ID": "2949",
    "PARENT_ID": "2942",
    "CODE": "532627",
    "NAME": "广南县"
  },
  {
    "ID": "295",
    "PARENT_ID": "289",
    "CODE": "140623",
    "NAME": "右玉县"
  },
  {
    "ID": "2950",
    "PARENT_ID": "2942",
    "CODE": "532628",
    "NAME": "富宁县"
  },
  {
    "ID": "2951",
    "PARENT_ID": "2829",
    "CODE": "532800",
    "NAME": "西双版纳傣族自治州"
  },
  {
    "ID": "2952",
    "PARENT_ID": "2951",
    "CODE": "532801",
    "NAME": "景洪市"
  },
  {
    "ID": "2953",
    "PARENT_ID": "2951",
    "CODE": "532822",
    "NAME": "勐海县"
  },
  {
    "ID": "2954",
    "PARENT_ID": "2951",
    "CODE": "532823",
    "NAME": "勐腊县"
  },
  {
    "ID": "2955",
    "PARENT_ID": "2829",
    "CODE": "532900",
    "NAME": "大理白族自治州"
  },
  {
    "ID": "2956",
    "PARENT_ID": "2955",
    "CODE": "532901",
    "NAME": "大理市"
  },
  {
    "ID": "2957",
    "PARENT_ID": "2955",
    "CODE": "532922",
    "NAME": "漾濞彝族自治县"
  },
  {
    "ID": "2958",
    "PARENT_ID": "2955",
    "CODE": "532923",
    "NAME": "祥云县"
  },
  {
    "ID": "2959",
    "PARENT_ID": "2955",
    "CODE": "532924",
    "NAME": "宾川县"
  },
  {
    "ID": "296",
    "PARENT_ID": "289",
    "CODE": "140624",
    "NAME": "怀仁县"
  },
  {
    "ID": "2960",
    "PARENT_ID": "2955",
    "CODE": "532925",
    "NAME": "弥渡县"
  },
  {
    "ID": "2961",
    "PARENT_ID": "2955",
    "CODE": "532926",
    "NAME": "南涧彝族自治县"
  },
  {
    "ID": "2962",
    "PARENT_ID": "2955",
    "CODE": "532927",
    "NAME": "巍山彝族回族自治县"
  },
  {
    "ID": "2963",
    "PARENT_ID": "2955",
    "CODE": "532928",
    "NAME": "永平县"
  },
  {
    "ID": "2964",
    "PARENT_ID": "2955",
    "CODE": "532929",
    "NAME": "云龙县"
  },
  {
    "ID": "2965",
    "PARENT_ID": "2955",
    "CODE": "532930",
    "NAME": "洱源县"
  },
  {
    "ID": "2966",
    "PARENT_ID": "2955",
    "CODE": "532931",
    "NAME": "剑川县"
  },
  {
    "ID": "2967",
    "PARENT_ID": "2955",
    "CODE": "532932",
    "NAME": "鹤庆县"
  },
  {
    "ID": "2968",
    "PARENT_ID": "2829",
    "CODE": "533100",
    "NAME": "德宏傣族景颇族自治州"
  },
  {
    "ID": "2969",
    "PARENT_ID": "2968",
    "CODE": "533102",
    "NAME": "瑞丽市"
  },
  {
    "ID": "297",
    "PARENT_ID": "233",
    "CODE": "140700",
    "NAME": "晋中市"
  },
  {
    "ID": "2970",
    "PARENT_ID": "2968",
    "CODE": "533103",
    "NAME": "芒市"
  },
  {
    "ID": "2971",
    "PARENT_ID": "2968",
    "CODE": "533122",
    "NAME": "梁河县"
  },
  {
    "ID": "2972",
    "PARENT_ID": "2968",
    "CODE": "533123",
    "NAME": "盈江县"
  },
  {
    "ID": "2973",
    "PARENT_ID": "2968",
    "CODE": "533124",
    "NAME": "陇川县"
  },
  {
    "ID": "2974",
    "PARENT_ID": "2829",
    "CODE": "533300",
    "NAME": "怒江傈僳族自治州"
  },
  {
    "ID": "2975",
    "PARENT_ID": "2974",
    "CODE": "533321",
    "NAME": "泸水县"
  },
  {
    "ID": "2976",
    "PARENT_ID": "2974",
    "CODE": "533323",
    "NAME": "福贡县"
  },
  {
    "ID": "2977",
    "PARENT_ID": "2974",
    "CODE": "533324",
    "NAME": "贡山独龙族怒族自治县"
  },
  {
    "ID": "2978",
    "PARENT_ID": "2974",
    "CODE": "533325",
    "NAME": "兰坪白族普米族自治县"
  },
  {
    "ID": "2979",
    "PARENT_ID": "2829",
    "CODE": "533400",
    "NAME": "迪庆藏族自治州"
  },
  {
    "ID": "298",
    "PARENT_ID": "297",
    "CODE": "140701",
    "NAME": "市辖区"
  },
  {
    "ID": "2980",
    "PARENT_ID": "2979",
    "CODE": "533421",
    "NAME": "香格里拉县"
  },
  {
    "ID": "2981",
    "PARENT_ID": "2979",
    "CODE": "533422",
    "NAME": "德钦县"
  },
  {
    "ID": "2982",
    "PARENT_ID": "2979",
    "CODE": "533423",
    "NAME": "维西傈僳族自治县"
  },
  {
    "ID": "2983",
    "PARENT_ID": "0",
    "CODE": "540000",
    "NAME": "西藏自治区"
  },
  {
    "ID": "2984",
    "PARENT_ID": "2983",
    "CODE": "540100",
    "NAME": "拉萨市"
  },
  {
    "ID": "2985",
    "PARENT_ID": "2984",
    "CODE": "540101",
    "NAME": "市辖区"
  },
  {
    "ID": "2986",
    "PARENT_ID": "2984",
    "CODE": "540102",
    "NAME": "城关区"
  },
  {
    "ID": "2987",
    "PARENT_ID": "2984",
    "CODE": "540121",
    "NAME": "林周县"
  },
  {
    "ID": "2988",
    "PARENT_ID": "2984",
    "CODE": "540122",
    "NAME": "当雄县"
  },
  {
    "ID": "2989",
    "PARENT_ID": "2984",
    "CODE": "540123",
    "NAME": "尼木县"
  },
  {
    "ID": "299",
    "PARENT_ID": "297",
    "CODE": "140702",
    "NAME": "榆次区"
  },
  {
    "ID": "2990",
    "PARENT_ID": "2984",
    "CODE": "540124",
    "NAME": "曲水县"
  },
  {
    "ID": "2991",
    "PARENT_ID": "2984",
    "CODE": "540125",
    "NAME": "堆龙德庆县"
  },
  {
    "ID": "2992",
    "PARENT_ID": "2984",
    "CODE": "540126",
    "NAME": "达孜县"
  },
  {
    "ID": "2993",
    "PARENT_ID": "2984",
    "CODE": "540127",
    "NAME": "墨竹工卡县"
  },
  {
    "ID": "2994",
    "PARENT_ID": "2983",
    "CODE": "540200",
    "NAME": "日喀则市"
  },
  {
    "ID": "2995",
    "PARENT_ID": "2994",
    "CODE": "540202",
    "NAME": "桑珠孜区"
  },
  {
    "ID": "2996",
    "PARENT_ID": "2994",
    "CODE": "540221",
    "NAME": "南木林县"
  },
  {
    "ID": "2997",
    "PARENT_ID": "2994",
    "CODE": "540222",
    "NAME": "江孜县"
  },
  {
    "ID": "2998",
    "PARENT_ID": "2994",
    "CODE": "540223",
    "NAME": "定日县"
  },
  {
    "ID": "2999",
    "PARENT_ID": "2994",
    "CODE": "540224",
    "NAME": "萨迦县"
  },
  {
    "ID": "3",
    "PARENT_ID": "2",
    "CODE": "110101",
    "NAME": "东城区"
  },
  {
    "ID": "30",
    "PARENT_ID": "21",
    "CODE": "120112",
    "NAME": "津南区"
  },
  {
    "ID": "300",
    "PARENT_ID": "297",
    "CODE": "140721",
    "NAME": "榆社县"
  },
  {
    "ID": "3000",
    "PARENT_ID": "2994",
    "CODE": "540225",
    "NAME": "拉孜县"
  },
  {
    "ID": "3001",
    "PARENT_ID": "2994",
    "CODE": "540226",
    "NAME": "昂仁县"
  },
  {
    "ID": "3002",
    "PARENT_ID": "2994",
    "CODE": "540227",
    "NAME": "谢通门县"
  },
  {
    "ID": "3003",
    "PARENT_ID": "2994",
    "CODE": "540228",
    "NAME": "白朗县"
  },
  {
    "ID": "3004",
    "PARENT_ID": "2994",
    "CODE": "540229",
    "NAME": "仁布县"
  },
  {
    "ID": "3005",
    "PARENT_ID": "2994",
    "CODE": "540230",
    "NAME": "康马县"
  },
  {
    "ID": "3006",
    "PARENT_ID": "2994",
    "CODE": "540231",
    "NAME": "定结县"
  },
  {
    "ID": "3007",
    "PARENT_ID": "2994",
    "CODE": "540232",
    "NAME": "仲巴县"
  },
  {
    "ID": "3008",
    "PARENT_ID": "2994",
    "CODE": "540233",
    "NAME": "亚东县"
  },
  {
    "ID": "3009",
    "PARENT_ID": "2994",
    "CODE": "540234",
    "NAME": "吉隆县"
  },
  {
    "ID": "301",
    "PARENT_ID": "297",
    "CODE": "140722",
    "NAME": "左权县"
  },
  {
    "ID": "3010",
    "PARENT_ID": "2994",
    "CODE": "540235",
    "NAME": "聂拉木县"
  },
  {
    "ID": "3011",
    "PARENT_ID": "2994",
    "CODE": "540236",
    "NAME": "萨嘎县"
  },
  {
    "ID": "3012",
    "PARENT_ID": "2994",
    "CODE": "540237",
    "NAME": "岗巴县"
  },
  {
    "ID": "3013",
    "PARENT_ID": "2983",
    "CODE": "542100",
    "NAME": "昌都地区"
  },
  {
    "ID": "3014",
    "PARENT_ID": "3013",
    "CODE": "542121",
    "NAME": "昌都县"
  },
  {
    "ID": "3015",
    "PARENT_ID": "3013",
    "CODE": "542122",
    "NAME": "江达县"
  },
  {
    "ID": "3016",
    "PARENT_ID": "3013",
    "CODE": "542123",
    "NAME": "贡觉县"
  },
  {
    "ID": "3017",
    "PARENT_ID": "3013",
    "CODE": "542124",
    "NAME": "类乌齐县"
  },
  {
    "ID": "3018",
    "PARENT_ID": "3013",
    "CODE": "542125",
    "NAME": "丁青县"
  },
  {
    "ID": "3019",
    "PARENT_ID": "3013",
    "CODE": "542126",
    "NAME": "察雅县"
  },
  {
    "ID": "302",
    "PARENT_ID": "297",
    "CODE": "140723",
    "NAME": "和顺县"
  },
  {
    "ID": "3020",
    "PARENT_ID": "3013",
    "CODE": "542127",
    "NAME": "八宿县"
  },
  {
    "ID": "3021",
    "PARENT_ID": "3013",
    "CODE": "542128",
    "NAME": "左贡县"
  },
  {
    "ID": "3022",
    "PARENT_ID": "3013",
    "CODE": "542129",
    "NAME": "芒康县"
  },
  {
    "ID": "3023",
    "PARENT_ID": "3013",
    "CODE": "542132",
    "NAME": "洛隆县"
  },
  {
    "ID": "3024",
    "PARENT_ID": "3013",
    "CODE": "542133",
    "NAME": "边坝县"
  },
  {
    "ID": "3025",
    "PARENT_ID": "2983",
    "CODE": "542200",
    "NAME": "山南地区"
  },
  {
    "ID": "3026",
    "PARENT_ID": "3025",
    "CODE": "542221",
    "NAME": "乃东县"
  },
  {
    "ID": "3027",
    "PARENT_ID": "3025",
    "CODE": "542222",
    "NAME": "扎囊县"
  },
  {
    "ID": "3028",
    "PARENT_ID": "3025",
    "CODE": "542223",
    "NAME": "贡嘎县"
  },
  {
    "ID": "3029",
    "PARENT_ID": "3025",
    "CODE": "542224",
    "NAME": "桑日县"
  },
  {
    "ID": "303",
    "PARENT_ID": "297",
    "CODE": "140724",
    "NAME": "昔阳县"
  },
  {
    "ID": "3030",
    "PARENT_ID": "3025",
    "CODE": "542225",
    "NAME": "琼结县"
  },
  {
    "ID": "3031",
    "PARENT_ID": "3025",
    "CODE": "542226",
    "NAME": "曲松县"
  },
  {
    "ID": "3032",
    "PARENT_ID": "3025",
    "CODE": "542227",
    "NAME": "措美县"
  },
  {
    "ID": "3033",
    "PARENT_ID": "3025",
    "CODE": "542228",
    "NAME": "洛扎县"
  },
  {
    "ID": "3034",
    "PARENT_ID": "3025",
    "CODE": "542229",
    "NAME": "加查县"
  },
  {
    "ID": "3035",
    "PARENT_ID": "3025",
    "CODE": "542231",
    "NAME": "隆子县"
  },
  {
    "ID": "3036",
    "PARENT_ID": "3025",
    "CODE": "542232",
    "NAME": "错那县"
  },
  {
    "ID": "3037",
    "PARENT_ID": "3025",
    "CODE": "542233",
    "NAME": "浪卡子县"
  },
  {
    "ID": "3038",
    "PARENT_ID": "2983",
    "CODE": "542400",
    "NAME": "那曲地区"
  },
  {
    "ID": "3039",
    "PARENT_ID": "3038",
    "CODE": "542421",
    "NAME": "那曲县"
  },
  {
    "ID": "304",
    "PARENT_ID": "297",
    "CODE": "140725",
    "NAME": "寿阳县"
  },
  {
    "ID": "3040",
    "PARENT_ID": "3038",
    "CODE": "542422",
    "NAME": "嘉黎县"
  },
  {
    "ID": "3041",
    "PARENT_ID": "3038",
    "CODE": "542423",
    "NAME": "比如县"
  },
  {
    "ID": "3042",
    "PARENT_ID": "3038",
    "CODE": "542424",
    "NAME": "聂荣县"
  },
  {
    "ID": "3043",
    "PARENT_ID": "3038",
    "CODE": "542425",
    "NAME": "安多县"
  },
  {
    "ID": "3044",
    "PARENT_ID": "3038",
    "CODE": "542426",
    "NAME": "申扎县"
  },
  {
    "ID": "3045",
    "PARENT_ID": "3038",
    "CODE": "542427",
    "NAME": "索县"
  },
  {
    "ID": "3046",
    "PARENT_ID": "3038",
    "CODE": "542428",
    "NAME": "班戈县"
  },
  {
    "ID": "3047",
    "PARENT_ID": "3038",
    "CODE": "542429",
    "NAME": "巴青县"
  },
  {
    "ID": "3048",
    "PARENT_ID": "3038",
    "CODE": "542430",
    "NAME": "尼玛县"
  },
  {
    "ID": "3049",
    "PARENT_ID": "3038",
    "CODE": "542431",
    "NAME": "双湖县"
  },
  {
    "ID": "305",
    "PARENT_ID": "297",
    "CODE": "140726",
    "NAME": "太谷县"
  },
  {
    "ID": "3050",
    "PARENT_ID": "2983",
    "CODE": "542500",
    "NAME": "阿里地区"
  },
  {
    "ID": "3051",
    "PARENT_ID": "3050",
    "CODE": "542521",
    "NAME": "普兰县"
  },
  {
    "ID": "3052",
    "PARENT_ID": "3050",
    "CODE": "542522",
    "NAME": "札达县"
  },
  {
    "ID": "3053",
    "PARENT_ID": "3050",
    "CODE": "542523",
    "NAME": "噶尔县"
  },
  {
    "ID": "3054",
    "PARENT_ID": "3050",
    "CODE": "542524",
    "NAME": "日土县"
  },
  {
    "ID": "3055",
    "PARENT_ID": "3050",
    "CODE": "542525",
    "NAME": "革吉县"
  },
  {
    "ID": "3056",
    "PARENT_ID": "3050",
    "CODE": "542526",
    "NAME": "改则县"
  },
  {
    "ID": "3057",
    "PARENT_ID": "3050",
    "CODE": "542527",
    "NAME": "措勤县"
  },
  {
    "ID": "3058",
    "PARENT_ID": "2983",
    "CODE": "542600",
    "NAME": "林芝地区"
  },
  {
    "ID": "3059",
    "PARENT_ID": "3058",
    "CODE": "542621",
    "NAME": "林芝县"
  },
  {
    "ID": "306",
    "PARENT_ID": "297",
    "CODE": "140727",
    "NAME": "祁县"
  },
  {
    "ID": "3060",
    "PARENT_ID": "3058",
    "CODE": "542622",
    "NAME": "工布江达县"
  },
  {
    "ID": "3061",
    "PARENT_ID": "3058",
    "CODE": "542623",
    "NAME": "米林县"
  },
  {
    "ID": "3062",
    "PARENT_ID": "3058",
    "CODE": "542624",
    "NAME": "墨脱县"
  },
  {
    "ID": "3063",
    "PARENT_ID": "3058",
    "CODE": "542625",
    "NAME": "波密县"
  },
  {
    "ID": "3064",
    "PARENT_ID": "3058",
    "CODE": "542626",
    "NAME": "察隅县"
  },
  {
    "ID": "3065",
    "PARENT_ID": "3058",
    "CODE": "542627",
    "NAME": "朗县"
  },
  {
    "ID": "3066",
    "PARENT_ID": "0",
    "CODE": "610000",
    "NAME": "陕西省"
  },
  {
    "ID": "3067",
    "PARENT_ID": "3066",
    "CODE": "610100",
    "NAME": "西安市"
  },
  {
    "ID": "3068",
    "PARENT_ID": "3067",
    "CODE": "610101",
    "NAME": "市辖区"
  },
  {
    "ID": "3069",
    "PARENT_ID": "3067",
    "CODE": "610102",
    "NAME": "新城区"
  },
  {
    "ID": "307",
    "PARENT_ID": "297",
    "CODE": "140728",
    "NAME": "平遥县"
  },
  {
    "ID": "3070",
    "PARENT_ID": "3067",
    "CODE": "610103",
    "NAME": "碑林区"
  },
  {
    "ID": "3071",
    "PARENT_ID": "3067",
    "CODE": "610104",
    "NAME": "莲湖区"
  },
  {
    "ID": "3072",
    "PARENT_ID": "3067",
    "CODE": "610111",
    "NAME": "灞桥区"
  },
  {
    "ID": "3073",
    "PARENT_ID": "3067",
    "CODE": "610112",
    "NAME": "未央区"
  },
  {
    "ID": "3074",
    "PARENT_ID": "3067",
    "CODE": "610113",
    "NAME": "雁塔区"
  },
  {
    "ID": "3075",
    "PARENT_ID": "3067",
    "CODE": "610114",
    "NAME": "阎良区"
  },
  {
    "ID": "3076",
    "PARENT_ID": "3067",
    "CODE": "610115",
    "NAME": "临潼区"
  },
  {
    "ID": "3077",
    "PARENT_ID": "3067",
    "CODE": "610116",
    "NAME": "长安区"
  },
  {
    "ID": "3078",
    "PARENT_ID": "3067",
    "CODE": "610122",
    "NAME": "蓝田县"
  },
  {
    "ID": "3079",
    "PARENT_ID": "3067",
    "CODE": "610124",
    "NAME": "周至县"
  },
  {
    "ID": "308",
    "PARENT_ID": "297",
    "CODE": "140729",
    "NAME": "灵石县"
  },
  {
    "ID": "3080",
    "PARENT_ID": "3067",
    "CODE": "610125",
    "NAME": "户县"
  },
  {
    "ID": "3081",
    "PARENT_ID": "3067",
    "CODE": "610126",
    "NAME": "高陵县"
  },
  {
    "ID": "3082",
    "PARENT_ID": "3066",
    "CODE": "610200",
    "NAME": "铜川市"
  },
  {
    "ID": "3083",
    "PARENT_ID": "3082",
    "CODE": "610201",
    "NAME": "市辖区"
  },
  {
    "ID": "3084",
    "PARENT_ID": "3082",
    "CODE": "610202",
    "NAME": "王益区"
  },
  {
    "ID": "3085",
    "PARENT_ID": "3082",
    "CODE": "610203",
    "NAME": "印台区"
  },
  {
    "ID": "3086",
    "PARENT_ID": "3082",
    "CODE": "610204",
    "NAME": "耀州区"
  },
  {
    "ID": "3087",
    "PARENT_ID": "3082",
    "CODE": "610222",
    "NAME": "宜君县"
  },
  {
    "ID": "3088",
    "PARENT_ID": "3066",
    "CODE": "610300",
    "NAME": "宝鸡市"
  },
  {
    "ID": "3089",
    "PARENT_ID": "3088",
    "CODE": "610301",
    "NAME": "市辖区"
  },
  {
    "ID": "309",
    "PARENT_ID": "297",
    "CODE": "140781",
    "NAME": "介休市"
  },
  {
    "ID": "3090",
    "PARENT_ID": "3088",
    "CODE": "610302",
    "NAME": "渭滨区"
  },
  {
    "ID": "3091",
    "PARENT_ID": "3088",
    "CODE": "610303",
    "NAME": "金台区"
  },
  {
    "ID": "3092",
    "PARENT_ID": "3088",
    "CODE": "610304",
    "NAME": "陈仓区"
  },
  {
    "ID": "3093",
    "PARENT_ID": "3088",
    "CODE": "610322",
    "NAME": "凤翔县"
  },
  {
    "ID": "3094",
    "PARENT_ID": "3088",
    "CODE": "610323",
    "NAME": "岐山县"
  },
  {
    "ID": "3095",
    "PARENT_ID": "3088",
    "CODE": "610324",
    "NAME": "扶风县"
  },
  {
    "ID": "3096",
    "PARENT_ID": "3088",
    "CODE": "610326",
    "NAME": "眉县"
  },
  {
    "ID": "3097",
    "PARENT_ID": "3088",
    "CODE": "610327",
    "NAME": "陇县"
  },
  {
    "ID": "3098",
    "PARENT_ID": "3088",
    "CODE": "610328",
    "NAME": "千阳县"
  },
  {
    "ID": "3099",
    "PARENT_ID": "3088",
    "CODE": "610329",
    "NAME": "麟游县"
  },
  {
    "ID": "31",
    "PARENT_ID": "21",
    "CODE": "120113",
    "NAME": "北辰区"
  },
  {
    "ID": "310",
    "PARENT_ID": "233",
    "CODE": "140800",
    "NAME": "运城市"
  },
  {
    "ID": "3100",
    "PARENT_ID": "3088",
    "CODE": "610330",
    "NAME": "凤县"
  },
  {
    "ID": "3101",
    "PARENT_ID": "3088",
    "CODE": "610331",
    "NAME": "太白县"
  },
  {
    "ID": "3102",
    "PARENT_ID": "3066",
    "CODE": "610400",
    "NAME": "咸阳市"
  },
  {
    "ID": "3103",
    "PARENT_ID": "3102",
    "CODE": "610401",
    "NAME": "市辖区"
  },
  {
    "ID": "3104",
    "PARENT_ID": "3102",
    "CODE": "610402",
    "NAME": "秦都区"
  },
  {
    "ID": "3105",
    "PARENT_ID": "3102",
    "CODE": "610403",
    "NAME": "杨陵区"
  },
  {
    "ID": "3106",
    "PARENT_ID": "3102",
    "CODE": "610404",
    "NAME": "渭城区"
  },
  {
    "ID": "3107",
    "PARENT_ID": "3102",
    "CODE": "610422",
    "NAME": "三原县"
  },
  {
    "ID": "3108",
    "PARENT_ID": "3102",
    "CODE": "610423",
    "NAME": "泾阳县"
  },
  {
    "ID": "3109",
    "PARENT_ID": "3102",
    "CODE": "610424",
    "NAME": "乾县"
  },
  {
    "ID": "311",
    "PARENT_ID": "310",
    "CODE": "140801",
    "NAME": "市辖区"
  },
  {
    "ID": "3110",
    "PARENT_ID": "3102",
    "CODE": "610425",
    "NAME": "礼泉县"
  },
  {
    "ID": "3111",
    "PARENT_ID": "3102",
    "CODE": "610426",
    "NAME": "永寿县"
  },
  {
    "ID": "3112",
    "PARENT_ID": "3102",
    "CODE": "610427",
    "NAME": "彬县"
  },
  {
    "ID": "3113",
    "PARENT_ID": "3102",
    "CODE": "610428",
    "NAME": "长武县"
  },
  {
    "ID": "3114",
    "PARENT_ID": "3102",
    "CODE": "610429",
    "NAME": "旬邑县"
  },
  {
    "ID": "3115",
    "PARENT_ID": "3102",
    "CODE": "610430",
    "NAME": "淳化县"
  },
  {
    "ID": "3116",
    "PARENT_ID": "3102",
    "CODE": "610431",
    "NAME": "武功县"
  },
  {
    "ID": "3117",
    "PARENT_ID": "3102",
    "CODE": "610481",
    "NAME": "兴平市"
  },
  {
    "ID": "3118",
    "PARENT_ID": "3066",
    "CODE": "610500",
    "NAME": "渭南市"
  },
  {
    "ID": "3119",
    "PARENT_ID": "3118",
    "CODE": "610501",
    "NAME": "市辖区"
  },
  {
    "ID": "312",
    "PARENT_ID": "310",
    "CODE": "140802",
    "NAME": "盐湖区"
  },
  {
    "ID": "3120",
    "PARENT_ID": "3118",
    "CODE": "610502",
    "NAME": "临渭区"
  },
  {
    "ID": "3121",
    "PARENT_ID": "3118",
    "CODE": "610521",
    "NAME": "华县"
  },
  {
    "ID": "3122",
    "PARENT_ID": "3118",
    "CODE": "610522",
    "NAME": "潼关县"
  },
  {
    "ID": "3123",
    "PARENT_ID": "3118",
    "CODE": "610523",
    "NAME": "大荔县"
  },
  {
    "ID": "3124",
    "PARENT_ID": "3118",
    "CODE": "610524",
    "NAME": "合阳县"
  },
  {
    "ID": "3125",
    "PARENT_ID": "3118",
    "CODE": "610525",
    "NAME": "澄城县"
  },
  {
    "ID": "3126",
    "PARENT_ID": "3118",
    "CODE": "610526",
    "NAME": "蒲城县"
  },
  {
    "ID": "3127",
    "PARENT_ID": "3118",
    "CODE": "610527",
    "NAME": "白水县"
  },
  {
    "ID": "3128",
    "PARENT_ID": "3118",
    "CODE": "610528",
    "NAME": "富平县"
  },
  {
    "ID": "3129",
    "PARENT_ID": "3118",
    "CODE": "610581",
    "NAME": "韩城市"
  },
  {
    "ID": "313",
    "PARENT_ID": "310",
    "CODE": "140821",
    "NAME": "临猗县"
  },
  {
    "ID": "3130",
    "PARENT_ID": "3118",
    "CODE": "610582",
    "NAME": "华阴市"
  },
  {
    "ID": "3131",
    "PARENT_ID": "3066",
    "CODE": "610600",
    "NAME": "延安市"
  },
  {
    "ID": "3132",
    "PARENT_ID": "3131",
    "CODE": "610601",
    "NAME": "市辖区"
  },
  {
    "ID": "3133",
    "PARENT_ID": "3131",
    "CODE": "610602",
    "NAME": "宝塔区"
  },
  {
    "ID": "3134",
    "PARENT_ID": "3131",
    "CODE": "610621",
    "NAME": "延长县"
  },
  {
    "ID": "3135",
    "PARENT_ID": "3131",
    "CODE": "610622",
    "NAME": "延川县"
  },
  {
    "ID": "3136",
    "PARENT_ID": "3131",
    "CODE": "610623",
    "NAME": "子长县"
  },
  {
    "ID": "3137",
    "PARENT_ID": "3131",
    "CODE": "610624",
    "NAME": "安塞县"
  },
  {
    "ID": "3138",
    "PARENT_ID": "3131",
    "CODE": "610625",
    "NAME": "志丹县"
  },
  {
    "ID": "3139",
    "PARENT_ID": "3131",
    "CODE": "610626",
    "NAME": "吴起县"
  },
  {
    "ID": "314",
    "PARENT_ID": "310",
    "CODE": "140822",
    "NAME": "万荣县"
  },
  {
    "ID": "3140",
    "PARENT_ID": "3131",
    "CODE": "610627",
    "NAME": "甘泉县"
  },
  {
    "ID": "3141",
    "PARENT_ID": "3131",
    "CODE": "610628",
    "NAME": "富县"
  },
  {
    "ID": "3142",
    "PARENT_ID": "3131",
    "CODE": "610629",
    "NAME": "洛川县"
  },
  {
    "ID": "3143",
    "PARENT_ID": "3131",
    "CODE": "610630",
    "NAME": "宜川县"
  },
  {
    "ID": "3144",
    "PARENT_ID": "3131",
    "CODE": "610631",
    "NAME": "黄龙县"
  },
  {
    "ID": "3145",
    "PARENT_ID": "3131",
    "CODE": "610632",
    "NAME": "黄陵县"
  },
  {
    "ID": "3146",
    "PARENT_ID": "3066",
    "CODE": "610700",
    "NAME": "汉中市"
  },
  {
    "ID": "3147",
    "PARENT_ID": "3146",
    "CODE": "610701",
    "NAME": "市辖区"
  },
  {
    "ID": "3148",
    "PARENT_ID": "3146",
    "CODE": "610702",
    "NAME": "汉台区"
  },
  {
    "ID": "3149",
    "PARENT_ID": "3146",
    "CODE": "610721",
    "NAME": "南郑县"
  },
  {
    "ID": "315",
    "PARENT_ID": "310",
    "CODE": "140823",
    "NAME": "闻喜县"
  },
  {
    "ID": "3150",
    "PARENT_ID": "3146",
    "CODE": "610722",
    "NAME": "城固县"
  },
  {
    "ID": "3151",
    "PARENT_ID": "3146",
    "CODE": "610723",
    "NAME": "洋县"
  },
  {
    "ID": "3152",
    "PARENT_ID": "3146",
    "CODE": "610724",
    "NAME": "西乡县"
  },
  {
    "ID": "3153",
    "PARENT_ID": "3146",
    "CODE": "610725",
    "NAME": "勉县"
  },
  {
    "ID": "3154",
    "PARENT_ID": "3146",
    "CODE": "610726",
    "NAME": "宁强县"
  },
  {
    "ID": "3155",
    "PARENT_ID": "3146",
    "CODE": "610727",
    "NAME": "略阳县"
  },
  {
    "ID": "3156",
    "PARENT_ID": "3146",
    "CODE": "610728",
    "NAME": "镇巴县"
  },
  {
    "ID": "3157",
    "PARENT_ID": "3146",
    "CODE": "610729",
    "NAME": "留坝县"
  },
  {
    "ID": "3158",
    "PARENT_ID": "3146",
    "CODE": "610730",
    "NAME": "佛坪县"
  },
  {
    "ID": "3159",
    "PARENT_ID": "3066",
    "CODE": "610800",
    "NAME": "榆林市"
  },
  {
    "ID": "316",
    "PARENT_ID": "310",
    "CODE": "140824",
    "NAME": "稷山县"
  },
  {
    "ID": "3160",
    "PARENT_ID": "3159",
    "CODE": "610801",
    "NAME": "市辖区"
  },
  {
    "ID": "3161",
    "PARENT_ID": "3159",
    "CODE": "610802",
    "NAME": "榆阳区"
  },
  {
    "ID": "3162",
    "PARENT_ID": "3159",
    "CODE": "610821",
    "NAME": "神木县"
  },
  {
    "ID": "3163",
    "PARENT_ID": "3159",
    "CODE": "610822",
    "NAME": "府谷县"
  },
  {
    "ID": "3164",
    "PARENT_ID": "3159",
    "CODE": "610823",
    "NAME": "横山县"
  },
  {
    "ID": "3165",
    "PARENT_ID": "3159",
    "CODE": "610824",
    "NAME": "靖边县"
  },
  {
    "ID": "3166",
    "PARENT_ID": "3159",
    "CODE": "610825",
    "NAME": "定边县"
  },
  {
    "ID": "3167",
    "PARENT_ID": "3159",
    "CODE": "610826",
    "NAME": "绥德县"
  },
  {
    "ID": "3168",
    "PARENT_ID": "3159",
    "CODE": "610827",
    "NAME": "米脂县"
  },
  {
    "ID": "3169",
    "PARENT_ID": "3159",
    "CODE": "610828",
    "NAME": "佳县"
  },
  {
    "ID": "317",
    "PARENT_ID": "310",
    "CODE": "140825",
    "NAME": "新绛县"
  },
  {
    "ID": "3170",
    "PARENT_ID": "3159",
    "CODE": "610829",
    "NAME": "吴堡县"
  },
  {
    "ID": "3171",
    "PARENT_ID": "3159",
    "CODE": "610830",
    "NAME": "清涧县"
  },
  {
    "ID": "3172",
    "PARENT_ID": "3159",
    "CODE": "610831",
    "NAME": "子洲县"
  },
  {
    "ID": "3173",
    "PARENT_ID": "3066",
    "CODE": "610900",
    "NAME": "安康市"
  },
  {
    "ID": "3174",
    "PARENT_ID": "3173",
    "CODE": "610901",
    "NAME": "市辖区"
  },
  {
    "ID": "3175",
    "PARENT_ID": "3173",
    "CODE": "610902",
    "NAME": "汉滨区"
  },
  {
    "ID": "3176",
    "PARENT_ID": "3173",
    "CODE": "610921",
    "NAME": "汉阴县"
  },
  {
    "ID": "3177",
    "PARENT_ID": "3173",
    "CODE": "610922",
    "NAME": "石泉县"
  },
  {
    "ID": "3178",
    "PARENT_ID": "3173",
    "CODE": "610923",
    "NAME": "宁陕县"
  },
  {
    "ID": "3179",
    "PARENT_ID": "3173",
    "CODE": "610924",
    "NAME": "紫阳县"
  },
  {
    "ID": "318",
    "PARENT_ID": "310",
    "CODE": "140826",
    "NAME": "绛县"
  },
  {
    "ID": "3180",
    "PARENT_ID": "3173",
    "CODE": "610925",
    "NAME": "岚皋县"
  },
  {
    "ID": "3181",
    "PARENT_ID": "3173",
    "CODE": "610926",
    "NAME": "平利县"
  },
  {
    "ID": "3182",
    "PARENT_ID": "3173",
    "CODE": "610927",
    "NAME": "镇坪县"
  },
  {
    "ID": "3183",
    "PARENT_ID": "3173",
    "CODE": "610928",
    "NAME": "旬阳县"
  },
  {
    "ID": "3184",
    "PARENT_ID": "3173",
    "CODE": "610929",
    "NAME": "白河县"
  },
  {
    "ID": "3185",
    "PARENT_ID": "3066",
    "CODE": "611000",
    "NAME": "商洛市"
  },
  {
    "ID": "3186",
    "PARENT_ID": "3185",
    "CODE": "611001",
    "NAME": "市辖区"
  },
  {
    "ID": "3187",
    "PARENT_ID": "3185",
    "CODE": "611002",
    "NAME": "商州区"
  },
  {
    "ID": "3188",
    "PARENT_ID": "3185",
    "CODE": "611021",
    "NAME": "洛南县"
  },
  {
    "ID": "3189",
    "PARENT_ID": "3185",
    "CODE": "611022",
    "NAME": "丹凤县"
  },
  {
    "ID": "319",
    "PARENT_ID": "310",
    "CODE": "140827",
    "NAME": "垣曲县"
  },
  {
    "ID": "3190",
    "PARENT_ID": "3185",
    "CODE": "611023",
    "NAME": "商南县"
  },
  {
    "ID": "3191",
    "PARENT_ID": "3185",
    "CODE": "611024",
    "NAME": "山阳县"
  },
  {
    "ID": "3192",
    "PARENT_ID": "3185",
    "CODE": "611025",
    "NAME": "镇安县"
  },
  {
    "ID": "3193",
    "PARENT_ID": "3185",
    "CODE": "611026",
    "NAME": "柞水县"
  },
  {
    "ID": "3194",
    "PARENT_ID": "0",
    "CODE": "620000",
    "NAME": "甘肃省"
  },
  {
    "ID": "3195",
    "PARENT_ID": "3194",
    "CODE": "620100",
    "NAME": "兰州市"
  },
  {
    "ID": "3196",
    "PARENT_ID": "3195",
    "CODE": "620101",
    "NAME": "市辖区"
  },
  {
    "ID": "3197",
    "PARENT_ID": "3195",
    "CODE": "620102",
    "NAME": "城关区"
  },
  {
    "ID": "3198",
    "PARENT_ID": "3195",
    "CODE": "620103",
    "NAME": "七里河区"
  },
  {
    "ID": "3199",
    "PARENT_ID": "3195",
    "CODE": "620104",
    "NAME": "西固区"
  },
  {
    "ID": "32",
    "PARENT_ID": "21",
    "CODE": "120114",
    "NAME": "武清区"
  },
  {
    "ID": "320",
    "PARENT_ID": "310",
    "CODE": "140828",
    "NAME": "夏县"
  },
  {
    "ID": "3200",
    "PARENT_ID": "3195",
    "CODE": "620105",
    "NAME": "安宁区"
  },
  {
    "ID": "3201",
    "PARENT_ID": "3195",
    "CODE": "620111",
    "NAME": "红古区"
  },
  {
    "ID": "3202",
    "PARENT_ID": "3195",
    "CODE": "620121",
    "NAME": "永登县"
  },
  {
    "ID": "3203",
    "PARENT_ID": "3195",
    "CODE": "620122",
    "NAME": "皋兰县"
  },
  {
    "ID": "3204",
    "PARENT_ID": "3195",
    "CODE": "620123",
    "NAME": "榆中县"
  },
  {
    "ID": "3205",
    "PARENT_ID": "3194",
    "CODE": "620200",
    "NAME": "嘉峪关市"
  },
  {
    "ID": "3206",
    "PARENT_ID": "3205",
    "CODE": "620201",
    "NAME": "市辖区"
  },
  {
    "ID": "3207",
    "PARENT_ID": "3194",
    "CODE": "620300",
    "NAME": "金昌市"
  },
  {
    "ID": "3208",
    "PARENT_ID": "3207",
    "CODE": "620301",
    "NAME": "市辖区"
  },
  {
    "ID": "3209",
    "PARENT_ID": "3207",
    "CODE": "620302",
    "NAME": "金川区"
  },
  {
    "ID": "321",
    "PARENT_ID": "310",
    "CODE": "140829",
    "NAME": "平陆县"
  },
  {
    "ID": "3210",
    "PARENT_ID": "3207",
    "CODE": "620321",
    "NAME": "永昌县"
  },
  {
    "ID": "3211",
    "PARENT_ID": "3194",
    "CODE": "620400",
    "NAME": "白银市"
  },
  {
    "ID": "3212",
    "PARENT_ID": "3211",
    "CODE": "620401",
    "NAME": "市辖区"
  },
  {
    "ID": "3213",
    "PARENT_ID": "3211",
    "CODE": "620402",
    "NAME": "白银区"
  },
  {
    "ID": "3214",
    "PARENT_ID": "3211",
    "CODE": "620403",
    "NAME": "平川区"
  },
  {
    "ID": "3215",
    "PARENT_ID": "3211",
    "CODE": "620421",
    "NAME": "靖远县"
  },
  {
    "ID": "3216",
    "PARENT_ID": "3211",
    "CODE": "620422",
    "NAME": "会宁县"
  },
  {
    "ID": "3217",
    "PARENT_ID": "3211",
    "CODE": "620423",
    "NAME": "景泰县"
  },
  {
    "ID": "3218",
    "PARENT_ID": "3194",
    "CODE": "620500",
    "NAME": "天水市"
  },
  {
    "ID": "3219",
    "PARENT_ID": "3218",
    "CODE": "620501",
    "NAME": "市辖区"
  },
  {
    "ID": "322",
    "PARENT_ID": "310",
    "CODE": "140830",
    "NAME": "芮城县"
  },
  {
    "ID": "3220",
    "PARENT_ID": "3218",
    "CODE": "620502",
    "NAME": "秦州区"
  },
  {
    "ID": "3221",
    "PARENT_ID": "3218",
    "CODE": "620503",
    "NAME": "麦积区"
  },
  {
    "ID": "3222",
    "PARENT_ID": "3218",
    "CODE": "620521",
    "NAME": "清水县"
  },
  {
    "ID": "3223",
    "PARENT_ID": "3218",
    "CODE": "620522",
    "NAME": "秦安县"
  },
  {
    "ID": "3224",
    "PARENT_ID": "3218",
    "CODE": "620523",
    "NAME": "甘谷县"
  },
  {
    "ID": "3225",
    "PARENT_ID": "3218",
    "CODE": "620524",
    "NAME": "武山县"
  },
  {
    "ID": "3226",
    "PARENT_ID": "3218",
    "CODE": "620525",
    "NAME": "张家川回族自治县"
  },
  {
    "ID": "3227",
    "PARENT_ID": "3194",
    "CODE": "620600",
    "NAME": "武威市"
  },
  {
    "ID": "3228",
    "PARENT_ID": "3227",
    "CODE": "620601",
    "NAME": "市辖区"
  },
  {
    "ID": "3229",
    "PARENT_ID": "3227",
    "CODE": "620602",
    "NAME": "凉州区"
  },
  {
    "ID": "323",
    "PARENT_ID": "310",
    "CODE": "140881",
    "NAME": "永济市"
  },
  {
    "ID": "3230",
    "PARENT_ID": "3227",
    "CODE": "620621",
    "NAME": "民勤县"
  },
  {
    "ID": "3231",
    "PARENT_ID": "3227",
    "CODE": "620622",
    "NAME": "古浪县"
  },
  {
    "ID": "3232",
    "PARENT_ID": "3227",
    "CODE": "620623",
    "NAME": "天祝藏族自治县"
  },
  {
    "ID": "3233",
    "PARENT_ID": "3194",
    "CODE": "620700",
    "NAME": "张掖市"
  },
  {
    "ID": "3234",
    "PARENT_ID": "3233",
    "CODE": "620701",
    "NAME": "市辖区"
  },
  {
    "ID": "3235",
    "PARENT_ID": "3233",
    "CODE": "620702",
    "NAME": "甘州区"
  },
  {
    "ID": "3236",
    "PARENT_ID": "3233",
    "CODE": "620721",
    "NAME": "肃南裕固族自治县"
  },
  {
    "ID": "3237",
    "PARENT_ID": "3233",
    "CODE": "620722",
    "NAME": "民乐县"
  },
  {
    "ID": "3238",
    "PARENT_ID": "3233",
    "CODE": "620723",
    "NAME": "临泽县"
  },
  {
    "ID": "3239",
    "PARENT_ID": "3233",
    "CODE": "620724",
    "NAME": "高台县"
  },
  {
    "ID": "324",
    "PARENT_ID": "310",
    "CODE": "140882",
    "NAME": "河津市"
  },
  {
    "ID": "3240",
    "PARENT_ID": "3233",
    "CODE": "620725",
    "NAME": "山丹县"
  },
  {
    "ID": "3241",
    "PARENT_ID": "3194",
    "CODE": "620800",
    "NAME": "平凉市"
  },
  {
    "ID": "3242",
    "PARENT_ID": "3241",
    "CODE": "620801",
    "NAME": "市辖区"
  },
  {
    "ID": "3243",
    "PARENT_ID": "3241",
    "CODE": "620802",
    "NAME": "崆峒区"
  },
  {
    "ID": "3244",
    "PARENT_ID": "3241",
    "CODE": "620821",
    "NAME": "泾川县"
  },
  {
    "ID": "3245",
    "PARENT_ID": "3241",
    "CODE": "620822",
    "NAME": "灵台县"
  },
  {
    "ID": "3246",
    "PARENT_ID": "3241",
    "CODE": "620823",
    "NAME": "崇信县"
  },
  {
    "ID": "3247",
    "PARENT_ID": "3241",
    "CODE": "620824",
    "NAME": "华亭县"
  },
  {
    "ID": "3248",
    "PARENT_ID": "3241",
    "CODE": "620825",
    "NAME": "庄浪县"
  },
  {
    "ID": "3249",
    "PARENT_ID": "3241",
    "CODE": "620826",
    "NAME": "静宁县"
  },
  {
    "ID": "325",
    "PARENT_ID": "233",
    "CODE": "140900",
    "NAME": "忻州市"
  },
  {
    "ID": "3250",
    "PARENT_ID": "3194",
    "CODE": "620900",
    "NAME": "酒泉市"
  },
  {
    "ID": "3251",
    "PARENT_ID": "3250",
    "CODE": "620901",
    "NAME": "市辖区"
  },
  {
    "ID": "3252",
    "PARENT_ID": "3250",
    "CODE": "620902",
    "NAME": "肃州区"
  },
  {
    "ID": "3253",
    "PARENT_ID": "3250",
    "CODE": "620921",
    "NAME": "金塔县"
  },
  {
    "ID": "3254",
    "PARENT_ID": "3250",
    "CODE": "620922",
    "NAME": "瓜州县"
  },
  {
    "ID": "3255",
    "PARENT_ID": "3250",
    "CODE": "620923",
    "NAME": "肃北蒙古族自治县"
  },
  {
    "ID": "3256",
    "PARENT_ID": "3250",
    "CODE": "620924",
    "NAME": "阿克塞哈萨克族自治县"
  },
  {
    "ID": "3257",
    "PARENT_ID": "3250",
    "CODE": "620981",
    "NAME": "玉门市"
  },
  {
    "ID": "3258",
    "PARENT_ID": "3250",
    "CODE": "620982",
    "NAME": "敦煌市"
  },
  {
    "ID": "3259",
    "PARENT_ID": "3194",
    "CODE": "621000",
    "NAME": "庆阳市"
  },
  {
    "ID": "326",
    "PARENT_ID": "325",
    "CODE": "140901",
    "NAME": "市辖区"
  },
  {
    "ID": "3260",
    "PARENT_ID": "3259",
    "CODE": "621001",
    "NAME": "市辖区"
  },
  {
    "ID": "3261",
    "PARENT_ID": "3259",
    "CODE": "621002",
    "NAME": "西峰区"
  },
  {
    "ID": "3262",
    "PARENT_ID": "3259",
    "CODE": "621021",
    "NAME": "庆城县"
  },
  {
    "ID": "3263",
    "PARENT_ID": "3259",
    "CODE": "621022",
    "NAME": "环县"
  },
  {
    "ID": "3264",
    "PARENT_ID": "3259",
    "CODE": "621023",
    "NAME": "华池县"
  },
  {
    "ID": "3265",
    "PARENT_ID": "3259",
    "CODE": "621024",
    "NAME": "合水县"
  },
  {
    "ID": "3266",
    "PARENT_ID": "3259",
    "CODE": "621025",
    "NAME": "正宁县"
  },
  {
    "ID": "3267",
    "PARENT_ID": "3259",
    "CODE": "621026",
    "NAME": "宁县"
  },
  {
    "ID": "3268",
    "PARENT_ID": "3259",
    "CODE": "621027",
    "NAME": "镇原县"
  },
  {
    "ID": "3269",
    "PARENT_ID": "3194",
    "CODE": "621100",
    "NAME": "定西市"
  },
  {
    "ID": "327",
    "PARENT_ID": "325",
    "CODE": "140902",
    "NAME": "忻府区"
  },
  {
    "ID": "3270",
    "PARENT_ID": "3269",
    "CODE": "621101",
    "NAME": "市辖区"
  },
  {
    "ID": "3271",
    "PARENT_ID": "3269",
    "CODE": "621102",
    "NAME": "安定区"
  },
  {
    "ID": "3272",
    "PARENT_ID": "3269",
    "CODE": "621121",
    "NAME": "通渭县"
  },
  {
    "ID": "3273",
    "PARENT_ID": "3269",
    "CODE": "621122",
    "NAME": "陇西县"
  },
  {
    "ID": "3274",
    "PARENT_ID": "3269",
    "CODE": "621123",
    "NAME": "渭源县"
  },
  {
    "ID": "3275",
    "PARENT_ID": "3269",
    "CODE": "621124",
    "NAME": "临洮县"
  },
  {
    "ID": "3276",
    "PARENT_ID": "3269",
    "CODE": "621125",
    "NAME": "漳县"
  },
  {
    "ID": "3277",
    "PARENT_ID": "3269",
    "CODE": "621126",
    "NAME": "岷县"
  },
  {
    "ID": "3278",
    "PARENT_ID": "3194",
    "CODE": "621200",
    "NAME": "陇南市"
  },
  {
    "ID": "3279",
    "PARENT_ID": "3278",
    "CODE": "621201",
    "NAME": "市辖区"
  },
  {
    "ID": "328",
    "PARENT_ID": "325",
    "CODE": "140921",
    "NAME": "定襄县"
  },
  {
    "ID": "3280",
    "PARENT_ID": "3278",
    "CODE": "621202",
    "NAME": "武都区"
  },
  {
    "ID": "3281",
    "PARENT_ID": "3278",
    "CODE": "621221",
    "NAME": "成县"
  },
  {
    "ID": "3282",
    "PARENT_ID": "3278",
    "CODE": "621222",
    "NAME": "文县"
  },
  {
    "ID": "3283",
    "PARENT_ID": "3278",
    "CODE": "621223",
    "NAME": "宕昌县"
  },
  {
    "ID": "3284",
    "PARENT_ID": "3278",
    "CODE": "621224",
    "NAME": "康县"
  },
  {
    "ID": "3285",
    "PARENT_ID": "3278",
    "CODE": "621225",
    "NAME": "西和县"
  },
  {
    "ID": "3286",
    "PARENT_ID": "3278",
    "CODE": "621226",
    "NAME": "礼县"
  },
  {
    "ID": "3287",
    "PARENT_ID": "3278",
    "CODE": "621227",
    "NAME": "徽县"
  },
  {
    "ID": "3288",
    "PARENT_ID": "3278",
    "CODE": "621228",
    "NAME": "两当县"
  },
  {
    "ID": "3289",
    "PARENT_ID": "3194",
    "CODE": "622900",
    "NAME": "临夏回族自治州"
  },
  {
    "ID": "329",
    "PARENT_ID": "325",
    "CODE": "140922",
    "NAME": "五台县"
  },
  {
    "ID": "3290",
    "PARENT_ID": "3289",
    "CODE": "622901",
    "NAME": "临夏市"
  },
  {
    "ID": "3291",
    "PARENT_ID": "3289",
    "CODE": "622921",
    "NAME": "临夏县"
  },
  {
    "ID": "3292",
    "PARENT_ID": "3289",
    "CODE": "622922",
    "NAME": "康乐县"
  },
  {
    "ID": "3293",
    "PARENT_ID": "3289",
    "CODE": "622923",
    "NAME": "永靖县"
  },
  {
    "ID": "3294",
    "PARENT_ID": "3289",
    "CODE": "622924",
    "NAME": "广河县"
  },
  {
    "ID": "3295",
    "PARENT_ID": "3289",
    "CODE": "622925",
    "NAME": "和政县"
  },
  {
    "ID": "3296",
    "PARENT_ID": "3289",
    "CODE": "622926",
    "NAME": "东乡族自治县"
  },
  {
    "ID": "3297",
    "PARENT_ID": "3289",
    "CODE": "622927",
    "NAME": "积石山保安族东乡族撒拉族自治县"
  },
  {
    "ID": "3298",
    "PARENT_ID": "3194",
    "CODE": "623000",
    "NAME": "甘南藏族自治州"
  },
  {
    "ID": "3299",
    "PARENT_ID": "3298",
    "CODE": "623001",
    "NAME": "合作市"
  },
  {
    "ID": "33",
    "PARENT_ID": "21",
    "CODE": "120115",
    "NAME": "宝坻区"
  },
  {
    "ID": "330",
    "PARENT_ID": "325",
    "CODE": "140923",
    "NAME": "代县"
  },
  {
    "ID": "3300",
    "PARENT_ID": "3298",
    "CODE": "623021",
    "NAME": "临潭县"
  },
  {
    "ID": "3301",
    "PARENT_ID": "3298",
    "CODE": "623022",
    "NAME": "卓尼县"
  },
  {
    "ID": "3302",
    "PARENT_ID": "3298",
    "CODE": "623023",
    "NAME": "舟曲县"
  },
  {
    "ID": "3303",
    "PARENT_ID": "3298",
    "CODE": "623024",
    "NAME": "迭部县"
  },
  {
    "ID": "3304",
    "PARENT_ID": "3298",
    "CODE": "623025",
    "NAME": "玛曲县"
  },
  {
    "ID": "3305",
    "PARENT_ID": "3298",
    "CODE": "623026",
    "NAME": "碌曲县"
  },
  {
    "ID": "3306",
    "PARENT_ID": "3298",
    "CODE": "623027",
    "NAME": "夏河县"
  },
  {
    "ID": "3307",
    "PARENT_ID": "0",
    "CODE": "630000",
    "NAME": "青海省"
  },
  {
    "ID": "3308",
    "PARENT_ID": "3307",
    "CODE": "630100",
    "NAME": "西宁市"
  },
  {
    "ID": "3309",
    "PARENT_ID": "3308",
    "CODE": "630101",
    "NAME": "市辖区"
  },
  {
    "ID": "331",
    "PARENT_ID": "325",
    "CODE": "140924",
    "NAME": "繁峙县"
  },
  {
    "ID": "3310",
    "PARENT_ID": "3308",
    "CODE": "630102",
    "NAME": "城东区"
  },
  {
    "ID": "3311",
    "PARENT_ID": "3308",
    "CODE": "630103",
    "NAME": "城中区"
  },
  {
    "ID": "3312",
    "PARENT_ID": "3308",
    "CODE": "630104",
    "NAME": "城西区"
  },
  {
    "ID": "3313",
    "PARENT_ID": "3308",
    "CODE": "630105",
    "NAME": "城北区"
  },
  {
    "ID": "3314",
    "PARENT_ID": "3308",
    "CODE": "630121",
    "NAME": "大通回族土族自治县"
  },
  {
    "ID": "3315",
    "PARENT_ID": "3308",
    "CODE": "630122",
    "NAME": "湟中县"
  },
  {
    "ID": "3316",
    "PARENT_ID": "3308",
    "CODE": "630123",
    "NAME": "湟源县"
  },
  {
    "ID": "3317",
    "PARENT_ID": "3307",
    "CODE": "630200",
    "NAME": "海东市"
  },
  {
    "ID": "3318",
    "PARENT_ID": "3317",
    "CODE": "630202",
    "NAME": "乐都区"
  },
  {
    "ID": "3319",
    "PARENT_ID": "3317",
    "CODE": "630221",
    "NAME": "平安县"
  },
  {
    "ID": "332",
    "PARENT_ID": "325",
    "CODE": "140925",
    "NAME": "宁武县"
  },
  {
    "ID": "3320",
    "PARENT_ID": "3317",
    "CODE": "630222",
    "NAME": "民和回族土族自治县"
  },
  {
    "ID": "3321",
    "PARENT_ID": "3317",
    "CODE": "630223",
    "NAME": "互助土族自治县"
  },
  {
    "ID": "3322",
    "PARENT_ID": "3317",
    "CODE": "630224",
    "NAME": "化隆回族自治县"
  },
  {
    "ID": "3323",
    "PARENT_ID": "3317",
    "CODE": "630225",
    "NAME": "循化撒拉族自治县"
  },
  {
    "ID": "3324",
    "PARENT_ID": "3307",
    "CODE": "632200",
    "NAME": "海北藏族自治州"
  },
  {
    "ID": "3325",
    "PARENT_ID": "3324",
    "CODE": "632221",
    "NAME": "门源回族自治县"
  },
  {
    "ID": "3326",
    "PARENT_ID": "3324",
    "CODE": "632222",
    "NAME": "祁连县"
  },
  {
    "ID": "3327",
    "PARENT_ID": "3324",
    "CODE": "632223",
    "NAME": "海晏县"
  },
  {
    "ID": "3328",
    "PARENT_ID": "3324",
    "CODE": "632224",
    "NAME": "刚察县"
  },
  {
    "ID": "3329",
    "PARENT_ID": "3307",
    "CODE": "632300",
    "NAME": "黄南藏族自治州"
  },
  {
    "ID": "333",
    "PARENT_ID": "325",
    "CODE": "140926",
    "NAME": "静乐县"
  },
  {
    "ID": "3330",
    "PARENT_ID": "3329",
    "CODE": "632321",
    "NAME": "同仁县"
  },
  {
    "ID": "3331",
    "PARENT_ID": "3329",
    "CODE": "632322",
    "NAME": "尖扎县"
  },
  {
    "ID": "3332",
    "PARENT_ID": "3329",
    "CODE": "632323",
    "NAME": "泽库县"
  },
  {
    "ID": "3333",
    "PARENT_ID": "3329",
    "CODE": "632324",
    "NAME": "河南蒙古族自治县"
  },
  {
    "ID": "3334",
    "PARENT_ID": "3307",
    "CODE": "632500",
    "NAME": "海南藏族自治州"
  },
  {
    "ID": "3335",
    "PARENT_ID": "3334",
    "CODE": "632521",
    "NAME": "共和县"
  },
  {
    "ID": "3336",
    "PARENT_ID": "3334",
    "CODE": "632522",
    "NAME": "同德县"
  },
  {
    "ID": "3337",
    "PARENT_ID": "3334",
    "CODE": "632523",
    "NAME": "贵德县"
  },
  {
    "ID": "3338",
    "PARENT_ID": "3334",
    "CODE": "632524",
    "NAME": "兴海县"
  },
  {
    "ID": "3339",
    "PARENT_ID": "3334",
    "CODE": "632525",
    "NAME": "贵南县"
  },
  {
    "ID": "334",
    "PARENT_ID": "325",
    "CODE": "140927",
    "NAME": "神池县"
  },
  {
    "ID": "3340",
    "PARENT_ID": "3307",
    "CODE": "632600",
    "NAME": "果洛藏族自治州"
  },
  {
    "ID": "3341",
    "PARENT_ID": "3340",
    "CODE": "632621",
    "NAME": "玛沁县"
  },
  {
    "ID": "3342",
    "PARENT_ID": "3340",
    "CODE": "632622",
    "NAME": "班玛县"
  },
  {
    "ID": "3343",
    "PARENT_ID": "3340",
    "CODE": "632623",
    "NAME": "甘德县"
  },
  {
    "ID": "3344",
    "PARENT_ID": "3340",
    "CODE": "632624",
    "NAME": "达日县"
  },
  {
    "ID": "3345",
    "PARENT_ID": "3340",
    "CODE": "632625",
    "NAME": "久治县"
  },
  {
    "ID": "3346",
    "PARENT_ID": "3340",
    "CODE": "632626",
    "NAME": "玛多县"
  },
  {
    "ID": "3347",
    "PARENT_ID": "3307",
    "CODE": "632700",
    "NAME": "玉树藏族自治州"
  },
  {
    "ID": "3348",
    "PARENT_ID": "3347",
    "CODE": "632701",
    "NAME": "玉树市"
  },
  {
    "ID": "3349",
    "PARENT_ID": "3347",
    "CODE": "632722",
    "NAME": "杂多县"
  },
  {
    "ID": "335",
    "PARENT_ID": "325",
    "CODE": "140928",
    "NAME": "五寨县"
  },
  {
    "ID": "3350",
    "PARENT_ID": "3347",
    "CODE": "632723",
    "NAME": "称多县"
  },
  {
    "ID": "3351",
    "PARENT_ID": "3347",
    "CODE": "632724",
    "NAME": "治多县"
  },
  {
    "ID": "3352",
    "PARENT_ID": "3347",
    "CODE": "632725",
    "NAME": "囊谦县"
  },
  {
    "ID": "3353",
    "PARENT_ID": "3347",
    "CODE": "632726",
    "NAME": "曲麻莱县"
  },
  {
    "ID": "3354",
    "PARENT_ID": "3307",
    "CODE": "632800",
    "NAME": "海西蒙古族藏族自治州"
  },
  {
    "ID": "3355",
    "PARENT_ID": "3354",
    "CODE": "632801",
    "NAME": "格尔木市"
  },
  {
    "ID": "3356",
    "PARENT_ID": "3354",
    "CODE": "632802",
    "NAME": "德令哈市"
  },
  {
    "ID": "3357",
    "PARENT_ID": "3354",
    "CODE": "632821",
    "NAME": "乌兰县"
  },
  {
    "ID": "3358",
    "PARENT_ID": "3354",
    "CODE": "632822",
    "NAME": "都兰县"
  },
  {
    "ID": "3359",
    "PARENT_ID": "3354",
    "CODE": "632823",
    "NAME": "天峻县"
  },
  {
    "ID": "336",
    "PARENT_ID": "325",
    "CODE": "140929",
    "NAME": "岢岚县"
  },
  {
    "ID": "3360",
    "PARENT_ID": "0",
    "CODE": "640000",
    "NAME": "宁夏回族自治区"
  },
  {
    "ID": "3361",
    "PARENT_ID": "3360",
    "CODE": "640100",
    "NAME": "银川市"
  },
  {
    "ID": "3362",
    "PARENT_ID": "3361",
    "CODE": "640101",
    "NAME": "市辖区"
  },
  {
    "ID": "3363",
    "PARENT_ID": "3361",
    "CODE": "640104",
    "NAME": "兴庆区"
  },
  {
    "ID": "3364",
    "PARENT_ID": "3361",
    "CODE": "640105",
    "NAME": "西夏区"
  },
  {
    "ID": "3365",
    "PARENT_ID": "3361",
    "CODE": "640106",
    "NAME": "金凤区"
  },
  {
    "ID": "3366",
    "PARENT_ID": "3361",
    "CODE": "640121",
    "NAME": "永宁县"
  },
  {
    "ID": "3367",
    "PARENT_ID": "3361",
    "CODE": "640122",
    "NAME": "贺兰县"
  },
  {
    "ID": "3368",
    "PARENT_ID": "3361",
    "CODE": "640181",
    "NAME": "灵武市"
  },
  {
    "ID": "3369",
    "PARENT_ID": "3360",
    "CODE": "640200",
    "NAME": "石嘴山市"
  },
  {
    "ID": "337",
    "PARENT_ID": "325",
    "CODE": "140930",
    "NAME": "河曲县"
  },
  {
    "ID": "3370",
    "PARENT_ID": "3369",
    "CODE": "640201",
    "NAME": "市辖区"
  },
  {
    "ID": "3371",
    "PARENT_ID": "3369",
    "CODE": "640202",
    "NAME": "大武口区"
  },
  {
    "ID": "3372",
    "PARENT_ID": "3369",
    "CODE": "640205",
    "NAME": "惠农区"
  },
  {
    "ID": "3373",
    "PARENT_ID": "3369",
    "CODE": "640221",
    "NAME": "平罗县"
  },
  {
    "ID": "3374",
    "PARENT_ID": "3360",
    "CODE": "640300",
    "NAME": "吴忠市"
  },
  {
    "ID": "3375",
    "PARENT_ID": "3374",
    "CODE": "640301",
    "NAME": "市辖区"
  },
  {
    "ID": "3376",
    "PARENT_ID": "3374",
    "CODE": "640302",
    "NAME": "利通区"
  },
  {
    "ID": "3377",
    "PARENT_ID": "3374",
    "CODE": "640303",
    "NAME": "红寺堡区"
  },
  {
    "ID": "3378",
    "PARENT_ID": "3374",
    "CODE": "640323",
    "NAME": "盐池县"
  },
  {
    "ID": "3379",
    "PARENT_ID": "3374",
    "CODE": "640324",
    "NAME": "同心县"
  },
  {
    "ID": "338",
    "PARENT_ID": "325",
    "CODE": "140931",
    "NAME": "保德县"
  },
  {
    "ID": "3380",
    "PARENT_ID": "3374",
    "CODE": "640381",
    "NAME": "青铜峡市"
  },
  {
    "ID": "3381",
    "PARENT_ID": "3360",
    "CODE": "640400",
    "NAME": "固原市"
  },
  {
    "ID": "3382",
    "PARENT_ID": "3381",
    "CODE": "640401",
    "NAME": "市辖区"
  },
  {
    "ID": "3383",
    "PARENT_ID": "3381",
    "CODE": "640402",
    "NAME": "原州区"
  },
  {
    "ID": "3384",
    "PARENT_ID": "3381",
    "CODE": "640422",
    "NAME": "西吉县"
  },
  {
    "ID": "3385",
    "PARENT_ID": "3381",
    "CODE": "640423",
    "NAME": "隆德县"
  },
  {
    "ID": "3386",
    "PARENT_ID": "3381",
    "CODE": "640424",
    "NAME": "泾源县"
  },
  {
    "ID": "3387",
    "PARENT_ID": "3381",
    "CODE": "640425",
    "NAME": "彭阳县"
  },
  {
    "ID": "3388",
    "PARENT_ID": "3360",
    "CODE": "640500",
    "NAME": "中卫市"
  },
  {
    "ID": "3389",
    "PARENT_ID": "3388",
    "CODE": "640501",
    "NAME": "市辖区"
  },
  {
    "ID": "339",
    "PARENT_ID": "325",
    "CODE": "140932",
    "NAME": "偏关县"
  },
  {
    "ID": "3390",
    "PARENT_ID": "3388",
    "CODE": "640502",
    "NAME": "沙坡头区"
  },
  {
    "ID": "3391",
    "PARENT_ID": "3388",
    "CODE": "640521",
    "NAME": "中宁县"
  },
  {
    "ID": "3392",
    "PARENT_ID": "3388",
    "CODE": "640522",
    "NAME": "海原县"
  },
  {
    "ID": "3393",
    "PARENT_ID": "0",
    "CODE": "650000",
    "NAME": "新疆维吾尔自治区"
  },
  {
    "ID": "3394",
    "PARENT_ID": "3393",
    "CODE": "650100",
    "NAME": "乌鲁木齐市"
  },
  {
    "ID": "3395",
    "PARENT_ID": "3394",
    "CODE": "650101",
    "NAME": "市辖区"
  },
  {
    "ID": "3396",
    "PARENT_ID": "3394",
    "CODE": "650102",
    "NAME": "天山区"
  },
  {
    "ID": "3397",
    "PARENT_ID": "3394",
    "CODE": "650103",
    "NAME": "沙依巴克区"
  },
  {
    "ID": "3398",
    "PARENT_ID": "3394",
    "CODE": "650104",
    "NAME": "新市区"
  },
  {
    "ID": "3399",
    "PARENT_ID": "3394",
    "CODE": "650105",
    "NAME": "水磨沟区"
  },
  {
    "ID": "34",
    "PARENT_ID": "21",
    "CODE": "120116",
    "NAME": "滨海新区"
  },
  {
    "ID": "340",
    "PARENT_ID": "325",
    "CODE": "140981",
    "NAME": "原平市"
  },
  {
    "ID": "3400",
    "PARENT_ID": "3394",
    "CODE": "650106",
    "NAME": "头屯河区"
  },
  {
    "ID": "3401",
    "PARENT_ID": "3394",
    "CODE": "650107",
    "NAME": "达坂城区"
  },
  {
    "ID": "3402",
    "PARENT_ID": "3394",
    "CODE": "650109",
    "NAME": "米东区"
  },
  {
    "ID": "3403",
    "PARENT_ID": "3394",
    "CODE": "650121",
    "NAME": "乌鲁木齐县"
  },
  {
    "ID": "3404",
    "PARENT_ID": "3393",
    "CODE": "650200",
    "NAME": "克拉玛依市"
  },
  {
    "ID": "3405",
    "PARENT_ID": "3404",
    "CODE": "650201",
    "NAME": "市辖区"
  },
  {
    "ID": "3406",
    "PARENT_ID": "3404",
    "CODE": "650202",
    "NAME": "独山子区"
  },
  {
    "ID": "3407",
    "PARENT_ID": "3404",
    "CODE": "650203",
    "NAME": "克拉玛依区"
  },
  {
    "ID": "3408",
    "PARENT_ID": "3404",
    "CODE": "650204",
    "NAME": "白碱滩区"
  },
  {
    "ID": "3409",
    "PARENT_ID": "3404",
    "CODE": "650205",
    "NAME": "乌尔禾区"
  },
  {
    "ID": "341",
    "PARENT_ID": "233",
    "CODE": "141000",
    "NAME": "临汾市"
  },
  {
    "ID": "3410",
    "PARENT_ID": "3393",
    "CODE": "652100",
    "NAME": "吐鲁番地区"
  },
  {
    "ID": "3411",
    "PARENT_ID": "3410",
    "CODE": "652101",
    "NAME": "吐鲁番市"
  },
  {
    "ID": "3412",
    "PARENT_ID": "3410",
    "CODE": "652122",
    "NAME": "鄯善县"
  },
  {
    "ID": "3413",
    "PARENT_ID": "3410",
    "CODE": "652123",
    "NAME": "托克逊县"
  },
  {
    "ID": "3414",
    "PARENT_ID": "3393",
    "CODE": "652200",
    "NAME": "哈密地区"
  },
  {
    "ID": "3415",
    "PARENT_ID": "3414",
    "CODE": "652201",
    "NAME": "哈密市"
  },
  {
    "ID": "3416",
    "PARENT_ID": "3414",
    "CODE": "652222",
    "NAME": "巴里坤哈萨克自治县"
  },
  {
    "ID": "3417",
    "PARENT_ID": "3414",
    "CODE": "652223",
    "NAME": "伊吾县"
  },
  {
    "ID": "3418",
    "PARENT_ID": "3393",
    "CODE": "652300",
    "NAME": "昌吉回族自治州"
  },
  {
    "ID": "3419",
    "PARENT_ID": "3418",
    "CODE": "652301",
    "NAME": "昌吉市"
  },
  {
    "ID": "342",
    "PARENT_ID": "341",
    "CODE": "141001",
    "NAME": "市辖区"
  },
  {
    "ID": "3420",
    "PARENT_ID": "3418",
    "CODE": "652302",
    "NAME": "阜康市"
  },
  {
    "ID": "3421",
    "PARENT_ID": "3418",
    "CODE": "652323",
    "NAME": "呼图壁县"
  },
  {
    "ID": "3422",
    "PARENT_ID": "3418",
    "CODE": "652324",
    "NAME": "玛纳斯县"
  },
  {
    "ID": "3423",
    "PARENT_ID": "3418",
    "CODE": "652325",
    "NAME": "奇台县"
  },
  {
    "ID": "3424",
    "PARENT_ID": "3418",
    "CODE": "652327",
    "NAME": "吉木萨尔县"
  },
  {
    "ID": "3425",
    "PARENT_ID": "3418",
    "CODE": "652328",
    "NAME": "木垒哈萨克自治县"
  },
  {
    "ID": "3426",
    "PARENT_ID": "3393",
    "CODE": "652700",
    "NAME": "博尔塔拉蒙古自治州"
  },
  {
    "ID": "3427",
    "PARENT_ID": "3426",
    "CODE": "652701",
    "NAME": "博乐市"
  },
  {
    "ID": "3428",
    "PARENT_ID": "3426",
    "CODE": "652702",
    "NAME": "阿拉山口市"
  },
  {
    "ID": "3429",
    "PARENT_ID": "3426",
    "CODE": "652722",
    "NAME": "精河县"
  },
  {
    "ID": "343",
    "PARENT_ID": "341",
    "CODE": "141002",
    "NAME": "尧都区"
  },
  {
    "ID": "3430",
    "PARENT_ID": "3426",
    "CODE": "652723",
    "NAME": "温泉县"
  },
  {
    "ID": "3431",
    "PARENT_ID": "3393",
    "CODE": "652800",
    "NAME": "巴音郭楞蒙古自治州"
  },
  {
    "ID": "3432",
    "PARENT_ID": "3431",
    "CODE": "652801",
    "NAME": "库尔勒市"
  },
  {
    "ID": "3433",
    "PARENT_ID": "3431",
    "CODE": "652822",
    "NAME": "轮台县"
  },
  {
    "ID": "3434",
    "PARENT_ID": "3431",
    "CODE": "652823",
    "NAME": "尉犁县"
  },
  {
    "ID": "3435",
    "PARENT_ID": "3431",
    "CODE": "652824",
    "NAME": "若羌县"
  },
  {
    "ID": "3436",
    "PARENT_ID": "3431",
    "CODE": "652825",
    "NAME": "且末县"
  },
  {
    "ID": "3437",
    "PARENT_ID": "3431",
    "CODE": "652826",
    "NAME": "焉耆回族自治县"
  },
  {
    "ID": "3438",
    "PARENT_ID": "3431",
    "CODE": "652827",
    "NAME": "和静县"
  },
  {
    "ID": "3439",
    "PARENT_ID": "3431",
    "CODE": "652828",
    "NAME": "和硕县"
  },
  {
    "ID": "344",
    "PARENT_ID": "341",
    "CODE": "141021",
    "NAME": "曲沃县"
  },
  {
    "ID": "3440",
    "PARENT_ID": "3431",
    "CODE": "652829",
    "NAME": "博湖县"
  },
  {
    "ID": "3441",
    "PARENT_ID": "3393",
    "CODE": "652900",
    "NAME": "阿克苏地区"
  },
  {
    "ID": "3442",
    "PARENT_ID": "3441",
    "CODE": "652901",
    "NAME": "阿克苏市"
  },
  {
    "ID": "3443",
    "PARENT_ID": "3441",
    "CODE": "652922",
    "NAME": "温宿县"
  },
  {
    "ID": "3444",
    "PARENT_ID": "3441",
    "CODE": "652923",
    "NAME": "库车县"
  },
  {
    "ID": "3445",
    "PARENT_ID": "3441",
    "CODE": "652924",
    "NAME": "沙雅县"
  },
  {
    "ID": "3446",
    "PARENT_ID": "3441",
    "CODE": "652925",
    "NAME": "新和县"
  },
  {
    "ID": "3447",
    "PARENT_ID": "3441",
    "CODE": "652926",
    "NAME": "拜城县"
  },
  {
    "ID": "3448",
    "PARENT_ID": "3441",
    "CODE": "652927",
    "NAME": "乌什县"
  },
  {
    "ID": "3449",
    "PARENT_ID": "3441",
    "CODE": "652928",
    "NAME": "阿瓦提县"
  },
  {
    "ID": "345",
    "PARENT_ID": "341",
    "CODE": "141022",
    "NAME": "翼城县"
  },
  {
    "ID": "3450",
    "PARENT_ID": "3441",
    "CODE": "652929",
    "NAME": "柯坪县"
  },
  {
    "ID": "3451",
    "PARENT_ID": "3393",
    "CODE": "653000",
    "NAME": "克孜勒苏柯尔克孜自治州"
  },
  {
    "ID": "3452",
    "PARENT_ID": "3451",
    "CODE": "653001",
    "NAME": "阿图什市"
  },
  {
    "ID": "3453",
    "PARENT_ID": "3451",
    "CODE": "653022",
    "NAME": "阿克陶县"
  },
  {
    "ID": "3454",
    "PARENT_ID": "3451",
    "CODE": "653023",
    "NAME": "阿合奇县"
  },
  {
    "ID": "3455",
    "PARENT_ID": "3451",
    "CODE": "653024",
    "NAME": "乌恰县"
  },
  {
    "ID": "3456",
    "PARENT_ID": "3393",
    "CODE": "653100",
    "NAME": "喀什地区"
  },
  {
    "ID": "3457",
    "PARENT_ID": "3456",
    "CODE": "653101",
    "NAME": "喀什市"
  },
  {
    "ID": "3458",
    "PARENT_ID": "3456",
    "CODE": "653121",
    "NAME": "疏附县"
  },
  {
    "ID": "3459",
    "PARENT_ID": "3456",
    "CODE": "653122",
    "NAME": "疏勒县"
  },
  {
    "ID": "346",
    "PARENT_ID": "341",
    "CODE": "141023",
    "NAME": "襄汾县"
  },
  {
    "ID": "3460",
    "PARENT_ID": "3456",
    "CODE": "653123",
    "NAME": "英吉沙县"
  },
  {
    "ID": "3461",
    "PARENT_ID": "3456",
    "CODE": "653124",
    "NAME": "泽普县"
  },
  {
    "ID": "3462",
    "PARENT_ID": "3456",
    "CODE": "653125",
    "NAME": "莎车县"
  },
  {
    "ID": "3463",
    "PARENT_ID": "3456",
    "CODE": "653126",
    "NAME": "叶城县"
  },
  {
    "ID": "3464",
    "PARENT_ID": "3456",
    "CODE": "653127",
    "NAME": "麦盖提县"
  },
  {
    "ID": "3465",
    "PARENT_ID": "3456",
    "CODE": "653128",
    "NAME": "岳普湖县"
  },
  {
    "ID": "3466",
    "PARENT_ID": "3456",
    "CODE": "653129",
    "NAME": "伽师县"
  },
  {
    "ID": "3467",
    "PARENT_ID": "3456",
    "CODE": "653130",
    "NAME": "巴楚县"
  },
  {
    "ID": "3468",
    "PARENT_ID": "3456",
    "CODE": "653131",
    "NAME": "塔什库尔干塔吉克自治县"
  },
  {
    "ID": "3469",
    "PARENT_ID": "3393",
    "CODE": "653200",
    "NAME": "和田地区"
  },
  {
    "ID": "347",
    "PARENT_ID": "341",
    "CODE": "141024",
    "NAME": "洪洞县"
  },
  {
    "ID": "3470",
    "PARENT_ID": "3469",
    "CODE": "653201",
    "NAME": "和田市"
  },
  {
    "ID": "3471",
    "PARENT_ID": "3469",
    "CODE": "653221",
    "NAME": "和田县"
  },
  {
    "ID": "3472",
    "PARENT_ID": "3469",
    "CODE": "653222",
    "NAME": "墨玉县"
  },
  {
    "ID": "3473",
    "PARENT_ID": "3469",
    "CODE": "653223",
    "NAME": "皮山县"
  },
  {
    "ID": "3474",
    "PARENT_ID": "3469",
    "CODE": "653224",
    "NAME": "洛浦县"
  },
  {
    "ID": "3475",
    "PARENT_ID": "3469",
    "CODE": "653225",
    "NAME": "策勒县"
  },
  {
    "ID": "3476",
    "PARENT_ID": "3469",
    "CODE": "653226",
    "NAME": "于田县"
  },
  {
    "ID": "3477",
    "PARENT_ID": "3469",
    "CODE": "653227",
    "NAME": "民丰县"
  },
  {
    "ID": "3478",
    "PARENT_ID": "3393",
    "CODE": "654000",
    "NAME": "伊犁哈萨克自治州"
  },
  {
    "ID": "3479",
    "PARENT_ID": "3478",
    "CODE": "654002",
    "NAME": "伊宁市"
  },
  {
    "ID": "348",
    "PARENT_ID": "341",
    "CODE": "141025",
    "NAME": "古县"
  },
  {
    "ID": "3480",
    "PARENT_ID": "3478",
    "CODE": "654003",
    "NAME": "奎屯市"
  },
  {
    "ID": "3481",
    "PARENT_ID": "3478",
    "CODE": "654021",
    "NAME": "伊宁县"
  },
  {
    "ID": "3482",
    "PARENT_ID": "3478",
    "CODE": "654022",
    "NAME": "察布查尔锡伯自治县"
  },
  {
    "ID": "3483",
    "PARENT_ID": "3478",
    "CODE": "654023",
    "NAME": "霍城县"
  },
  {
    "ID": "3484",
    "PARENT_ID": "3478",
    "CODE": "654024",
    "NAME": "巩留县"
  },
  {
    "ID": "3485",
    "PARENT_ID": "3478",
    "CODE": "654025",
    "NAME": "新源县"
  },
  {
    "ID": "3486",
    "PARENT_ID": "3478",
    "CODE": "654026",
    "NAME": "昭苏县"
  },
  {
    "ID": "3487",
    "PARENT_ID": "3478",
    "CODE": "654027",
    "NAME": "特克斯县"
  },
  {
    "ID": "3488",
    "PARENT_ID": "3478",
    "CODE": "654028",
    "NAME": "尼勒克县"
  },
  {
    "ID": "3489",
    "PARENT_ID": "3393",
    "CODE": "654200",
    "NAME": "塔城地区"
  },
  {
    "ID": "349",
    "PARENT_ID": "341",
    "CODE": "141026",
    "NAME": "安泽县"
  },
  {
    "ID": "3490",
    "PARENT_ID": "3489",
    "CODE": "654201",
    "NAME": "塔城市"
  },
  {
    "ID": "3491",
    "PARENT_ID": "3489",
    "CODE": "654202",
    "NAME": "乌苏市"
  },
  {
    "ID": "3492",
    "PARENT_ID": "3489",
    "CODE": "654221",
    "NAME": "额敏县"
  },
  {
    "ID": "3493",
    "PARENT_ID": "3489",
    "CODE": "654223",
    "NAME": "沙湾县"
  },
  {
    "ID": "3494",
    "PARENT_ID": "3489",
    "CODE": "654224",
    "NAME": "托里县"
  },
  {
    "ID": "3495",
    "PARENT_ID": "3489",
    "CODE": "654225",
    "NAME": "裕民县"
  },
  {
    "ID": "3496",
    "PARENT_ID": "3489",
    "CODE": "654226",
    "NAME": "和布克赛尔蒙古自治县"
  },
  {
    "ID": "3497",
    "PARENT_ID": "3393",
    "CODE": "654300",
    "NAME": "阿勒泰地区"
  },
  {
    "ID": "3498",
    "PARENT_ID": "3497",
    "CODE": "654301",
    "NAME": "阿勒泰市"
  },
  {
    "ID": "3499",
    "PARENT_ID": "3497",
    "CODE": "654321",
    "NAME": "布尔津县"
  },
  {
    "ID": "35",
    "PARENT_ID": "20",
    "CODE": "120200",
    "NAME": "县(天津)"
  },
  {
    "ID": "350",
    "PARENT_ID": "341",
    "CODE": "141027",
    "NAME": "浮山县"
  },
  {
    "ID": "3500",
    "PARENT_ID": "3497",
    "CODE": "654322",
    "NAME": "富蕴县"
  },
  {
    "ID": "3501",
    "PARENT_ID": "3497",
    "CODE": "654323",
    "NAME": "福海县"
  },
  {
    "ID": "3502",
    "PARENT_ID": "3497",
    "CODE": "654324",
    "NAME": "哈巴河县"
  },
  {
    "ID": "3503",
    "PARENT_ID": "3497",
    "CODE": "654325",
    "NAME": "青河县"
  },
  {
    "ID": "3504",
    "PARENT_ID": "3497",
    "CODE": "654326",
    "NAME": "吉木乃县"
  },
  {
    "ID": "3505",
    "PARENT_ID": "3393",
    "CODE": "659000",
    "NAME": "自治区直辖县级行政区划"
  },
  {
    "ID": "3506",
    "PARENT_ID": "3505",
    "CODE": "659001",
    "NAME": "石河子市"
  },
  {
    "ID": "3507",
    "PARENT_ID": "3505",
    "CODE": "659002",
    "NAME": "阿拉尔市"
  },
  {
    "ID": "3508",
    "PARENT_ID": "3505",
    "CODE": "659003",
    "NAME": "图木舒克市"
  },
  {
    "ID": "3509",
    "PARENT_ID": "3505",
    "CODE": "659004",
    "NAME": "五家渠市"
  },
  {
    "ID": "351",
    "PARENT_ID": "341",
    "CODE": "141028",
    "NAME": "吉县"
  },
  {
    "ID": "3510",
    "PARENT_ID": "0",
    "CODE": "710000",
    "NAME": "台湾省"
  },
  {
    "ID": "3511",
    "PARENT_ID": "0",
    "CODE": "810000",
    "NAME": "香港特别行政区"
  },
  {
    "ID": "3512",
    "PARENT_ID": "0",
    "CODE": "820000",
    "NAME": "澳门特别行政区"
  },
  {
    "ID": "352",
    "PARENT_ID": "341",
    "CODE": "141029",
    "NAME": "乡宁县"
  },
  {
    "ID": "353",
    "PARENT_ID": "341",
    "CODE": "141030",
    "NAME": "大宁县"
  },
  {
    "ID": "354",
    "PARENT_ID": "341",
    "CODE": "141031",
    "NAME": "隰县"
  },
  {
    "ID": "355",
    "PARENT_ID": "341",
    "CODE": "141032",
    "NAME": "永和县"
  },
  {
    "ID": "356",
    "PARENT_ID": "341",
    "CODE": "141033",
    "NAME": "蒲县"
  },
  {
    "ID": "357",
    "PARENT_ID": "341",
    "CODE": "141034",
    "NAME": "汾西县"
  },
  {
    "ID": "358",
    "PARENT_ID": "341",
    "CODE": "141081",
    "NAME": "侯马市"
  },
  {
    "ID": "359",
    "PARENT_ID": "341",
    "CODE": "141082",
    "NAME": "霍州市"
  },
  {
    "ID": "36",
    "PARENT_ID": "35",
    "CODE": "120221",
    "NAME": "宁河县"
  },
  {
    "ID": "360",
    "PARENT_ID": "233",
    "CODE": "141100",
    "NAME": "吕梁市"
  },
  {
    "ID": "361",
    "PARENT_ID": "360",
    "CODE": "141101",
    "NAME": "市辖区"
  },
  {
    "ID": "362",
    "PARENT_ID": "360",
    "CODE": "141102",
    "NAME": "离石区"
  },
  {
    "ID": "363",
    "PARENT_ID": "360",
    "CODE": "141121",
    "NAME": "文水县"
  },
  {
    "ID": "364",
    "PARENT_ID": "360",
    "CODE": "141122",
    "NAME": "交城县"
  },
  {
    "ID": "365",
    "PARENT_ID": "360",
    "CODE": "141123",
    "NAME": "兴县"
  },
  {
    "ID": "366",
    "PARENT_ID": "360",
    "CODE": "141124",
    "NAME": "临县"
  },
  {
    "ID": "367",
    "PARENT_ID": "360",
    "CODE": "141125",
    "NAME": "柳林县"
  },
  {
    "ID": "368",
    "PARENT_ID": "360",
    "CODE": "141126",
    "NAME": "石楼县"
  },
  {
    "ID": "369",
    "PARENT_ID": "360",
    "CODE": "141127",
    "NAME": "岚县"
  },
  {
    "ID": "37",
    "PARENT_ID": "35",
    "CODE": "120223",
    "NAME": "静海县"
  },
  {
    "ID": "370",
    "PARENT_ID": "360",
    "CODE": "141128",
    "NAME": "方山县"
  },
  {
    "ID": "371",
    "PARENT_ID": "360",
    "CODE": "141129",
    "NAME": "中阳县"
  },
  {
    "ID": "372",
    "PARENT_ID": "360",
    "CODE": "141130",
    "NAME": "交口县"
  },
  {
    "ID": "373",
    "PARENT_ID": "360",
    "CODE": "141181",
    "NAME": "孝义市"
  },
  {
    "ID": "374",
    "PARENT_ID": "360",
    "CODE": "141182",
    "NAME": "汾阳市"
  },
  {
    "ID": "375",
    "PARENT_ID": "0",
    "CODE": "150000",
    "NAME": "内蒙古自治区"
  },
  {
    "ID": "376",
    "PARENT_ID": "375",
    "CODE": "150100",
    "NAME": "呼和浩特市"
  },
  {
    "ID": "377",
    "PARENT_ID": "376",
    "CODE": "150101",
    "NAME": "市辖区"
  },
  {
    "ID": "378",
    "PARENT_ID": "376",
    "CODE": "150102",
    "NAME": "新城区"
  },
  {
    "ID": "379",
    "PARENT_ID": "376",
    "CODE": "150103",
    "NAME": "回民区"
  },
  {
    "ID": "38",
    "PARENT_ID": "35",
    "CODE": "120225",
    "NAME": "蓟县"
  },
  {
    "ID": "380",
    "PARENT_ID": "376",
    "CODE": "150104",
    "NAME": "玉泉区"
  },
  {
    "ID": "381",
    "PARENT_ID": "376",
    "CODE": "150105",
    "NAME": "赛罕区"
  },
  {
    "ID": "382",
    "PARENT_ID": "376",
    "CODE": "150121",
    "NAME": "土默特左旗"
  },
  {
    "ID": "383",
    "PARENT_ID": "376",
    "CODE": "150122",
    "NAME": "托克托县"
  },
  {
    "ID": "384",
    "PARENT_ID": "376",
    "CODE": "150123",
    "NAME": "和林格尔县"
  },
  {
    "ID": "385",
    "PARENT_ID": "376",
    "CODE": "150124",
    "NAME": "清水河县"
  },
  {
    "ID": "386",
    "PARENT_ID": "376",
    "CODE": "150125",
    "NAME": "武川县"
  },
  {
    "ID": "387",
    "PARENT_ID": "375",
    "CODE": "150200",
    "NAME": "包头市"
  },
  {
    "ID": "388",
    "PARENT_ID": "387",
    "CODE": "150201",
    "NAME": "市辖区"
  },
  {
    "ID": "389",
    "PARENT_ID": "387",
    "CODE": "150202",
    "NAME": "东河区"
  },
  {
    "ID": "39",
    "PARENT_ID": "0",
    "CODE": "130000",
    "NAME": "河北省"
  },
  {
    "ID": "390",
    "PARENT_ID": "387",
    "CODE": "150203",
    "NAME": "昆都仑区"
  },
  {
    "ID": "391",
    "PARENT_ID": "387",
    "CODE": "150204",
    "NAME": "青山区"
  },
  {
    "ID": "392",
    "PARENT_ID": "387",
    "CODE": "150205",
    "NAME": "石拐区"
  },
  {
    "ID": "393",
    "PARENT_ID": "387",
    "CODE": "150206",
    "NAME": "白云鄂博矿区"
  },
  {
    "ID": "394",
    "PARENT_ID": "387",
    "CODE": "150207",
    "NAME": "九原区"
  },
  {
    "ID": "395",
    "PARENT_ID": "387",
    "CODE": "150221",
    "NAME": "土默特右旗"
  },
  {
    "ID": "396",
    "PARENT_ID": "387",
    "CODE": "150222",
    "NAME": "固阳县"
  },
  {
    "ID": "397",
    "PARENT_ID": "387",
    "CODE": "150223",
    "NAME": "达尔罕茂明安联合旗"
  },
  {
    "ID": "398",
    "PARENT_ID": "375",
    "CODE": "150300",
    "NAME": "乌海市"
  },
  {
    "ID": "399",
    "PARENT_ID": "398",
    "CODE": "150301",
    "NAME": "市辖区"
  },
  {
    "ID": "4",
    "PARENT_ID": "2",
    "CODE": "110102",
    "NAME": "西城区"
  },
  {
    "ID": "40",
    "PARENT_ID": "39",
    "CODE": "130100",
    "NAME": "石家庄市"
  },
  {
    "ID": "400",
    "PARENT_ID": "398",
    "CODE": "150302",
    "NAME": "海勃湾区"
  },
  {
    "ID": "401",
    "PARENT_ID": "398",
    "CODE": "150303",
    "NAME": "海南区"
  },
  {
    "ID": "402",
    "PARENT_ID": "398",
    "CODE": "150304",
    "NAME": "乌达区"
  },
  {
    "ID": "403",
    "PARENT_ID": "375",
    "CODE": "150400",
    "NAME": "赤峰市"
  },
  {
    "ID": "404",
    "PARENT_ID": "403",
    "CODE": "150401",
    "NAME": "市辖区"
  },
  {
    "ID": "405",
    "PARENT_ID": "403",
    "CODE": "150402",
    "NAME": "红山区"
  },
  {
    "ID": "406",
    "PARENT_ID": "403",
    "CODE": "150403",
    "NAME": "元宝山区"
  },
  {
    "ID": "407",
    "PARENT_ID": "403",
    "CODE": "150404",
    "NAME": "松山区"
  },
  {
    "ID": "408",
    "PARENT_ID": "403",
    "CODE": "150421",
    "NAME": "阿鲁科尔沁旗"
  },
  {
    "ID": "409",
    "PARENT_ID": "403",
    "CODE": "150422",
    "NAME": "巴林左旗"
  },
  {
    "ID": "41",
    "PARENT_ID": "40",
    "CODE": "130101",
    "NAME": "市辖区"
  },
  {
    "ID": "410",
    "PARENT_ID": "403",
    "CODE": "150423",
    "NAME": "巴林右旗"
  },
  {
    "ID": "411",
    "PARENT_ID": "403",
    "CODE": "150424",
    "NAME": "林西县"
  },
  {
    "ID": "412",
    "PARENT_ID": "403",
    "CODE": "150425",
    "NAME": "克什克腾旗"
  },
  {
    "ID": "413",
    "PARENT_ID": "403",
    "CODE": "150426",
    "NAME": "翁牛特旗"
  },
  {
    "ID": "414",
    "PARENT_ID": "403",
    "CODE": "150428",
    "NAME": "喀喇沁旗"
  },
  {
    "ID": "415",
    "PARENT_ID": "403",
    "CODE": "150429",
    "NAME": "宁城县"
  },
  {
    "ID": "416",
    "PARENT_ID": "403",
    "CODE": "150430",
    "NAME": "敖汉旗"
  },
  {
    "ID": "417",
    "PARENT_ID": "375",
    "CODE": "150500",
    "NAME": "通辽市"
  },
  {
    "ID": "418",
    "PARENT_ID": "417",
    "CODE": "150501",
    "NAME": "市辖区"
  },
  {
    "ID": "419",
    "PARENT_ID": "417",
    "CODE": "150502",
    "NAME": "科尔沁区"
  },
  {
    "ID": "42",
    "PARENT_ID": "40",
    "CODE": "130102",
    "NAME": "长安区"
  },
  {
    "ID": "420",
    "PARENT_ID": "417",
    "CODE": "150521",
    "NAME": "科尔沁左翼中旗"
  },
  {
    "ID": "421",
    "PARENT_ID": "417",
    "CODE": "150522",
    "NAME": "科尔沁左翼后旗"
  },
  {
    "ID": "422",
    "PARENT_ID": "417",
    "CODE": "150523",
    "NAME": "开鲁县"
  },
  {
    "ID": "423",
    "PARENT_ID": "417",
    "CODE": "150524",
    "NAME": "库伦旗"
  },
  {
    "ID": "424",
    "PARENT_ID": "417",
    "CODE": "150525",
    "NAME": "奈曼旗"
  },
  {
    "ID": "425",
    "PARENT_ID": "417",
    "CODE": "150526",
    "NAME": "扎鲁特旗"
  },
  {
    "ID": "426",
    "PARENT_ID": "417",
    "CODE": "150581",
    "NAME": "霍林郭勒市"
  },
  {
    "ID": "427",
    "PARENT_ID": "375",
    "CODE": "150600",
    "NAME": "鄂尔多斯市"
  },
  {
    "ID": "428",
    "PARENT_ID": "427",
    "CODE": "150601",
    "NAME": "市辖区"
  },
  {
    "ID": "429",
    "PARENT_ID": "427",
    "CODE": "150602",
    "NAME": "东胜区"
  },
  {
    "ID": "43",
    "PARENT_ID": "40",
    "CODE": "130104",
    "NAME": "桥西区"
  },
  {
    "ID": "430",
    "PARENT_ID": "427",
    "CODE": "150621",
    "NAME": "达拉特旗"
  },
  {
    "ID": "431",
    "PARENT_ID": "427",
    "CODE": "150622",
    "NAME": "准格尔旗"
  },
  {
    "ID": "432",
    "PARENT_ID": "427",
    "CODE": "150623",
    "NAME": "鄂托克前旗"
  },
  {
    "ID": "433",
    "PARENT_ID": "427",
    "CODE": "150624",
    "NAME": "鄂托克旗"
  },
  {
    "ID": "434",
    "PARENT_ID": "427",
    "CODE": "150625",
    "NAME": "杭锦旗"
  },
  {
    "ID": "435",
    "PARENT_ID": "427",
    "CODE": "150626",
    "NAME": "乌审旗"
  },
  {
    "ID": "436",
    "PARENT_ID": "427",
    "CODE": "150627",
    "NAME": "伊金霍洛旗"
  },
  {
    "ID": "437",
    "PARENT_ID": "375",
    "CODE": "150700",
    "NAME": "呼伦贝尔市"
  },
  {
    "ID": "438",
    "PARENT_ID": "437",
    "CODE": "150701",
    "NAME": "市辖区"
  },
  {
    "ID": "439",
    "PARENT_ID": "437",
    "CODE": "150702",
    "NAME": "海拉尔区"
  },
  {
    "ID": "44",
    "PARENT_ID": "40",
    "CODE": "130105",
    "NAME": "新华区"
  },
  {
    "ID": "440",
    "PARENT_ID": "437",
    "CODE": "150703",
    "NAME": "扎赉诺尔区"
  },
  {
    "ID": "441",
    "PARENT_ID": "437",
    "CODE": "150721",
    "NAME": "阿荣旗"
  },
  {
    "ID": "442",
    "PARENT_ID": "437",
    "CODE": "150722",
    "NAME": "莫力达瓦达斡尔族自治旗"
  },
  {
    "ID": "443",
    "PARENT_ID": "437",
    "CODE": "150723",
    "NAME": "鄂伦春自治旗"
  },
  {
    "ID": "444",
    "PARENT_ID": "437",
    "CODE": "150724",
    "NAME": "鄂温克族自治旗"
  },
  {
    "ID": "445",
    "PARENT_ID": "437",
    "CODE": "150725",
    "NAME": "陈巴尔虎旗"
  },
  {
    "ID": "446",
    "PARENT_ID": "437",
    "CODE": "150726",
    "NAME": "新巴尔虎左旗"
  },
  {
    "ID": "447",
    "PARENT_ID": "437",
    "CODE": "150727",
    "NAME": "新巴尔虎右旗"
  },
  {
    "ID": "448",
    "PARENT_ID": "437",
    "CODE": "150781",
    "NAME": "满洲里市"
  },
  {
    "ID": "449",
    "PARENT_ID": "437",
    "CODE": "150782",
    "NAME": "牙克石市"
  },
  {
    "ID": "45",
    "PARENT_ID": "40",
    "CODE": "130107",
    "NAME": "井陉矿区"
  },
  {
    "ID": "450",
    "PARENT_ID": "437",
    "CODE": "150783",
    "NAME": "扎兰屯市"
  },
  {
    "ID": "451",
    "PARENT_ID": "437",
    "CODE": "150784",
    "NAME": "额尔古纳市"
  },
  {
    "ID": "452",
    "PARENT_ID": "437",
    "CODE": "150785",
    "NAME": "根河市"
  },
  {
    "ID": "453",
    "PARENT_ID": "375",
    "CODE": "150800",
    "NAME": "巴彦淖尔市"
  },
  {
    "ID": "454",
    "PARENT_ID": "453",
    "CODE": "150801",
    "NAME": "市辖区"
  },
  {
    "ID": "455",
    "PARENT_ID": "453",
    "CODE": "150802",
    "NAME": "临河区"
  },
  {
    "ID": "456",
    "PARENT_ID": "453",
    "CODE": "150821",
    "NAME": "五原县"
  },
  {
    "ID": "457",
    "PARENT_ID": "453",
    "CODE": "150822",
    "NAME": "磴口县"
  },
  {
    "ID": "458",
    "PARENT_ID": "453",
    "CODE": "150823",
    "NAME": "乌拉特前旗"
  },
  {
    "ID": "459",
    "PARENT_ID": "453",
    "CODE": "150824",
    "NAME": "乌拉特中旗"
  },
  {
    "ID": "46",
    "PARENT_ID": "40",
    "CODE": "130108",
    "NAME": "裕华区"
  },
  {
    "ID": "460",
    "PARENT_ID": "453",
    "CODE": "150825",
    "NAME": "乌拉特后旗"
  },
  {
    "ID": "461",
    "PARENT_ID": "453",
    "CODE": "150826",
    "NAME": "杭锦后旗"
  },
  {
    "ID": "462",
    "PARENT_ID": "375",
    "CODE": "150900",
    "NAME": "乌兰察布市"
  },
  {
    "ID": "463",
    "PARENT_ID": "462",
    "CODE": "150901",
    "NAME": "市辖区"
  },
  {
    "ID": "464",
    "PARENT_ID": "462",
    "CODE": "150902",
    "NAME": "集宁区"
  },
  {
    "ID": "465",
    "PARENT_ID": "462",
    "CODE": "150921",
    "NAME": "卓资县"
  },
  {
    "ID": "466",
    "PARENT_ID": "462",
    "CODE": "150922",
    "NAME": "化德县"
  },
  {
    "ID": "467",
    "PARENT_ID": "462",
    "CODE": "150923",
    "NAME": "商都县"
  },
  {
    "ID": "468",
    "PARENT_ID": "462",
    "CODE": "150924",
    "NAME": "兴和县"
  },
  {
    "ID": "469",
    "PARENT_ID": "462",
    "CODE": "150925",
    "NAME": "凉城县"
  },
  {
    "ID": "47",
    "PARENT_ID": "40",
    "CODE": "130109",
    "NAME": "藁城区"
  },
  {
    "ID": "470",
    "PARENT_ID": "462",
    "CODE": "150926",
    "NAME": "察哈尔右翼前旗"
  },
  {
    "ID": "471",
    "PARENT_ID": "462",
    "CODE": "150927",
    "NAME": "察哈尔右翼中旗"
  },
  {
    "ID": "472",
    "PARENT_ID": "462",
    "CODE": "150928",
    "NAME": "察哈尔右翼后旗"
  },
  {
    "ID": "473",
    "PARENT_ID": "462",
    "CODE": "150929",
    "NAME": "四子王旗"
  },
  {
    "ID": "474",
    "PARENT_ID": "462",
    "CODE": "150981",
    "NAME": "丰镇市"
  },
  {
    "ID": "475",
    "PARENT_ID": "375",
    "CODE": "152200",
    "NAME": "兴安盟"
  },
  {
    "ID": "476",
    "PARENT_ID": "475",
    "CODE": "152201",
    "NAME": "乌兰浩特市"
  },
  {
    "ID": "477",
    "PARENT_ID": "475",
    "CODE": "152202",
    "NAME": "阿尔山市"
  },
  {
    "ID": "478",
    "PARENT_ID": "475",
    "CODE": "152221",
    "NAME": "科尔沁右翼前旗"
  },
  {
    "ID": "479",
    "PARENT_ID": "475",
    "CODE": "152222",
    "NAME": "科尔沁右翼中旗"
  },
  {
    "ID": "48",
    "PARENT_ID": "40",
    "CODE": "130110",
    "NAME": "鹿泉区"
  },
  {
    "ID": "480",
    "PARENT_ID": "475",
    "CODE": "152223",
    "NAME": "扎赉特旗"
  },
  {
    "ID": "481",
    "PARENT_ID": "475",
    "CODE": "152224",
    "NAME": "突泉县"
  },
  {
    "ID": "482",
    "PARENT_ID": "375",
    "CODE": "152500",
    "NAME": "锡林郭勒盟"
  },
  {
    "ID": "483",
    "PARENT_ID": "482",
    "CODE": "152501",
    "NAME": "二连浩特市"
  },
  {
    "ID": "484",
    "PARENT_ID": "482",
    "CODE": "152502",
    "NAME": "锡林浩特市"
  },
  {
    "ID": "485",
    "PARENT_ID": "482",
    "CODE": "152522",
    "NAME": "阿巴嘎旗"
  },
  {
    "ID": "486",
    "PARENT_ID": "482",
    "CODE": "152523",
    "NAME": "苏尼特左旗"
  },
  {
    "ID": "487",
    "PARENT_ID": "482",
    "CODE": "152524",
    "NAME": "苏尼特右旗"
  },
  {
    "ID": "488",
    "PARENT_ID": "482",
    "CODE": "152525",
    "NAME": "东乌珠穆沁旗"
  },
  {
    "ID": "489",
    "PARENT_ID": "482",
    "CODE": "152526",
    "NAME": "西乌珠穆沁旗"
  },
  {
    "ID": "49",
    "PARENT_ID": "40",
    "CODE": "130111",
    "NAME": "栾城区"
  },
  {
    "ID": "490",
    "PARENT_ID": "482",
    "CODE": "152527",
    "NAME": "太仆寺旗"
  },
  {
    "ID": "491",
    "PARENT_ID": "482",
    "CODE": "152528",
    "NAME": "镶黄旗"
  },
  {
    "ID": "492",
    "PARENT_ID": "482",
    "CODE": "152529",
    "NAME": "正镶白旗"
  },
  {
    "ID": "493",
    "PARENT_ID": "482",
    "CODE": "152530",
    "NAME": "正蓝旗"
  },
  {
    "ID": "494",
    "PARENT_ID": "482",
    "CODE": "152531",
    "NAME": "多伦县"
  },
  {
    "ID": "495",
    "PARENT_ID": "375",
    "CODE": "152900",
    "NAME": "阿拉善盟"
  },
  {
    "ID": "496",
    "PARENT_ID": "495",
    "CODE": "152921",
    "NAME": "阿拉善左旗"
  },
  {
    "ID": "497",
    "PARENT_ID": "495",
    "CODE": "152922",
    "NAME": "阿拉善右旗"
  },
  {
    "ID": "498",
    "PARENT_ID": "495",
    "CODE": "152923",
    "NAME": "额济纳旗"
  },
  {
    "ID": "499",
    "PARENT_ID": "0",
    "CODE": "210000",
    "NAME": "辽宁省"
  },
  {
    "ID": "5",
    "PARENT_ID": "2",
    "CODE": "110105",
    "NAME": "朝阳区"
  },
  {
    "ID": "50",
    "PARENT_ID": "40",
    "CODE": "130121",
    "NAME": "井陉县"
  },
  {
    "ID": "500",
    "PARENT_ID": "499",
    "CODE": "210100",
    "NAME": "沈阳市"
  },
  {
    "ID": "501",
    "PARENT_ID": "500",
    "CODE": "210101",
    "NAME": "市辖区"
  },
  {
    "ID": "502",
    "PARENT_ID": "500",
    "CODE": "210102",
    "NAME": "和平区"
  },
  {
    "ID": "503",
    "PARENT_ID": "500",
    "CODE": "210103",
    "NAME": "沈河区"
  },
  {
    "ID": "504",
    "PARENT_ID": "500",
    "CODE": "210104",
    "NAME": "大东区"
  },
  {
    "ID": "505",
    "PARENT_ID": "500",
    "CODE": "210105",
    "NAME": "皇姑区"
  },
  {
    "ID": "506",
    "PARENT_ID": "500",
    "CODE": "210106",
    "NAME": "铁西区"
  },
  {
    "ID": "507",
    "PARENT_ID": "500",
    "CODE": "210111",
    "NAME": "苏家屯区"
  },
  {
    "ID": "508",
    "PARENT_ID": "500",
    "CODE": "210112",
    "NAME": "浑南区"
  },
  {
    "ID": "509",
    "PARENT_ID": "500",
    "CODE": "210113",
    "NAME": "沈北新区"
  },
  {
    "ID": "51",
    "PARENT_ID": "40",
    "CODE": "130123",
    "NAME": "正定县"
  },
  {
    "ID": "510",
    "PARENT_ID": "500",
    "CODE": "210114",
    "NAME": "于洪区"
  },
  {
    "ID": "511",
    "PARENT_ID": "500",
    "CODE": "210122",
    "NAME": "辽中县"
  },
  {
    "ID": "512",
    "PARENT_ID": "500",
    "CODE": "210123",
    "NAME": "康平县"
  },
  {
    "ID": "513",
    "PARENT_ID": "500",
    "CODE": "210124",
    "NAME": "法库县"
  },
  {
    "ID": "514",
    "PARENT_ID": "500",
    "CODE": "210181",
    "NAME": "新民市"
  },
  {
    "ID": "515",
    "PARENT_ID": "499",
    "CODE": "210200",
    "NAME": "大连市"
  },
  {
    "ID": "516",
    "PARENT_ID": "515",
    "CODE": "210201",
    "NAME": "市辖区"
  },
  {
    "ID": "517",
    "PARENT_ID": "515",
    "CODE": "210202",
    "NAME": "中山区"
  },
  {
    "ID": "518",
    "PARENT_ID": "515",
    "CODE": "210203",
    "NAME": "西岗区"
  },
  {
    "ID": "519",
    "PARENT_ID": "515",
    "CODE": "210204",
    "NAME": "沙河口区"
  },
  {
    "ID": "52",
    "PARENT_ID": "40",
    "CODE": "130125",
    "NAME": "行唐县"
  },
  {
    "ID": "520",
    "PARENT_ID": "515",
    "CODE": "210211",
    "NAME": "甘井子区"
  },
  {
    "ID": "521",
    "PARENT_ID": "515",
    "CODE": "210212",
    "NAME": "旅顺口区"
  },
  {
    "ID": "522",
    "PARENT_ID": "515",
    "CODE": "210213",
    "NAME": "金州区"
  },
  {
    "ID": "523",
    "PARENT_ID": "515",
    "CODE": "210224",
    "NAME": "长海县"
  },
  {
    "ID": "524",
    "PARENT_ID": "515",
    "CODE": "210281",
    "NAME": "瓦房店市"
  },
  {
    "ID": "525",
    "PARENT_ID": "515",
    "CODE": "210282",
    "NAME": "普兰店市"
  },
  {
    "ID": "526",
    "PARENT_ID": "515",
    "CODE": "210283",
    "NAME": "庄河市"
  },
  {
    "ID": "527",
    "PARENT_ID": "499",
    "CODE": "210300",
    "NAME": "鞍山市"
  },
  {
    "ID": "528",
    "PARENT_ID": "527",
    "CODE": "210301",
    "NAME": "市辖区"
  },
  {
    "ID": "529",
    "PARENT_ID": "527",
    "CODE": "210302",
    "NAME": "铁东区"
  },
  {
    "ID": "53",
    "PARENT_ID": "40",
    "CODE": "130126",
    "NAME": "灵寿县"
  },
  {
    "ID": "530",
    "PARENT_ID": "527",
    "CODE": "210303",
    "NAME": "铁西区"
  },
  {
    "ID": "531",
    "PARENT_ID": "527",
    "CODE": "210304",
    "NAME": "立山区"
  },
  {
    "ID": "532",
    "PARENT_ID": "527",
    "CODE": "210311",
    "NAME": "千山区"
  },
  {
    "ID": "533",
    "PARENT_ID": "527",
    "CODE": "210321",
    "NAME": "台安县"
  },
  {
    "ID": "534",
    "PARENT_ID": "527",
    "CODE": "210323",
    "NAME": "岫岩满族自治县"
  },
  {
    "ID": "535",
    "PARENT_ID": "527",
    "CODE": "210381",
    "NAME": "海城市"
  },
  {
    "ID": "536",
    "PARENT_ID": "499",
    "CODE": "210400",
    "NAME": "抚顺市"
  },
  {
    "ID": "537",
    "PARENT_ID": "536",
    "CODE": "210401",
    "NAME": "市辖区"
  },
  {
    "ID": "538",
    "PARENT_ID": "536",
    "CODE": "210402",
    "NAME": "新抚区"
  },
  {
    "ID": "539",
    "PARENT_ID": "536",
    "CODE": "210403",
    "NAME": "东洲区"
  },
  {
    "ID": "54",
    "PARENT_ID": "40",
    "CODE": "130127",
    "NAME": "高邑县"
  },
  {
    "ID": "540",
    "PARENT_ID": "536",
    "CODE": "210404",
    "NAME": "望花区"
  },
  {
    "ID": "541",
    "PARENT_ID": "536",
    "CODE": "210411",
    "NAME": "顺城区"
  },
  {
    "ID": "542",
    "PARENT_ID": "536",
    "CODE": "210421",
    "NAME": "抚顺县"
  },
  {
    "ID": "543",
    "PARENT_ID": "536",
    "CODE": "210422",
    "NAME": "新宾满族自治县"
  },
  {
    "ID": "544",
    "PARENT_ID": "536",
    "CODE": "210423",
    "NAME": "清原满族自治县"
  },
  {
    "ID": "545",
    "PARENT_ID": "499",
    "CODE": "210500",
    "NAME": "本溪市"
  },
  {
    "ID": "546",
    "PARENT_ID": "545",
    "CODE": "210501",
    "NAME": "市辖区"
  },
  {
    "ID": "547",
    "PARENT_ID": "545",
    "CODE": "210502",
    "NAME": "平山区"
  },
  {
    "ID": "548",
    "PARENT_ID": "545",
    "CODE": "210503",
    "NAME": "溪湖区"
  },
  {
    "ID": "549",
    "PARENT_ID": "545",
    "CODE": "210504",
    "NAME": "明山区"
  },
  {
    "ID": "55",
    "PARENT_ID": "40",
    "CODE": "130128",
    "NAME": "深泽县"
  },
  {
    "ID": "550",
    "PARENT_ID": "545",
    "CODE": "210505",
    "NAME": "南芬区"
  },
  {
    "ID": "551",
    "PARENT_ID": "545",
    "CODE": "210521",
    "NAME": "本溪满族自治县"
  },
  {
    "ID": "552",
    "PARENT_ID": "545",
    "CODE": "210522",
    "NAME": "桓仁满族自治县"
  },
  {
    "ID": "553",
    "PARENT_ID": "499",
    "CODE": "210600",
    "NAME": "丹东市"
  },
  {
    "ID": "554",
    "PARENT_ID": "553",
    "CODE": "210601",
    "NAME": "市辖区"
  },
  {
    "ID": "555",
    "PARENT_ID": "553",
    "CODE": "210602",
    "NAME": "元宝区"
  },
  {
    "ID": "556",
    "PARENT_ID": "553",
    "CODE": "210603",
    "NAME": "振兴区"
  },
  {
    "ID": "557",
    "PARENT_ID": "553",
    "CODE": "210604",
    "NAME": "振安区"
  },
  {
    "ID": "558",
    "PARENT_ID": "553",
    "CODE": "210624",
    "NAME": "宽甸满族自治县"
  },
  {
    "ID": "559",
    "PARENT_ID": "553",
    "CODE": "210681",
    "NAME": "东港市"
  },
  {
    "ID": "56",
    "PARENT_ID": "40",
    "CODE": "130129",
    "NAME": "赞皇县"
  },
  {
    "ID": "560",
    "PARENT_ID": "553",
    "CODE": "210682",
    "NAME": "凤城市"
  },
  {
    "ID": "561",
    "PARENT_ID": "499",
    "CODE": "210700",
    "NAME": "锦州市"
  },
  {
    "ID": "562",
    "PARENT_ID": "561",
    "CODE": "210701",
    "NAME": "市辖区"
  },
  {
    "ID": "563",
    "PARENT_ID": "561",
    "CODE": "210702",
    "NAME": "古塔区"
  },
  {
    "ID": "564",
    "PARENT_ID": "561",
    "CODE": "210703",
    "NAME": "凌河区"
  },
  {
    "ID": "565",
    "PARENT_ID": "561",
    "CODE": "210711",
    "NAME": "太和区"
  },
  {
    "ID": "566",
    "PARENT_ID": "561",
    "CODE": "210726",
    "NAME": "黑山县"
  },
  {
    "ID": "567",
    "PARENT_ID": "561",
    "CODE": "210727",
    "NAME": "义县"
  },
  {
    "ID": "568",
    "PARENT_ID": "561",
    "CODE": "210781",
    "NAME": "凌海市"
  },
  {
    "ID": "569",
    "PARENT_ID": "561",
    "CODE": "210782",
    "NAME": "北镇市"
  },
  {
    "ID": "57",
    "PARENT_ID": "40",
    "CODE": "130130",
    "NAME": "无极县"
  },
  {
    "ID": "570",
    "PARENT_ID": "499",
    "CODE": "210800",
    "NAME": "营口市"
  },
  {
    "ID": "571",
    "PARENT_ID": "570",
    "CODE": "210801",
    "NAME": "市辖区"
  },
  {
    "ID": "572",
    "PARENT_ID": "570",
    "CODE": "210802",
    "NAME": "站前区"
  },
  {
    "ID": "573",
    "PARENT_ID": "570",
    "CODE": "210803",
    "NAME": "西市区"
  },
  {
    "ID": "574",
    "PARENT_ID": "570",
    "CODE": "210804",
    "NAME": "鲅鱼圈区"
  },
  {
    "ID": "575",
    "PARENT_ID": "570",
    "CODE": "210811",
    "NAME": "老边区"
  },
  {
    "ID": "576",
    "PARENT_ID": "570",
    "CODE": "210881",
    "NAME": "盖州市"
  },
  {
    "ID": "577",
    "PARENT_ID": "570",
    "CODE": "210882",
    "NAME": "大石桥市"
  },
  {
    "ID": "578",
    "PARENT_ID": "499",
    "CODE": "210900",
    "NAME": "阜新市"
  },
  {
    "ID": "579",
    "PARENT_ID": "578",
    "CODE": "210901",
    "NAME": "市辖区"
  },
  {
    "ID": "58",
    "PARENT_ID": "40",
    "CODE": "130131",
    "NAME": "平山县"
  },
  {
    "ID": "580",
    "PARENT_ID": "578",
    "CODE": "210902",
    "NAME": "海州区"
  },
  {
    "ID": "581",
    "PARENT_ID": "578",
    "CODE": "210903",
    "NAME": "新邱区"
  },
  {
    "ID": "582",
    "PARENT_ID": "578",
    "CODE": "210904",
    "NAME": "太平区"
  },
  {
    "ID": "583",
    "PARENT_ID": "578",
    "CODE": "210905",
    "NAME": "清河门区"
  },
  {
    "ID": "584",
    "PARENT_ID": "578",
    "CODE": "210911",
    "NAME": "细河区"
  },
  {
    "ID": "585",
    "PARENT_ID": "578",
    "CODE": "210921",
    "NAME": "阜新蒙古族自治县"
  },
  {
    "ID": "586",
    "PARENT_ID": "578",
    "CODE": "210922",
    "NAME": "彰武县"
  },
  {
    "ID": "587",
    "PARENT_ID": "499",
    "CODE": "211000",
    "NAME": "辽阳市"
  },
  {
    "ID": "588",
    "PARENT_ID": "587",
    "CODE": "211001",
    "NAME": "市辖区"
  },
  {
    "ID": "589",
    "PARENT_ID": "587",
    "CODE": "211002",
    "NAME": "白塔区"
  },
  {
    "ID": "59",
    "PARENT_ID": "40",
    "CODE": "130132",
    "NAME": "元氏县"
  },
  {
    "ID": "590",
    "PARENT_ID": "587",
    "CODE": "211003",
    "NAME": "文圣区"
  },
  {
    "ID": "591",
    "PARENT_ID": "587",
    "CODE": "211004",
    "NAME": "宏伟区"
  },
  {
    "ID": "592",
    "PARENT_ID": "587",
    "CODE": "211005",
    "NAME": "弓长岭区"
  },
  {
    "ID": "593",
    "PARENT_ID": "587",
    "CODE": "211011",
    "NAME": "太子河区"
  },
  {
    "ID": "594",
    "PARENT_ID": "587",
    "CODE": "211021",
    "NAME": "辽阳县"
  },
  {
    "ID": "595",
    "PARENT_ID": "587",
    "CODE": "211081",
    "NAME": "灯塔市"
  },
  {
    "ID": "596",
    "PARENT_ID": "499",
    "CODE": "211100",
    "NAME": "盘锦市"
  },
  {
    "ID": "597",
    "PARENT_ID": "596",
    "CODE": "211101",
    "NAME": "市辖区"
  },
  {
    "ID": "598",
    "PARENT_ID": "596",
    "CODE": "211102",
    "NAME": "双台子区"
  },
  {
    "ID": "599",
    "PARENT_ID": "596",
    "CODE": "211103",
    "NAME": "兴隆台区"
  },
  {
    "ID": "6",
    "PARENT_ID": "2",
    "CODE": "110106",
    "NAME": "丰台区"
  },
  {
    "ID": "60",
    "PARENT_ID": "40",
    "CODE": "130133",
    "NAME": "赵县"
  },
  {
    "ID": "600",
    "PARENT_ID": "596",
    "CODE": "211121",
    "NAME": "大洼县"
  },
  {
    "ID": "601",
    "PARENT_ID": "596",
    "CODE": "211122",
    "NAME": "盘山县"
  },
  {
    "ID": "602",
    "PARENT_ID": "499",
    "CODE": "211200",
    "NAME": "铁岭市"
  },
  {
    "ID": "603",
    "PARENT_ID": "602",
    "CODE": "211201",
    "NAME": "市辖区"
  },
  {
    "ID": "604",
    "PARENT_ID": "602",
    "CODE": "211202",
    "NAME": "银州区"
  },
  {
    "ID": "605",
    "PARENT_ID": "602",
    "CODE": "211204",
    "NAME": "清河区"
  },
  {
    "ID": "606",
    "PARENT_ID": "602",
    "CODE": "211221",
    "NAME": "铁岭县"
  },
  {
    "ID": "607",
    "PARENT_ID": "602",
    "CODE": "211223",
    "NAME": "西丰县"
  },
  {
    "ID": "608",
    "PARENT_ID": "602",
    "CODE": "211224",
    "NAME": "昌图县"
  },
  {
    "ID": "609",
    "PARENT_ID": "602",
    "CODE": "211281",
    "NAME": "调兵山市"
  },
  {
    "ID": "61",
    "PARENT_ID": "40",
    "CODE": "130181",
    "NAME": "辛集市"
  },
  {
    "ID": "610",
    "PARENT_ID": "602",
    "CODE": "211282",
    "NAME": "开原市"
  },
  {
    "ID": "611",
    "PARENT_ID": "499",
    "CODE": "211300",
    "NAME": "朝阳市"
  },
  {
    "ID": "612",
    "PARENT_ID": "611",
    "CODE": "211301",
    "NAME": "市辖区"
  },
  {
    "ID": "613",
    "PARENT_ID": "611",
    "CODE": "211302",
    "NAME": "双塔区"
  },
  {
    "ID": "614",
    "PARENT_ID": "611",
    "CODE": "211303",
    "NAME": "龙城区"
  },
  {
    "ID": "615",
    "PARENT_ID": "611",
    "CODE": "211321",
    "NAME": "朝阳县"
  },
  {
    "ID": "616",
    "PARENT_ID": "611",
    "CODE": "211322",
    "NAME": "建平县"
  },
  {
    "ID": "617",
    "PARENT_ID": "611",
    "CODE": "211324",
    "NAME": "喀喇沁左翼蒙古族自治县"
  },
  {
    "ID": "618",
    "PARENT_ID": "611",
    "CODE": "211381",
    "NAME": "北票市"
  },
  {
    "ID": "619",
    "PARENT_ID": "611",
    "CODE": "211382",
    "NAME": "凌源市"
  },
  {
    "ID": "62",
    "PARENT_ID": "40",
    "CODE": "130183",
    "NAME": "晋州市"
  },
  {
    "ID": "620",
    "PARENT_ID": "499",
    "CODE": "211400",
    "NAME": "葫芦岛市"
  },
  {
    "ID": "621",
    "PARENT_ID": "620",
    "CODE": "211401",
    "NAME": "市辖区"
  },
  {
    "ID": "622",
    "PARENT_ID": "620",
    "CODE": "211402",
    "NAME": "连山区"
  },
  {
    "ID": "623",
    "PARENT_ID": "620",
    "CODE": "211403",
    "NAME": "龙港区"
  },
  {
    "ID": "624",
    "PARENT_ID": "620",
    "CODE": "211404",
    "NAME": "南票区"
  },
  {
    "ID": "625",
    "PARENT_ID": "620",
    "CODE": "211421",
    "NAME": "绥中县"
  },
  {
    "ID": "626",
    "PARENT_ID": "620",
    "CODE": "211422",
    "NAME": "建昌县"
  },
  {
    "ID": "627",
    "PARENT_ID": "620",
    "CODE": "211481",
    "NAME": "兴城市"
  },
  {
    "ID": "628",
    "PARENT_ID": "0",
    "CODE": "220000",
    "NAME": "吉林省"
  },
  {
    "ID": "629",
    "PARENT_ID": "628",
    "CODE": "220100",
    "NAME": "长春市"
  },
  {
    "ID": "63",
    "PARENT_ID": "40",
    "CODE": "130184",
    "NAME": "新乐市"
  },
  {
    "ID": "630",
    "PARENT_ID": "629",
    "CODE": "220101",
    "NAME": "市辖区"
  },
  {
    "ID": "631",
    "PARENT_ID": "629",
    "CODE": "220102",
    "NAME": "南关区"
  },
  {
    "ID": "632",
    "PARENT_ID": "629",
    "CODE": "220103",
    "NAME": "宽城区"
  },
  {
    "ID": "633",
    "PARENT_ID": "629",
    "CODE": "220104",
    "NAME": "朝阳区"
  },
  {
    "ID": "634",
    "PARENT_ID": "629",
    "CODE": "220105",
    "NAME": "二道区"
  },
  {
    "ID": "635",
    "PARENT_ID": "629",
    "CODE": "220106",
    "NAME": "绿园区"
  },
  {
    "ID": "636",
    "PARENT_ID": "629",
    "CODE": "220112",
    "NAME": "双阳区"
  },
  {
    "ID": "637",
    "PARENT_ID": "629",
    "CODE": "220113",
    "NAME": "九台区"
  },
  {
    "ID": "638",
    "PARENT_ID": "629",
    "CODE": "220122",
    "NAME": "农安县"
  },
  {
    "ID": "639",
    "PARENT_ID": "629",
    "CODE": "220182",
    "NAME": "榆树市"
  },
  {
    "ID": "64",
    "PARENT_ID": "39",
    "CODE": "130200",
    "NAME": "唐山市"
  },
  {
    "ID": "640",
    "PARENT_ID": "629",
    "CODE": "220183",
    "NAME": "德惠市"
  },
  {
    "ID": "641",
    "PARENT_ID": "628",
    "CODE": "220200",
    "NAME": "吉林市"
  },
  {
    "ID": "642",
    "PARENT_ID": "641",
    "CODE": "220201",
    "NAME": "市辖区"
  },
  {
    "ID": "643",
    "PARENT_ID": "641",
    "CODE": "220202",
    "NAME": "昌邑区"
  },
  {
    "ID": "644",
    "PARENT_ID": "641",
    "CODE": "220203",
    "NAME": "龙潭区"
  },
  {
    "ID": "645",
    "PARENT_ID": "641",
    "CODE": "220204",
    "NAME": "船营区"
  },
  {
    "ID": "646",
    "PARENT_ID": "641",
    "CODE": "220211",
    "NAME": "丰满区"
  },
  {
    "ID": "647",
    "PARENT_ID": "641",
    "CODE": "220221",
    "NAME": "永吉县"
  },
  {
    "ID": "648",
    "PARENT_ID": "641",
    "CODE": "220281",
    "NAME": "蛟河市"
  },
  {
    "ID": "649",
    "PARENT_ID": "641",
    "CODE": "220282",
    "NAME": "桦甸市"
  },
  {
    "ID": "65",
    "PARENT_ID": "64",
    "CODE": "130201",
    "NAME": "市辖区"
  },
  {
    "ID": "650",
    "PARENT_ID": "641",
    "CODE": "220283",
    "NAME": "舒兰市"
  },
  {
    "ID": "651",
    "PARENT_ID": "641",
    "CODE": "220284",
    "NAME": "磐石市"
  },
  {
    "ID": "652",
    "PARENT_ID": "628",
    "CODE": "220300",
    "NAME": "四平市"
  },
  {
    "ID": "653",
    "PARENT_ID": "652",
    "CODE": "220301",
    "NAME": "市辖区"
  },
  {
    "ID": "654",
    "PARENT_ID": "652",
    "CODE": "220302",
    "NAME": "铁西区"
  },
  {
    "ID": "655",
    "PARENT_ID": "652",
    "CODE": "220303",
    "NAME": "铁东区"
  },
  {
    "ID": "656",
    "PARENT_ID": "652",
    "CODE": "220322",
    "NAME": "梨树县"
  },
  {
    "ID": "657",
    "PARENT_ID": "652",
    "CODE": "220323",
    "NAME": "伊通满族自治县"
  },
  {
    "ID": "658",
    "PARENT_ID": "652",
    "CODE": "220381",
    "NAME": "公主岭市"
  },
  {
    "ID": "659",
    "PARENT_ID": "652",
    "CODE": "220382",
    "NAME": "双辽市"
  },
  {
    "ID": "66",
    "PARENT_ID": "64",
    "CODE": "130202",
    "NAME": "路南区"
  },
  {
    "ID": "660",
    "PARENT_ID": "628",
    "CODE": "220400",
    "NAME": "辽源市"
  },
  {
    "ID": "661",
    "PARENT_ID": "660",
    "CODE": "220401",
    "NAME": "市辖区"
  },
  {
    "ID": "662",
    "PARENT_ID": "660",
    "CODE": "220402",
    "NAME": "龙山区"
  },
  {
    "ID": "663",
    "PARENT_ID": "660",
    "CODE": "220403",
    "NAME": "西安区"
  },
  {
    "ID": "664",
    "PARENT_ID": "660",
    "CODE": "220421",
    "NAME": "东丰县"
  },
  {
    "ID": "665",
    "PARENT_ID": "660",
    "CODE": "220422",
    "NAME": "东辽县"
  },
  {
    "ID": "666",
    "PARENT_ID": "628",
    "CODE": "220500",
    "NAME": "通化市"
  },
  {
    "ID": "667",
    "PARENT_ID": "666",
    "CODE": "220501",
    "NAME": "市辖区"
  },
  {
    "ID": "668",
    "PARENT_ID": "666",
    "CODE": "220502",
    "NAME": "东昌区"
  },
  {
    "ID": "669",
    "PARENT_ID": "666",
    "CODE": "220503",
    "NAME": "二道江区"
  },
  {
    "ID": "67",
    "PARENT_ID": "64",
    "CODE": "130203",
    "NAME": "路北区"
  },
  {
    "ID": "670",
    "PARENT_ID": "666",
    "CODE": "220521",
    "NAME": "通化县"
  },
  {
    "ID": "671",
    "PARENT_ID": "666",
    "CODE": "220523",
    "NAME": "辉南县"
  },
  {
    "ID": "672",
    "PARENT_ID": "666",
    "CODE": "220524",
    "NAME": "柳河县"
  },
  {
    "ID": "673",
    "PARENT_ID": "666",
    "CODE": "220581",
    "NAME": "梅河口市"
  },
  {
    "ID": "674",
    "PARENT_ID": "666",
    "CODE": "220582",
    "NAME": "集安市"
  },
  {
    "ID": "675",
    "PARENT_ID": "628",
    "CODE": "220600",
    "NAME": "白山市"
  },
  {
    "ID": "676",
    "PARENT_ID": "675",
    "CODE": "220601",
    "NAME": "市辖区"
  },
  {
    "ID": "677",
    "PARENT_ID": "675",
    "CODE": "220602",
    "NAME": "浑江区"
  },
  {
    "ID": "678",
    "PARENT_ID": "675",
    "CODE": "220605",
    "NAME": "江源区"
  },
  {
    "ID": "679",
    "PARENT_ID": "675",
    "CODE": "220621",
    "NAME": "抚松县"
  },
  {
    "ID": "68",
    "PARENT_ID": "64",
    "CODE": "130204",
    "NAME": "古冶区"
  },
  {
    "ID": "680",
    "PARENT_ID": "675",
    "CODE": "220622",
    "NAME": "靖宇县"
  },
  {
    "ID": "681",
    "PARENT_ID": "675",
    "CODE": "220623",
    "NAME": "长白朝鲜族自治县"
  },
  {
    "ID": "682",
    "PARENT_ID": "675",
    "CODE": "220681",
    "NAME": "临江市"
  },
  {
    "ID": "683",
    "PARENT_ID": "628",
    "CODE": "220700",
    "NAME": "松原市"
  },
  {
    "ID": "684",
    "PARENT_ID": "683",
    "CODE": "220701",
    "NAME": "市辖区"
  },
  {
    "ID": "685",
    "PARENT_ID": "683",
    "CODE": "220702",
    "NAME": "宁江区"
  },
  {
    "ID": "686",
    "PARENT_ID": "683",
    "CODE": "220721",
    "NAME": "前郭尔罗斯蒙古族自治县"
  },
  {
    "ID": "687",
    "PARENT_ID": "683",
    "CODE": "220722",
    "NAME": "长岭县"
  },
  {
    "ID": "688",
    "PARENT_ID": "683",
    "CODE": "220723",
    "NAME": "乾安县"
  },
  {
    "ID": "689",
    "PARENT_ID": "683",
    "CODE": "220781",
    "NAME": "扶余市"
  },
  {
    "ID": "69",
    "PARENT_ID": "64",
    "CODE": "130205",
    "NAME": "开平区"
  },
  {
    "ID": "690",
    "PARENT_ID": "628",
    "CODE": "220800",
    "NAME": "白城市"
  },
  {
    "ID": "691",
    "PARENT_ID": "690",
    "CODE": "220801",
    "NAME": "市辖区"
  },
  {
    "ID": "692",
    "PARENT_ID": "690",
    "CODE": "220802",
    "NAME": "洮北区"
  },
  {
    "ID": "693",
    "PARENT_ID": "690",
    "CODE": "220821",
    "NAME": "镇赉县"
  },
  {
    "ID": "694",
    "PARENT_ID": "690",
    "CODE": "220822",
    "NAME": "通榆县"
  },
  {
    "ID": "695",
    "PARENT_ID": "690",
    "CODE": "220881",
    "NAME": "洮南市"
  },
  {
    "ID": "696",
    "PARENT_ID": "690",
    "CODE": "220882",
    "NAME": "大安市"
  },
  {
    "ID": "697",
    "PARENT_ID": "628",
    "CODE": "222400",
    "NAME": "延边朝鲜族自治州"
  },
  {
    "ID": "698",
    "PARENT_ID": "697",
    "CODE": "222401",
    "NAME": "延吉市"
  },
  {
    "ID": "699",
    "PARENT_ID": "697",
    "CODE": "222402",
    "NAME": "图们市"
  },
  {
    "ID": "7",
    "PARENT_ID": "2",
    "CODE": "110107",
    "NAME": "石景山区"
  },
  {
    "ID": "70",
    "PARENT_ID": "64",
    "CODE": "130207",
    "NAME": "丰南区"
  },
  {
    "ID": "700",
    "PARENT_ID": "697",
    "CODE": "222403",
    "NAME": "敦化市"
  },
  {
    "ID": "701",
    "PARENT_ID": "697",
    "CODE": "222404",
    "NAME": "珲春市"
  },
  {
    "ID": "702",
    "PARENT_ID": "697",
    "CODE": "222405",
    "NAME": "龙井市"
  },
  {
    "ID": "703",
    "PARENT_ID": "697",
    "CODE": "222406",
    "NAME": "和龙市"
  },
  {
    "ID": "704",
    "PARENT_ID": "697",
    "CODE": "222424",
    "NAME": "汪清县"
  },
  {
    "ID": "705",
    "PARENT_ID": "697",
    "CODE": "222426",
    "NAME": "安图县"
  },
  {
    "ID": "706",
    "PARENT_ID": "0",
    "CODE": "230000",
    "NAME": "黑龙江省"
  },
  {
    "ID": "707",
    "PARENT_ID": "706",
    "CODE": "230100",
    "NAME": "哈尔滨市"
  },
  {
    "ID": "708",
    "PARENT_ID": "707",
    "CODE": "230101",
    "NAME": "市辖区"
  },
  {
    "ID": "709",
    "PARENT_ID": "707",
    "CODE": "230102",
    "NAME": "道里区"
  },
  {
    "ID": "71",
    "PARENT_ID": "64",
    "CODE": "130208",
    "NAME": "丰润区"
  },
  {
    "ID": "710",
    "PARENT_ID": "707",
    "CODE": "230103",
    "NAME": "南岗区"
  },
  {
    "ID": "711",
    "PARENT_ID": "707",
    "CODE": "230104",
    "NAME": "道外区"
  },
  {
    "ID": "712",
    "PARENT_ID": "707",
    "CODE": "230108",
    "NAME": "平房区"
  },
  {
    "ID": "713",
    "PARENT_ID": "707",
    "CODE": "230109",
    "NAME": "松北区"
  },
  {
    "ID": "714",
    "PARENT_ID": "707",
    "CODE": "230110",
    "NAME": "香坊区"
  },
  {
    "ID": "715",
    "PARENT_ID": "707",
    "CODE": "230111",
    "NAME": "呼兰区"
  },
  {
    "ID": "716",
    "PARENT_ID": "707",
    "CODE": "230112",
    "NAME": "阿城区"
  },
  {
    "ID": "717",
    "PARENT_ID": "707",
    "CODE": "230123",
    "NAME": "依兰县"
  },
  {
    "ID": "718",
    "PARENT_ID": "707",
    "CODE": "230124",
    "NAME": "方正县"
  },
  {
    "ID": "719",
    "PARENT_ID": "707",
    "CODE": "230125",
    "NAME": "宾县"
  },
  {
    "ID": "72",
    "PARENT_ID": "64",
    "CODE": "130209",
    "NAME": "曹妃甸区"
  },
  {
    "ID": "720",
    "PARENT_ID": "707",
    "CODE": "230126",
    "NAME": "巴彦县"
  },
  {
    "ID": "721",
    "PARENT_ID": "707",
    "CODE": "230127",
    "NAME": "木兰县"
  },
  {
    "ID": "722",
    "PARENT_ID": "707",
    "CODE": "230128",
    "NAME": "通河县"
  },
  {
    "ID": "723",
    "PARENT_ID": "707",
    "CODE": "230129",
    "NAME": "延寿县"
  },
  {
    "ID": "724",
    "PARENT_ID": "707",
    "CODE": "230182",
    "NAME": "双城市"
  },
  {
    "ID": "725",
    "PARENT_ID": "707",
    "CODE": "230183",
    "NAME": "尚志市"
  },
  {
    "ID": "726",
    "PARENT_ID": "707",
    "CODE": "230184",
    "NAME": "五常市"
  },
  {
    "ID": "727",
    "PARENT_ID": "706",
    "CODE": "230200",
    "NAME": "齐齐哈尔市"
  },
  {
    "ID": "728",
    "PARENT_ID": "727",
    "CODE": "230201",
    "NAME": "市辖区"
  },
  {
    "ID": "729",
    "PARENT_ID": "727",
    "CODE": "230202",
    "NAME": "龙沙区"
  },
  {
    "ID": "73",
    "PARENT_ID": "64",
    "CODE": "130223",
    "NAME": "滦县"
  },
  {
    "ID": "730",
    "PARENT_ID": "727",
    "CODE": "230203",
    "NAME": "建华区"
  },
  {
    "ID": "731",
    "PARENT_ID": "727",
    "CODE": "230204",
    "NAME": "铁锋区"
  },
  {
    "ID": "732",
    "PARENT_ID": "727",
    "CODE": "230205",
    "NAME": "昂昂溪区"
  },
  {
    "ID": "733",
    "PARENT_ID": "727",
    "CODE": "230206",
    "NAME": "富拉尔基区"
  },
  {
    "ID": "734",
    "PARENT_ID": "727",
    "CODE": "230207",
    "NAME": "碾子山区"
  },
  {
    "ID": "735",
    "PARENT_ID": "727",
    "CODE": "230208",
    "NAME": "梅里斯达斡尔族区"
  },
  {
    "ID": "736",
    "PARENT_ID": "727",
    "CODE": "230221",
    "NAME": "龙江县"
  },
  {
    "ID": "737",
    "PARENT_ID": "727",
    "CODE": "230223",
    "NAME": "依安县"
  },
  {
    "ID": "738",
    "PARENT_ID": "727",
    "CODE": "230224",
    "NAME": "泰来县"
  },
  {
    "ID": "739",
    "PARENT_ID": "727",
    "CODE": "230225",
    "NAME": "甘南县"
  },
  {
    "ID": "74",
    "PARENT_ID": "64",
    "CODE": "130224",
    "NAME": "滦南县"
  },
  {
    "ID": "740",
    "PARENT_ID": "727",
    "CODE": "230227",
    "NAME": "富裕县"
  },
  {
    "ID": "741",
    "PARENT_ID": "727",
    "CODE": "230229",
    "NAME": "克山县"
  },
  {
    "ID": "742",
    "PARENT_ID": "727",
    "CODE": "230230",
    "NAME": "克东县"
  },
  {
    "ID": "743",
    "PARENT_ID": "727",
    "CODE": "230231",
    "NAME": "拜泉县"
  },
  {
    "ID": "744",
    "PARENT_ID": "727",
    "CODE": "230281",
    "NAME": "讷河市"
  },
  {
    "ID": "745",
    "PARENT_ID": "706",
    "CODE": "230300",
    "NAME": "鸡西市"
  },
  {
    "ID": "746",
    "PARENT_ID": "745",
    "CODE": "230301",
    "NAME": "市辖区"
  },
  {
    "ID": "747",
    "PARENT_ID": "745",
    "CODE": "230302",
    "NAME": "鸡冠区"
  },
  {
    "ID": "748",
    "PARENT_ID": "745",
    "CODE": "230303",
    "NAME": "恒山区"
  },
  {
    "ID": "749",
    "PARENT_ID": "745",
    "CODE": "230304",
    "NAME": "滴道区"
  },
  {
    "ID": "75",
    "PARENT_ID": "64",
    "CODE": "130225",
    "NAME": "乐亭县"
  },
  {
    "ID": "750",
    "PARENT_ID": "745",
    "CODE": "230305",
    "NAME": "梨树区"
  },
  {
    "ID": "751",
    "PARENT_ID": "745",
    "CODE": "230306",
    "NAME": "城子河区"
  },
  {
    "ID": "752",
    "PARENT_ID": "745",
    "CODE": "230307",
    "NAME": "麻山区"
  },
  {
    "ID": "753",
    "PARENT_ID": "745",
    "CODE": "230321",
    "NAME": "鸡东县"
  },
  {
    "ID": "754",
    "PARENT_ID": "745",
    "CODE": "230381",
    "NAME": "虎林市"
  },
  {
    "ID": "755",
    "PARENT_ID": "745",
    "CODE": "230382",
    "NAME": "密山市"
  },
  {
    "ID": "756",
    "PARENT_ID": "706",
    "CODE": "230400",
    "NAME": "鹤岗市"
  },
  {
    "ID": "757",
    "PARENT_ID": "756",
    "CODE": "230401",
    "NAME": "市辖区"
  },
  {
    "ID": "758",
    "PARENT_ID": "756",
    "CODE": "230402",
    "NAME": "向阳区"
  },
  {
    "ID": "759",
    "PARENT_ID": "756",
    "CODE": "230403",
    "NAME": "工农区"
  },
  {
    "ID": "76",
    "PARENT_ID": "64",
    "CODE": "130227",
    "NAME": "迁西县"
  },
  {
    "ID": "760",
    "PARENT_ID": "756",
    "CODE": "230404",
    "NAME": "南山区"
  },
  {
    "ID": "761",
    "PARENT_ID": "756",
    "CODE": "230405",
    "NAME": "兴安区"
  },
  {
    "ID": "762",
    "PARENT_ID": "756",
    "CODE": "230406",
    "NAME": "东山区"
  },
  {
    "ID": "763",
    "PARENT_ID": "756",
    "CODE": "230407",
    "NAME": "兴山区"
  },
  {
    "ID": "764",
    "PARENT_ID": "756",
    "CODE": "230421",
    "NAME": "萝北县"
  },
  {
    "ID": "765",
    "PARENT_ID": "756",
    "CODE": "230422",
    "NAME": "绥滨县"
  },
  {
    "ID": "766",
    "PARENT_ID": "706",
    "CODE": "230500",
    "NAME": "双鸭山市"
  },
  {
    "ID": "767",
    "PARENT_ID": "766",
    "CODE": "230501",
    "NAME": "市辖区"
  },
  {
    "ID": "768",
    "PARENT_ID": "766",
    "CODE": "230502",
    "NAME": "尖山区"
  },
  {
    "ID": "769",
    "PARENT_ID": "766",
    "CODE": "230503",
    "NAME": "岭东区"
  },
  {
    "ID": "77",
    "PARENT_ID": "64",
    "CODE": "130229",
    "NAME": "玉田县"
  },
  {
    "ID": "770",
    "PARENT_ID": "766",
    "CODE": "230505",
    "NAME": "四方台区"
  },
  {
    "ID": "771",
    "PARENT_ID": "766",
    "CODE": "230506",
    "NAME": "宝山区"
  },
  {
    "ID": "772",
    "PARENT_ID": "766",
    "CODE": "230521",
    "NAME": "集贤县"
  },
  {
    "ID": "773",
    "PARENT_ID": "766",
    "CODE": "230522",
    "NAME": "友谊县"
  },
  {
    "ID": "774",
    "PARENT_ID": "766",
    "CODE": "230523",
    "NAME": "宝清县"
  },
  {
    "ID": "775",
    "PARENT_ID": "766",
    "CODE": "230524",
    "NAME": "饶河县"
  },
  {
    "ID": "776",
    "PARENT_ID": "706",
    "CODE": "230600",
    "NAME": "大庆市"
  },
  {
    "ID": "777",
    "PARENT_ID": "776",
    "CODE": "230601",
    "NAME": "市辖区"
  },
  {
    "ID": "778",
    "PARENT_ID": "776",
    "CODE": "230602",
    "NAME": "萨尔图区"
  },
  {
    "ID": "779",
    "PARENT_ID": "776",
    "CODE": "230603",
    "NAME": "龙凤区"
  },
  {
    "ID": "78",
    "PARENT_ID": "64",
    "CODE": "130281",
    "NAME": "遵化市"
  },
  {
    "ID": "780",
    "PARENT_ID": "776",
    "CODE": "230604",
    "NAME": "让胡路区"
  },
  {
    "ID": "781",
    "PARENT_ID": "776",
    "CODE": "230605",
    "NAME": "红岗区"
  },
  {
    "ID": "782",
    "PARENT_ID": "776",
    "CODE": "230606",
    "NAME": "大同区"
  },
  {
    "ID": "783",
    "PARENT_ID": "776",
    "CODE": "230621",
    "NAME": "肇州县"
  },
  {
    "ID": "784",
    "PARENT_ID": "776",
    "CODE": "230622",
    "NAME": "肇源县"
  },
  {
    "ID": "785",
    "PARENT_ID": "776",
    "CODE": "230623",
    "NAME": "林甸县"
  },
  {
    "ID": "786",
    "PARENT_ID": "776",
    "CODE": "230624",
    "NAME": "杜尔伯特蒙古族自治县"
  },
  {
    "ID": "787",
    "PARENT_ID": "706",
    "CODE": "230700",
    "NAME": "伊春市"
  },
  {
    "ID": "788",
    "PARENT_ID": "787",
    "CODE": "230701",
    "NAME": "市辖区"
  },
  {
    "ID": "789",
    "PARENT_ID": "787",
    "CODE": "230702",
    "NAME": "伊春区"
  },
  {
    "ID": "79",
    "PARENT_ID": "64",
    "CODE": "130283",
    "NAME": "迁安市"
  },
  {
    "ID": "790",
    "PARENT_ID": "787",
    "CODE": "230703",
    "NAME": "南岔区"
  },
  {
    "ID": "791",
    "PARENT_ID": "787",
    "CODE": "230704",
    "NAME": "友好区"
  },
  {
    "ID": "792",
    "PARENT_ID": "787",
    "CODE": "230705",
    "NAME": "西林区"
  },
  {
    "ID": "793",
    "PARENT_ID": "787",
    "CODE": "230706",
    "NAME": "翠峦区"
  },
  {
    "ID": "794",
    "PARENT_ID": "787",
    "CODE": "230707",
    "NAME": "新青区"
  },
  {
    "ID": "795",
    "PARENT_ID": "787",
    "CODE": "230708",
    "NAME": "美溪区"
  },
  {
    "ID": "796",
    "PARENT_ID": "787",
    "CODE": "230709",
    "NAME": "金山屯区"
  },
  {
    "ID": "797",
    "PARENT_ID": "787",
    "CODE": "230710",
    "NAME": "五营区"
  },
  {
    "ID": "798",
    "PARENT_ID": "787",
    "CODE": "230711",
    "NAME": "乌马河区"
  },
  {
    "ID": "799",
    "PARENT_ID": "787",
    "CODE": "230712",
    "NAME": "汤旺河区"
  },
  {
    "ID": "8",
    "PARENT_ID": "2",
    "CODE": "110108",
    "NAME": "海淀区"
  },
  {
    "ID": "80",
    "PARENT_ID": "39",
    "CODE": "130300",
    "NAME": "秦皇岛市"
  },
  {
    "ID": "800",
    "PARENT_ID": "787",
    "CODE": "230713",
    "NAME": "带岭区"
  },
  {
    "ID": "801",
    "PARENT_ID": "787",
    "CODE": "230714",
    "NAME": "乌伊岭区"
  },
  {
    "ID": "802",
    "PARENT_ID": "787",
    "CODE": "230715",
    "NAME": "红星区"
  },
  {
    "ID": "803",
    "PARENT_ID": "787",
    "CODE": "230716",
    "NAME": "上甘岭区"
  },
  {
    "ID": "804",
    "PARENT_ID": "787",
    "CODE": "230722",
    "NAME": "嘉荫县"
  },
  {
    "ID": "805",
    "PARENT_ID": "787",
    "CODE": "230781",
    "NAME": "铁力市"
  },
  {
    "ID": "806",
    "PARENT_ID": "706",
    "CODE": "230800",
    "NAME": "佳木斯市"
  },
  {
    "ID": "807",
    "PARENT_ID": "806",
    "CODE": "230801",
    "NAME": "市辖区"
  },
  {
    "ID": "808",
    "PARENT_ID": "806",
    "CODE": "230803",
    "NAME": "向阳区"
  },
  {
    "ID": "809",
    "PARENT_ID": "806",
    "CODE": "230804",
    "NAME": "前进区"
  },
  {
    "ID": "81",
    "PARENT_ID": "80",
    "CODE": "130301",
    "NAME": "市辖区"
  },
  {
    "ID": "810",
    "PARENT_ID": "806",
    "CODE": "230805",
    "NAME": "东风区"
  },
  {
    "ID": "811",
    "PARENT_ID": "806",
    "CODE": "230811",
    "NAME": "郊区"
  },
  {
    "ID": "812",
    "PARENT_ID": "806",
    "CODE": "230822",
    "NAME": "桦南县"
  },
  {
    "ID": "813",
    "PARENT_ID": "806",
    "CODE": "230826",
    "NAME": "桦川县"
  },
  {
    "ID": "814",
    "PARENT_ID": "806",
    "CODE": "230828",
    "NAME": "汤原县"
  },
  {
    "ID": "815",
    "PARENT_ID": "806",
    "CODE": "230833",
    "NAME": "抚远县"
  },
  {
    "ID": "816",
    "PARENT_ID": "806",
    "CODE": "230881",
    "NAME": "同江市"
  },
  {
    "ID": "817",
    "PARENT_ID": "806",
    "CODE": "230882",
    "NAME": "富锦市"
  },
  {
    "ID": "818",
    "PARENT_ID": "706",
    "CODE": "230900",
    "NAME": "七台河市"
  },
  {
    "ID": "819",
    "PARENT_ID": "818",
    "CODE": "230901",
    "NAME": "市辖区"
  },
  {
    "ID": "82",
    "PARENT_ID": "80",
    "CODE": "130302",
    "NAME": "海港区"
  },
  {
    "ID": "820",
    "PARENT_ID": "818",
    "CODE": "230902",
    "NAME": "新兴区"
  },
  {
    "ID": "821",
    "PARENT_ID": "818",
    "CODE": "230903",
    "NAME": "桃山区"
  },
  {
    "ID": "822",
    "PARENT_ID": "818",
    "CODE": "230904",
    "NAME": "茄子河区"
  },
  {
    "ID": "823",
    "PARENT_ID": "818",
    "CODE": "230921",
    "NAME": "勃利县"
  },
  {
    "ID": "824",
    "PARENT_ID": "706",
    "CODE": "231000",
    "NAME": "牡丹江市"
  },
  {
    "ID": "825",
    "PARENT_ID": "824",
    "CODE": "231001",
    "NAME": "市辖区"
  },
  {
    "ID": "826",
    "PARENT_ID": "824",
    "CODE": "231002",
    "NAME": "东安区"
  },
  {
    "ID": "827",
    "PARENT_ID": "824",
    "CODE": "231003",
    "NAME": "阳明区"
  },
  {
    "ID": "828",
    "PARENT_ID": "824",
    "CODE": "231004",
    "NAME": "爱民区"
  },
  {
    "ID": "829",
    "PARENT_ID": "824",
    "CODE": "231005",
    "NAME": "西安区"
  },
  {
    "ID": "83",
    "PARENT_ID": "80",
    "CODE": "130303",
    "NAME": "山海关区"
  },
  {
    "ID": "830",
    "PARENT_ID": "824",
    "CODE": "231024",
    "NAME": "东宁县"
  },
  {
    "ID": "831",
    "PARENT_ID": "824",
    "CODE": "231025",
    "NAME": "林口县"
  },
  {
    "ID": "832",
    "PARENT_ID": "824",
    "CODE": "231081",
    "NAME": "绥芬河市"
  },
  {
    "ID": "833",
    "PARENT_ID": "824",
    "CODE": "231083",
    "NAME": "海林市"
  },
  {
    "ID": "834",
    "PARENT_ID": "824",
    "CODE": "231084",
    "NAME": "宁安市"
  },
  {
    "ID": "835",
    "PARENT_ID": "824",
    "CODE": "231085",
    "NAME": "穆棱市"
  },
  {
    "ID": "836",
    "PARENT_ID": "706",
    "CODE": "231100",
    "NAME": "黑河市"
  },
  {
    "ID": "837",
    "PARENT_ID": "836",
    "CODE": "231101",
    "NAME": "市辖区"
  },
  {
    "ID": "838",
    "PARENT_ID": "836",
    "CODE": "231102",
    "NAME": "爱辉区"
  },
  {
    "ID": "839",
    "PARENT_ID": "836",
    "CODE": "231121",
    "NAME": "嫩江县"
  },
  {
    "ID": "84",
    "PARENT_ID": "80",
    "CODE": "130304",
    "NAME": "北戴河区"
  },
  {
    "ID": "840",
    "PARENT_ID": "836",
    "CODE": "231123",
    "NAME": "逊克县"
  },
  {
    "ID": "841",
    "PARENT_ID": "836",
    "CODE": "231124",
    "NAME": "孙吴县"
  },
  {
    "ID": "842",
    "PARENT_ID": "836",
    "CODE": "231181",
    "NAME": "北安市"
  },
  {
    "ID": "843",
    "PARENT_ID": "836",
    "CODE": "231182",
    "NAME": "五大连池市"
  },
  {
    "ID": "844",
    "PARENT_ID": "706",
    "CODE": "231200",
    "NAME": "绥化市"
  },
  {
    "ID": "845",
    "PARENT_ID": "844",
    "CODE": "231201",
    "NAME": "市辖区"
  },
  {
    "ID": "846",
    "PARENT_ID": "844",
    "CODE": "231202",
    "NAME": "北林区"
  },
  {
    "ID": "847",
    "PARENT_ID": "844",
    "CODE": "231221",
    "NAME": "望奎县"
  },
  {
    "ID": "848",
    "PARENT_ID": "844",
    "CODE": "231222",
    "NAME": "兰西县"
  },
  {
    "ID": "849",
    "PARENT_ID": "844",
    "CODE": "231223",
    "NAME": "青冈县"
  },
  {
    "ID": "85",
    "PARENT_ID": "80",
    "CODE": "130321",
    "NAME": "青龙满族自治县"
  },
  {
    "ID": "850",
    "PARENT_ID": "844",
    "CODE": "231224",
    "NAME": "庆安县"
  },
  {
    "ID": "851",
    "PARENT_ID": "844",
    "CODE": "231225",
    "NAME": "明水县"
  },
  {
    "ID": "852",
    "PARENT_ID": "844",
    "CODE": "231226",
    "NAME": "绥棱县"
  },
  {
    "ID": "853",
    "PARENT_ID": "844",
    "CODE": "231281",
    "NAME": "安达市"
  },
  {
    "ID": "854",
    "PARENT_ID": "844",
    "CODE": "231282",
    "NAME": "肇东市"
  },
  {
    "ID": "855",
    "PARENT_ID": "844",
    "CODE": "231283",
    "NAME": "海伦市"
  },
  {
    "ID": "856",
    "PARENT_ID": "706",
    "CODE": "232700",
    "NAME": "大兴安岭地区"
  },
  {
    "ID": "857",
    "PARENT_ID": "856",
    "CODE": "232721",
    "NAME": "呼玛县"
  },
  {
    "ID": "858",
    "PARENT_ID": "856",
    "CODE": "232722",
    "NAME": "塔河县"
  },
  {
    "ID": "859",
    "PARENT_ID": "856",
    "CODE": "232723",
    "NAME": "漠河县"
  },
  {
    "ID": "86",
    "PARENT_ID": "80",
    "CODE": "130322",
    "NAME": "昌黎县"
  },
  {
    "ID": "860",
    "PARENT_ID": "0",
    "CODE": "310000",
    "NAME": "上海市"
  },
  {
    "ID": "861",
    "PARENT_ID": "860",
    "CODE": "310100",
    "NAME": "市辖区(上海)"
  },
  {
    "ID": "862",
    "PARENT_ID": "861",
    "CODE": "310101",
    "NAME": "黄浦区"
  },
  {
    "ID": "863",
    "PARENT_ID": "861",
    "CODE": "310104",
    "NAME": "徐汇区"
  },
  {
    "ID": "864",
    "PARENT_ID": "861",
    "CODE": "310105",
    "NAME": "长宁区"
  },
  {
    "ID": "865",
    "PARENT_ID": "861",
    "CODE": "310106",
    "NAME": "静安区"
  },
  {
    "ID": "866",
    "PARENT_ID": "861",
    "CODE": "310107",
    "NAME": "普陀区"
  },
  {
    "ID": "867",
    "PARENT_ID": "861",
    "CODE": "310108",
    "NAME": "闸北区"
  },
  {
    "ID": "868",
    "PARENT_ID": "861",
    "CODE": "310109",
    "NAME": "虹口区"
  },
  {
    "ID": "869",
    "PARENT_ID": "861",
    "CODE": "310110",
    "NAME": "杨浦区"
  },
  {
    "ID": "87",
    "PARENT_ID": "80",
    "CODE": "130323",
    "NAME": "抚宁县"
  },
  {
    "ID": "870",
    "PARENT_ID": "861",
    "CODE": "310112",
    "NAME": "闵行区"
  },
  {
    "ID": "871",
    "PARENT_ID": "861",
    "CODE": "310113",
    "NAME": "宝山区"
  },
  {
    "ID": "872",
    "PARENT_ID": "861",
    "CODE": "310114",
    "NAME": "嘉定区"
  },
  {
    "ID": "873",
    "PARENT_ID": "861",
    "CODE": "310115",
    "NAME": "浦东新区"
  },
  {
    "ID": "874",
    "PARENT_ID": "861",
    "CODE": "310116",
    "NAME": "金山区"
  },
  {
    "ID": "875",
    "PARENT_ID": "861",
    "CODE": "310117",
    "NAME": "松江区"
  },
  {
    "ID": "876",
    "PARENT_ID": "861",
    "CODE": "310118",
    "NAME": "青浦区"
  },
  {
    "ID": "877",
    "PARENT_ID": "861",
    "CODE": "310120",
    "NAME": "奉贤区"
  },
  {
    "ID": "878",
    "PARENT_ID": "860",
    "CODE": "310200",
    "NAME": "县(上海)"
  },
  {
    "ID": "879",
    "PARENT_ID": "878",
    "CODE": "310230",
    "NAME": "崇明县"
  },
  {
    "ID": "88",
    "PARENT_ID": "80",
    "CODE": "130324",
    "NAME": "卢龙县"
  },
  {
    "ID": "880",
    "PARENT_ID": "0",
    "CODE": "320000",
    "NAME": "江苏省"
  },
  {
    "ID": "881",
    "PARENT_ID": "880",
    "CODE": "320100",
    "NAME": "南京市"
  },
  {
    "ID": "882",
    "PARENT_ID": "881",
    "CODE": "320101",
    "NAME": "市辖区"
  },
  {
    "ID": "883",
    "PARENT_ID": "881",
    "CODE": "320102",
    "NAME": "玄武区"
  },
  {
    "ID": "884",
    "PARENT_ID": "881",
    "CODE": "320104",
    "NAME": "秦淮区"
  },
  {
    "ID": "885",
    "PARENT_ID": "881",
    "CODE": "320105",
    "NAME": "建邺区"
  },
  {
    "ID": "886",
    "PARENT_ID": "881",
    "CODE": "320106",
    "NAME": "鼓楼区"
  },
  {
    "ID": "887",
    "PARENT_ID": "881",
    "CODE": "320111",
    "NAME": "浦口区"
  },
  {
    "ID": "888",
    "PARENT_ID": "881",
    "CODE": "320113",
    "NAME": "栖霞区"
  },
  {
    "ID": "889",
    "PARENT_ID": "881",
    "CODE": "320114",
    "NAME": "雨花台区"
  },
  {
    "ID": "89",
    "PARENT_ID": "39",
    "CODE": "130400",
    "NAME": "邯郸市"
  },
  {
    "ID": "890",
    "PARENT_ID": "881",
    "CODE": "320115",
    "NAME": "江宁区"
  },
  {
    "ID": "891",
    "PARENT_ID": "881",
    "CODE": "320116",
    "NAME": "六合区"
  },
  {
    "ID": "892",
    "PARENT_ID": "881",
    "CODE": "320117",
    "NAME": "溧水区"
  },
  {
    "ID": "893",
    "PARENT_ID": "881",
    "CODE": "320118",
    "NAME": "高淳区"
  },
  {
    "ID": "894",
    "PARENT_ID": "880",
    "CODE": "320200",
    "NAME": "无锡市"
  },
  {
    "ID": "895",
    "PARENT_ID": "894",
    "CODE": "320201",
    "NAME": "市辖区"
  },
  {
    "ID": "896",
    "PARENT_ID": "894",
    "CODE": "320202",
    "NAME": "崇安区"
  },
  {
    "ID": "897",
    "PARENT_ID": "894",
    "CODE": "320203",
    "NAME": "南长区"
  },
  {
    "ID": "898",
    "PARENT_ID": "894",
    "CODE": "320204",
    "NAME": "北塘区"
  },
  {
    "ID": "899",
    "PARENT_ID": "894",
    "CODE": "320205",
    "NAME": "锡山区"
  },
  {
    "ID": "9",
    "PARENT_ID": "2",
    "CODE": "110109",
    "NAME": "门头沟区"
  },
  {
    "ID": "90",
    "PARENT_ID": "89",
    "CODE": "130401",
    "NAME": "市辖区"
  },
  {
    "ID": "900",
    "PARENT_ID": "894",
    "CODE": "320206",
    "NAME": "惠山区"
  },
  {
    "ID": "901",
    "PARENT_ID": "894",
    "CODE": "320211",
    "NAME": "滨湖区"
  },
  {
    "ID": "902",
    "PARENT_ID": "894",
    "CODE": "320281",
    "NAME": "江阴市"
  },
  {
    "ID": "903",
    "PARENT_ID": "894",
    "CODE": "320282",
    "NAME": "宜兴市"
  },
  {
    "ID": "904",
    "PARENT_ID": "880",
    "CODE": "320300",
    "NAME": "徐州市"
  },
  {
    "ID": "905",
    "PARENT_ID": "904",
    "CODE": "320301",
    "NAME": "市辖区"
  },
  {
    "ID": "906",
    "PARENT_ID": "904",
    "CODE": "320302",
    "NAME": "鼓楼区"
  },
  {
    "ID": "907",
    "PARENT_ID": "904",
    "CODE": "320303",
    "NAME": "云龙区"
  },
  {
    "ID": "908",
    "PARENT_ID": "904",
    "CODE": "320305",
    "NAME": "贾汪区"
  },
  {
    "ID": "909",
    "PARENT_ID": "904",
    "CODE": "320311",
    "NAME": "泉山区"
  },
  {
    "ID": "91",
    "PARENT_ID": "89",
    "CODE": "130402",
    "NAME": "邯山区"
  },
  {
    "ID": "910",
    "PARENT_ID": "904",
    "CODE": "320312",
    "NAME": "铜山区"
  },
  {
    "ID": "911",
    "PARENT_ID": "904",
    "CODE": "320321",
    "NAME": "丰县"
  },
  {
    "ID": "912",
    "PARENT_ID": "904",
    "CODE": "320322",
    "NAME": "沛县"
  },
  {
    "ID": "913",
    "PARENT_ID": "904",
    "CODE": "320324",
    "NAME": "睢宁县"
  },
  {
    "ID": "914",
    "PARENT_ID": "904",
    "CODE": "320381",
    "NAME": "新沂市"
  },
  {
    "ID": "915",
    "PARENT_ID": "904",
    "CODE": "320382",
    "NAME": "邳州市"
  },
  {
    "ID": "916",
    "PARENT_ID": "880",
    "CODE": "320400",
    "NAME": "常州市"
  },
  {
    "ID": "917",
    "PARENT_ID": "916",
    "CODE": "320401",
    "NAME": "市辖区"
  },
  {
    "ID": "918",
    "PARENT_ID": "916",
    "CODE": "320402",
    "NAME": "天宁区"
  },
  {
    "ID": "919",
    "PARENT_ID": "916",
    "CODE": "320404",
    "NAME": "钟楼区"
  },
  {
    "ID": "92",
    "PARENT_ID": "89",
    "CODE": "130403",
    "NAME": "丛台区"
  },
  {
    "ID": "920",
    "PARENT_ID": "916",
    "CODE": "320405",
    "NAME": "戚墅堰区"
  },
  {
    "ID": "921",
    "PARENT_ID": "916",
    "CODE": "320411",
    "NAME": "新北区"
  },
  {
    "ID": "922",
    "PARENT_ID": "916",
    "CODE": "320412",
    "NAME": "武进区"
  },
  {
    "ID": "923",
    "PARENT_ID": "916",
    "CODE": "320481",
    "NAME": "溧阳市"
  },
  {
    "ID": "924",
    "PARENT_ID": "916",
    "CODE": "320482",
    "NAME": "金坛市"
  },
  {
    "ID": "925",
    "PARENT_ID": "880",
    "CODE": "320500",
    "NAME": "苏州市"
  },
  {
    "ID": "926",
    "PARENT_ID": "925",
    "CODE": "320501",
    "NAME": "市辖区"
  },
  {
    "ID": "927",
    "PARENT_ID": "925",
    "CODE": "320505",
    "NAME": "虎丘区"
  },
  {
    "ID": "928",
    "PARENT_ID": "925",
    "CODE": "320506",
    "NAME": "吴中区"
  },
  {
    "ID": "929",
    "PARENT_ID": "925",
    "CODE": "320507",
    "NAME": "相城区"
  },
  {
    "ID": "93",
    "PARENT_ID": "89",
    "CODE": "130404",
    "NAME": "复兴区"
  },
  {
    "ID": "930",
    "PARENT_ID": "925",
    "CODE": "320508",
    "NAME": "姑苏区"
  },
  {
    "ID": "931",
    "PARENT_ID": "925",
    "CODE": "320509",
    "NAME": "吴江区"
  },
  {
    "ID": "932",
    "PARENT_ID": "925",
    "CODE": "320581",
    "NAME": "常熟市"
  },
  {
    "ID": "933",
    "PARENT_ID": "925",
    "CODE": "320582",
    "NAME": "张家港市"
  },
  {
    "ID": "934",
    "PARENT_ID": "925",
    "CODE": "320583",
    "NAME": "昆山市"
  },
  {
    "ID": "935",
    "PARENT_ID": "925",
    "CODE": "320585",
    "NAME": "太仓市"
  },
  {
    "ID": "936",
    "PARENT_ID": "880",
    "CODE": "320600",
    "NAME": "南通市"
  },
  {
    "ID": "937",
    "PARENT_ID": "936",
    "CODE": "320601",
    "NAME": "市辖区"
  },
  {
    "ID": "938",
    "PARENT_ID": "936",
    "CODE": "320602",
    "NAME": "崇川区"
  },
  {
    "ID": "939",
    "PARENT_ID": "936",
    "CODE": "320611",
    "NAME": "港闸区"
  },
  {
    "ID": "94",
    "PARENT_ID": "89",
    "CODE": "130406",
    "NAME": "峰峰矿区"
  },
  {
    "ID": "940",
    "PARENT_ID": "936",
    "CODE": "320612",
    "NAME": "通州区"
  },
  {
    "ID": "941",
    "PARENT_ID": "936",
    "CODE": "320621",
    "NAME": "海安县"
  },
  {
    "ID": "942",
    "PARENT_ID": "936",
    "CODE": "320623",
    "NAME": "如东县"
  },
  {
    "ID": "943",
    "PARENT_ID": "936",
    "CODE": "320681",
    "NAME": "启东市"
  },
  {
    "ID": "944",
    "PARENT_ID": "936",
    "CODE": "320682",
    "NAME": "如皋市"
  },
  {
    "ID": "945",
    "PARENT_ID": "936",
    "CODE": "320684",
    "NAME": "海门市"
  },
  {
    "ID": "946",
    "PARENT_ID": "880",
    "CODE": "320700",
    "NAME": "连云港市"
  },
  {
    "ID": "947",
    "PARENT_ID": "946",
    "CODE": "320701",
    "NAME": "市辖区"
  },
  {
    "ID": "948",
    "PARENT_ID": "946",
    "CODE": "320703",
    "NAME": "连云区"
  },
  {
    "ID": "949",
    "PARENT_ID": "946",
    "CODE": "320706",
    "NAME": "海州区"
  },
  {
    "ID": "95",
    "PARENT_ID": "89",
    "CODE": "130421",
    "NAME": "邯郸县"
  },
  {
    "ID": "950",
    "PARENT_ID": "946",
    "CODE": "320707",
    "NAME": "赣榆区"
  },
  {
    "ID": "951",
    "PARENT_ID": "946",
    "CODE": "320722",
    "NAME": "东海县"
  },
  {
    "ID": "952",
    "PARENT_ID": "946",
    "CODE": "320723",
    "NAME": "灌云县"
  },
  {
    "ID": "953",
    "PARENT_ID": "946",
    "CODE": "320724",
    "NAME": "灌南县"
  },
  {
    "ID": "954",
    "PARENT_ID": "880",
    "CODE": "320800",
    "NAME": "淮安市"
  },
  {
    "ID": "955",
    "PARENT_ID": "954",
    "CODE": "320801",
    "NAME": "市辖区"
  },
  {
    "ID": "956",
    "PARENT_ID": "954",
    "CODE": "320802",
    "NAME": "清河区"
  },
  {
    "ID": "957",
    "PARENT_ID": "954",
    "CODE": "320803",
    "NAME": "淮安区"
  },
  {
    "ID": "958",
    "PARENT_ID": "954",
    "CODE": "320804",
    "NAME": "淮阴区"
  },
  {
    "ID": "959",
    "PARENT_ID": "954",
    "CODE": "320811",
    "NAME": "清浦区"
  },
  {
    "ID": "96",
    "PARENT_ID": "89",
    "CODE": "130423",
    "NAME": "临漳县"
  },
  {
    "ID": "960",
    "PARENT_ID": "954",
    "CODE": "320826",
    "NAME": "涟水县"
  },
  {
    "ID": "961",
    "PARENT_ID": "954",
    "CODE": "320829",
    "NAME": "洪泽县"
  },
  {
    "ID": "962",
    "PARENT_ID": "954",
    "CODE": "320830",
    "NAME": "盱眙县"
  },
  {
    "ID": "963",
    "PARENT_ID": "954",
    "CODE": "320831",
    "NAME": "金湖县"
  },
  {
    "ID": "964",
    "PARENT_ID": "880",
    "CODE": "320900",
    "NAME": "盐城市"
  },
  {
    "ID": "965",
    "PARENT_ID": "964",
    "CODE": "320901",
    "NAME": "市辖区"
  },
  {
    "ID": "966",
    "PARENT_ID": "964",
    "CODE": "320902",
    "NAME": "亭湖区"
  },
  {
    "ID": "967",
    "PARENT_ID": "964",
    "CODE": "320903",
    "NAME": "盐都区"
  },
  {
    "ID": "968",
    "PARENT_ID": "964",
    "CODE": "320921",
    "NAME": "响水县"
  },
  {
    "ID": "969",
    "PARENT_ID": "964",
    "CODE": "320922",
    "NAME": "滨海县"
  },
  {
    "ID": "97",
    "PARENT_ID": "89",
    "CODE": "130424",
    "NAME": "成安县"
  },
  {
    "ID": "970",
    "PARENT_ID": "964",
    "CODE": "320923",
    "NAME": "阜宁县"
  },
  {
    "ID": "971",
    "PARENT_ID": "964",
    "CODE": "320924",
    "NAME": "射阳县"
  },
  {
    "ID": "972",
    "PARENT_ID": "964",
    "CODE": "320925",
    "NAME": "建湖县"
  },
  {
    "ID": "973",
    "PARENT_ID": "964",
    "CODE": "320981",
    "NAME": "东台市"
  },
  {
    "ID": "974",
    "PARENT_ID": "964",
    "CODE": "320982",
    "NAME": "大丰市"
  },
  {
    "ID": "975",
    "PARENT_ID": "880",
    "CODE": "321000",
    "NAME": "扬州市"
  },
  {
    "ID": "976",
    "PARENT_ID": "975",
    "CODE": "321001",
    "NAME": "市辖区"
  },
  {
    "ID": "977",
    "PARENT_ID": "975",
    "CODE": "321002",
    "NAME": "广陵区"
  },
  {
    "ID": "978",
    "PARENT_ID": "975",
    "CODE": "321003",
    "NAME": "邗江区"
  },
  {
    "ID": "979",
    "PARENT_ID": "975",
    "CODE": "321012",
    "NAME": "江都区"
  },
  {
    "ID": "98",
    "PARENT_ID": "89",
    "CODE": "130425",
    "NAME": "大名县"
  },
  {
    "ID": "980",
    "PARENT_ID": "975",
    "CODE": "321023",
    "NAME": "宝应县"
  },
  {
    "ID": "981",
    "PARENT_ID": "975",
    "CODE": "321081",
    "NAME": "仪征市"
  },
  {
    "ID": "982",
    "PARENT_ID": "975",
    "CODE": "321084",
    "NAME": "高邮市"
  },
  {
    "ID": "983",
    "PARENT_ID": "880",
    "CODE": "321100",
    "NAME": "镇江市"
  },
  {
    "ID": "984",
    "PARENT_ID": "983",
    "CODE": "321101",
    "NAME": "市辖区"
  },
  {
    "ID": "985",
    "PARENT_ID": "983",
    "CODE": "321102",
    "NAME": "京口区"
  },
  {
    "ID": "986",
    "PARENT_ID": "983",
    "CODE": "321111",
    "NAME": "润州区"
  },
  {
    "ID": "987",
    "PARENT_ID": "983",
    "CODE": "321112",
    "NAME": "丹徒区"
  },
  {
    "ID": "988",
    "PARENT_ID": "983",
    "CODE": "321181",
    "NAME": "丹阳市"
  },
  {
    "ID": "989",
    "PARENT_ID": "983",
    "CODE": "321182",
    "NAME": "扬中市"
  },
  {
    "ID": "99",
    "PARENT_ID": "89",
    "CODE": "130426",
    "NAME": "涉县"
  },
  {
    "ID": "990",
    "PARENT_ID": "983",
    "CODE": "321183",
    "NAME": "句容市"
  },
  {
    "ID": "991",
    "PARENT_ID": "880",
    "CODE": "321200",
    "NAME": "泰州市"
  },
  {
    "ID": "992",
    "PARENT_ID": "991",
    "CODE": "321201",
    "NAME": "市辖区"
  },
  {
    "ID": "993",
    "PARENT_ID": "991",
    "CODE": "321202",
    "NAME": "海陵区"
  },
  {
    "ID": "994",
    "PARENT_ID": "991",
    "CODE": "321203",
    "NAME": "高港区"
  },
  {
    "ID": "995",
    "PARENT_ID": "991",
    "CODE": "321204",
    "NAME": "姜堰区"
  },
  {
    "ID": "996",
    "PARENT_ID": "991",
    "CODE": "321281",
    "NAME": "兴化市"
  },
  {
    "ID": "997",
    "PARENT_ID": "991",
    "CODE": "321282",
    "NAME": "靖江市"
  },
  {
    "ID": "998",
    "PARENT_ID": "991",
    "CODE": "321283",
    "NAME": "泰兴市"
  },
  {
    "ID": "999",
    "PARENT_ID": "880",
    "CODE": "321300",
    "NAME": "宿迁市"
  }
];



